[["The problem with the Dodgers is a problem with most of baseball...", "38", "0", "2023-10-18T05:09:28.560000+0000", "https://www.reddit.com/r/Dodgers/comments/17aisi0/the_problem_with_the_dodgers_is_a_problem_with/", "Lifelong baseball and Dodger fan here and what I'm about to say may not be popular. Generally speaking: Baseball is boring. Hear me out... It's largely why baseball struggles to grow its fanbase -- limited by regional exposure and TV syndication and struggling to attract a broader audience because there are very few personalities in baseball.  Like most baseball teams (minus the Phillies), the Dodgers suffer from this. I realize it's an insane argument to make when we win 100 games, and when guys like Mookie and Freddie are putting up insane numbers in the regular season. But is it too greedy to ask for a little swag on top of it all? For a little personality? For a post-game interview that doesn't feel like the most eye-roll PR talking-points of \"well we just made a game plan and went out there and found our pitches...\" . It's funny - I watched maybe 120 games this season, and I can barely remember any of them. I remember us generally being solid... but, any real memorable moments ? So what is \"Swag\" and how is it measured? How could one even possibly scout for this? I confess, I don't know. Guys like Machado \"felt wrong\" for our team, so maybe not all bravado is created equal. Other times, swag tends to backfire on us (Urias, Trevor B...). But despite the new rules that create much more exciting gameplay IMO, the sport still lacks the \"big balls Pete\" mentality that elevates the entire sport. While I appreciate Mookie's sportsmanship and respect he has among other ballplayers, a dash of boldness now and then wouldn't hurt. With the rare exception of teams like this year's Phillies, it feels like baseball is almost designed to be even-keeled, subdued and homogenous. Don't rock the boat, or you'll ruin the streak -- don't rock the boat, you'll get sent down....  Why is baseball designed to be boring??   Is it the amount of games that makes it impossible to sustain that kind of attitude?   Is it the superstition of acting too cocky? Fear of retribution?   Is it the 10,000 players in the farm leagues all dying to take your spot that makes you toe-the-line?   Is it the fair-weather LA fans (or perhaps more generously: the traffic-concerned LA-fan base...) ?   Is it an LA problem where we're used to and expect championships and nothing less (compared to the mostly battered sports town of Philly and their understandable hunger to win?)?   Or is it simply that losing is boring and this argument wouldn't exist if we were winning?   I could be way off base here, but would love to hear your thoughts as I'm clearly trying to understand this myself. If you agree with this, what's at the heart of it and how could it be fixed? Suffice it to say, feels like baseball -- and for sure the Dodgers - need some cajones. Or maybe just a Bryce Harper. Thanks for letting me rant.       "], ["A problem with deathclaws and a baseball bat", "0", "1", "2024-05-24T03:50:19.810000+0000", "https://www.reddit.com/r/fo4/comments/1czbska/a_problem_with_deathclaws_and_a_baseball_bat/", "My problem is focused around Cito's shiny slugger and some of the larger enemies scattered around the wasteland, but mostly deathclaws. Whenever I enter VATS and attempt to smack them around a little bit, there is a small chance for them to be teleported about 50 feet in the air and fall to their death. How do I fix this, or is it something that I will have to live with? Another thing: today, while trying to kill as many animals as possible, I found a mythic deathclaw sleeping peacefully inside the house in Robotics Pioneer Park. I tried to get a good shot in VATS on the thing. As I proceeded to do so, I noticed that the name and the health bar were green like a friendly NPC. I quickly figured out it was, in fact, not friendly, and it's not a good idea to attack one with a baseball bat. TLDR: bat sends monsters sky high and \"friendly\" deathclaw isn't so nice when someone interrupt its slumber    "], ["WTF is the problem with this team at home?", "47", "32", "2024-04-03T03:26:34.049000+0000", "https://www.reddit.com/r/Astros/comments/1buijl6/wtf_is_the_problem_with_this_team_at_home/", "What's with this team and it's ability to consistently play dogshit baseball at home? Spring slump? Is it still the batters eye? Is there no chemistry on this team? No leadership? I know it's extremely early in the season and this is full blown over exaggeration mode, but the fact that most of our losses were on close games where our hitters couldn't capitalize on RISP is concerning to say the least    "], ["Isaac Paredes and the Problem with Overvaluing Statcast", "94", "0", "2024-03-07T08:09:14.685000+0000", "https://www.reddit.com/r/fantasybaseball/comments/1b8pax9/isaac_paredes_and_the_problem_with_overvaluing/", "The fantasy community, and quite frankly, the baseball community has become a slave to stacast. I'm not saying it's a valuable tool because it is, but making all of your decisions based on stacast is just completely misguided. And if everyone is using the same tool, what advantage are you really getting? None. This is where Isaac Paredes comes into a play. A hitter who has poor batted ball data. Amateurs will look at his data and will conclude that he is due for regression. Do not do this. You guys know that Paredes is elite at pulling the ball in the air (very similar to Nolan Arenado). Pulled fly-balls is the best outcome for a hitter. It's what every hitter should be trying to accomplish at the plate. Parades ADP is #179. Still comically low. The market does not believe in him. Well, you should. This is why you should not pay for 3rd baseman. It's a deep position. Do not pay for the Devers or Riley. You will get value if you wait for guys like Hayes and Paredes. Make bank, people.    "], ["Is there a problem with competitive 3 inning modes?", "68", "0", "2023-11-11T16:32:27.342000+0000", "https://www.reddit.com/r/MLBTheShow/comments/17sy267/is_there_a_problem_with_competitive_3_inning_modes/", "We are all aware of the randomness and often BS of this game. In 3 inning games, with only 9 outs if u have 2 or 3 perfect outs and ur opponent gets a bloop hit or 2 in important situations that could be the game, regardless of who played better. I know everyones favorite response is â\u0080\u009cthats baseballâ\u0080\u009d but its not. Its a game and whoever plays better should win. Really makes it hard to play BR sometimes when u cant get a hit with triple digit exit velos and ur opponents gets 3 up the middle squibbers in a row.    "], ["Problem with Streak/Span searches", "12", "4", "2024-03-18T22:29:00.501000+0000", "https://www.reddit.com/r/sportsreference/comments/1bi41db/problem_with_streakspan_searches/", "Hi all! Hoping someone can help me with an issue I've run into with span/streak searches on Stathead. Whenever I select \"From start of career\" under \"streak options\", the results don't appear to be right. For instance, I was looking for the following: --Most strikeouts by an Orioles pitcher through his first 13 career starts in club history ( https://stathead.com/baseball/player-pitching-span-finder.cgi?request=1&timeframe=seasons&year_max=2023&span_length=13&span_type=career_start&ccomp%5B1%5D=gt&cval%5B1%5D=40&cstat%5B1%5D=p_so&team_id=BAL ). I remember looking this up last year and getting more results--if I recall, guys like Tom Phoebus and Mike Mussina were on this list. For whatever reason, my search (above) yields current players only. Was wondering if there was something I was doing wrong for retired players to be excluded.    "], ["The Problem With Televised Lacrosse", "16", "0", "2024-06-03T20:16:22.539000+0000", "https://www.reddit.com/r/lacrosse/comments/1d7ecrw/the_problem_with_televised_lacrosse/", "I watched the season openers to the PLL this weekend and noticed something interesting: you can't really see the ball . The only time you can really see it is when it's on the ground and you can see the contrast. Otherwise, it looks like they're playing with an invisible ball. Maybe they need colored balls or black sticks but as it is, it's invisible. I don't know how baseball deals with this problem but it's the only other televised sport I can think of that uses a small, white ball. They need to fix this if they want it to be more consumable by the television audience.    "], ["Solve Arizona's problem with this one neat trick", "9", "14", "2024-04-11T05:00:06.453000+0000", "https://www.reddit.com/r/NHLcirclejerk/comments/1c16oit/solve_arizonas_problem_with_this_one_neat_trick/", "Arizona's rink is too small, they need a bigger stadium. They are also the least valuable team in the NHL with Forbes putting their valuation around $500m. Now, I have a personal bias, because I love the Coyotes and I want to see them make it. And I also feel like maybe in a different market they could really build a bigger base and get some funds flowing, but they just aren't grabbing any headlines being the worst NHL team over the last 10 years with a w-l-t record of 301-393-86. They need something that gets everyone's attention. The Oakland A's are experiencing something very similar, moving over to a minor league field in Sacramento. I propose a new event based on the Winter Classic and Stadium Series model, wherein two professional sports teams that are struggling the hardest in their sport compete against each other in a 3 game series. So let's take Arizona and Oakland. One game takes place at the Shark Tank near Oakland, with the A's playing the Coyotes in Ice Hockey. Next game is at the Diamondback's Chase Field in Phoenix, and the sport is Baseball. If it's a tie in the series, I'm not sure what the tie breaker should be, but let's say the Coyotes win the hockey game and the baseball game? The Coyotes play the Diamondbacks. Just like the Winter Classic and Stadium Series, there will be limited edition jerseys (which hopefully will be sought after, because you're buying a limited edition jersey from a team that might be folding soon), there will be other attractions and media booths because it's less of a sports game and more of an \"event,\" basically there will be opportunities to make money for the city, for sponsors, and for the team. So with all that excess money changing hands? The winner of the series gets a cash infusion into their team. Just like that? Boom, the Coyotes and A's both have cool headlines in the news with some buzz being generated, and maybe even new Hockey fans come from it.    "], ["The Problems With the 2024 Topps Chrome Baseball Release ", "78", "68", "2024-06-28T20:47:46.184000+0000", "https://www.reddit.com/r/baseballcards/comments/1dqtutp/the_problems_with_the_2024_topps_chrome_baseball/", "Topps Chrome Â will not be released untilÂ July 17, 2024 , but there are already potential problems. There was great excitement around this release, considering how many great baseball rookies have been coming out recently. But that enthusiasm has cratered. Sellers are reporting problems preselling the product. People are not buying at anywhere near the number you would expect. Why? The problems with 2024 Topps Chrome Baseball retail prices The prices of blaster boxes have shot up, withÂ each box now selling for $40 Â from Fanaticsâ\u0080\u0094OK, $39.99. This is a significant increase from the usual $20-25 price point we've come to expect. As a result, the final cost when purchased fromÂ Walmart Â orÂ Target , including taxes, could be closer to $50. And what do you get for this inflated price? The exact number of cards and the same number of packs, and no improvement in quality. We will soon discover thatÂ the quality seems to have taken a hit . There is no justification whatsoever for this sudden, massive price increase. The problems withÂ 2024 Topps Chrome Baseball Hobby box prices The staggering increase in blaster prices has left many of us reeling. However, the prices for hobby boxes, in contrast, are more of a wild card. While undeniably high, the $209.95 pre-order price tag on 2024 Topps Chrome Baseball did not shock many. This unpredictability should serve as a warning to all potential buyers, urging them to proceed with caution. However, a look back at 2023 Topps Chrome Baseball pre-order pricesÂ shows those boxes sold for $130 . That is an increase of 61%, precisely the same increase that we see in retail. Therefore, Fanatics is not giving you any cheap options this year. The problem with 2024 Topps Chrome Baseball Retail odds There are some guaranteed cards in your 2024 Topps Chrome Baseball retail products. And thank goodness for that because there is very little else you can expect. Here are some examples with notable hits you may want to pursue in retail and monster box formats: || || |Card|Retail Odds|Monster Box Odds| |Negative Refractor|1:249|1:101| |Purple Refractor|1:403|1:164| |Blue Refractor|1:669|1:271| |Green Refractor|1:1016|1:413| |Gold Refractor|1:2014|1:817| |Orange Refractor|N/A|N/A| |Black Refractor|N/A|N/A| |Red Refractor|1:20,184|1:8336| |SuperFractor|1:104,587|1:40,062| |Printing Plates|1:25,281|1:10,610| |Rookie Autographs|1:124|1:81| |Rookie Autographs Refractor|1:319|1:236| |Rookie Autographs Black Refractor|N/A|N/A| |Future Stars Autographs|1:124,479|1:70,023| |On The Spot Die-Cut Autographs|1:74,688|1:40,062| |Dual Autographs|1:560,154|1:175,056| |Authentics Autographs|N/A|N/A| The numbers speak for themselves.Â You will have difficulty landing any parallels or autos in blasters or monster boxes . The rates are abysmal and far worse than we are used to. When you consider that, along with the much higher prices, the reduction in value is considerable. Fanatics appear to be making their basters intentionally weaker than in previous years. We have to wonder why.    "], ["The Problems With 2024 Topps Chrome Baseball", "1", "2", "2024-06-28T20:02:45.909000+0000", "https://www.reddit.com/r/baseballcards/comments/1dqstm0/the_problems_with_2024_topps_chrome_baseball/", "Topps Chrome Â will not be released untilÂ July 17, 2024 , but there are already potential problems. There was great excitement around this release, considering how many great baseball rookies have been coming out recently. But that enthusiasm has cratered. Sellers are reporting problems preselling the product. People are not buying at anywhere near the number you would expect. Why? The problems with 2024 Topps Chrome Baseball retail prices The prices of blaster boxes have shot up, withÂ each box now selling for $40 Â from Fanaticsâ\u0080\u0094OK, $39.99. This is a significant increase from the usual $20-25 price point we've come to expect. As a result, the final cost when purchased fromÂ Walmart Â orÂ Target , including taxes, could be closer to $50. And what do you get for this inflated price? The exact number of cards and the same number of packs, and no improvement in quality. We will soon discover thatÂ the quality seems to have taken a hit . There is no justification whatsoever for this sudden, massive price increase. The problems withÂ 2024 Topps Chrome Baseball Hobby box prices The staggering increase in blaster prices has left many of us reeling. However, the prices for hobby boxes, in contrast, are more of a wild card. While undeniably high, the $209.95 pre-order price tag on 2024 Topps Chrome Baseball did not shock many. This unpredictability should serve as a warning to all potential buyers, urging them to proceed with caution. However, a look back at 2023 Topps Chrome Baseball pre-order pricesÂ shows those boxes sold for $130 . That is an increase of 61%, precisely the same increase that we see in retail. Therefore, Fanatics is not giving you any cheap options this year. The problem with 2024 Topps Chrome Baseball Retail odds There are some guaranteed cards in your 2024 Topps Chrome Baseball retail products. And thank goodness for that because there is very little else you can expect. Here are some examples with notable hits you may want to pursue: || || |Card|Retail Odds|Monster Box Odds| |Negative Refractor|1:249|1:101| |Purple Refractor|1:403|1:164| |Blue Refractor|1:669|1:271| |Green Refractor|1:1016|1:413| |Gold Refractor|1:2014|1:817| |Orange Refractor|N/A|N/A| |Black Refractor|N/A|N/A| |Red Refractor|1:20,184|1:8336| |SuperFractor|1:104,587|1:40,062| |Printing Plates|1:25,281|1:10,610| |Rookie Autographs|1:124|1:81| |Rookie Autographs Refractor|1:319|1:236| |Rookie Autographs Black Refractor|N/A|N/A| |Future Stars Autographs|1:124,479|1:70,023| |On The Spot Die-Cut Autographs|1:74,688|1:40,062| |Dual Autographs|1:560,154|1:175,056| |Authentics Autographs|N/A|N/A| The numbers speak for themselves.Â You will have difficulty landing any parallels or autos in blasters or monster boxes . The rates are abysmal and far worse than we are used to. When you consider that, along with the much higher prices, the reduction in value is considerable. Fanatics appear to be making their basters intentionally weaker than in previous years. We have to wonder why.    "], ["Rusty baseball eu 3ds problems with dlc", "5", "1", "2023-10-06T17:57:44.786000+0000", "https://www.reddit.com/r/3dspiracy/comments/171j46y/rusty_baseball_eu_3ds_problems_with_dlc/", "I tried to use the luma region changer    "], ["Trying to play MVP Baseball 07 (PS2) on slim PS3. Having problems with compatibility. Tried loading through Managun Z but didnt work", "0", "1", "2023-07-04T02:20:22.542000+0000", "https://www.reddit.com/r/ps3homebrew/comments/14q25bl/trying_to_play_mvp_baseball_07_ps2_on_slim_ps3/", "Please help if you know the problem. keeps giving me compatibility errors. My friend tried converting the .ISO to PKG and he got the same error on the console.    "], ["NGPC adapter issue with Baseball Stars Color...", "2", "3", "2024-03-08T21:41:01.240000+0000", "https://www.reddit.com/r/AnaloguePocket/comments/1ba054b/ngpc_adapter_issue_with_baseball_stars_color/", "Unsure if anyone else is getting this issue, but the game seems to hang mid inning. Doesn't matter if the batter is thrown out or not, the game does not progress to the next batter and stays on the field. Does not freeze, just does not advance.    "], ["Whatâ\u0080\u0099s the issue with bullpen games?", "78", "64", "2023-07-31T01:04:26.449000+0000", "https://www.reddit.com/r/SFGiants/comments/15e20x2/whats_the_issue_with_bullpen_games/", "Title. Genuinely asking here as I'm fairly new to baseball. But if our bullpen keeps winning games when we do a BP game, then how come so many people are against this strategy? Seems to be working in our favor.    "], ["Issue with textures (?) after installing nexgen update", "6", "4", "2024-04-25T21:14:07.671000+0000", "https://www.reddit.com/r/fo4/comments/1cd2zir/issue_with_textures_after_installing_nexgen_update/", "For people who avoided any kind of news about the next gen update or any new content probably stop reading. I don't think I'm spoiling anything but just to be sure... So I started a new game in the last week and am playing on series. X.  I did install some mods for things like blood texture and quality of life and I think maybe like a skin texture mod (this last one I removed 10-15 hours of gameplay ago) Loaded up the nexgen update today and loaded my save and went through the hoops about missing mods and do you want to continue so I did for a while and then shortly after re-added my mods. Played for at least an hour. Finishing up an early far harbor quest and then went back to the Commonwealth and started one of the new quests from the next gen update. When I got to the building you're supposed to go retrieve something from. I get to the third floor there were three or four huge red diamonds with exclamation marks in the room that never cleared after picking up any items.  The new fat boy that fires the piggy banks is also a problem as are baseballs. When you launch a piggy bank they come out as little red diamonds. I have a weapon that fires baseballs and it fires tiny little red diamonds instead of baseballs. Anyone else having this problem? Is it the mods I have even though they are seemingly unrelated to these textures/mesh in question? I've also seen it with bottle cap mines or something similar (not regular frag mines). I did uninstall and reinstall everything as well since seeing the issue.    "], ["Is anyone else having an issue with the newer grenade launchers/Piggy bank fat-man on Xbox", "5", "1", "2024-05-09T19:26:10.384000+0000", "https://www.reddit.com/r/Fallout/comments/1co5ma3/is_anyone_else_having_an_issue_with_the_newer/", "I don't know about yall, but on Xbox at least, there is an issue where all the grenade launchers (baseball launcher, Chinese launcher, etc) and the piggy bank fat man is invisible when its in my hands. Its even invisible when you try to view it in your pip-boy. How long will they take to fix it, have they addressed it, and is anyone else having the same problem?    "], ["Issue with pulling Max/Min data", "10", "1", "2024-05-09T13:41:23.694000+0000", "https://www.reddit.com/r/googlesheets/comments/1cnxkts/issue_with_pulling_maxmin_data/", "Hey guys, fairly novice sheets user here struggling with an issue currently. Last night me and my buddy dragged in all of our fantasy baseball history, every matchup with all of the stats. Basically we wanted to set up a data base that pulled all of our records into one spot. So for instance we can see who had the highest amount of home runs in a week ever. It was easy to pull the max homerun number out of the sheet of data, however I can't figure out a way to then correlate that number with the name of the team that did it and the week they did it in. I tried doing a index(match((max) formula but that didn't work, figured maybe I would need to use vlookup but I cannot really figure any of it out. Is there at least a way to use the max function and maybe have it so that when you click on the number it pulls it can bring you to the exact spot in the data that it comes from so I can quickly figure out who did it and when? Please let me know if this makes sense and if anyone has a solution lol EDIT: Here is a link to the sheets https://docs.google.com/spreadsheets/d/1TSiyIVSTkBEKcr1MsurvERc0fSg7thSHjCF1FOhxWfw/edit?usp=sharing     "], ["One issues with Moneyball", "37", "0", "2024-06-21T15:53:49.995000+0000", "https://www.reddit.com/r/movies/comments/1dl7bg5/one_issues_with_moneyball/", "I just watched Moneyball for the first time. Really great film. One thing that struck me as being incorrectly represented for the time period though is that with this starting in late September/early October of â\u0080\u009801, there should have been a wholeeeee lot more patriotic set decoration owing to the fact that 9/11 had just recently happened. Anyone that lived through that time knows that you couldn't throw a stone (or a baseball) without hitting an American flag or some other related ephemera. Just a thought.    "], ["We all have issues with building settlements, but why couldn't they make a \"clean\" version of stuff.", "88", "356", "2024-06-03T00:37:33.723000+0000", "https://www.reddit.com/r/fo4/comments/1d6rvsu/we_all_have_issues_with_building_settlements_but/", "I know it's a 200 year old shit hole out there, but when I build or craft a \"new\" item it looks like I pulled it from the scrap yard. It would be nice if they had made clean versions of stuff. Edit: To further elaborate, I mean you re-forge steel, use fresh trees, and new-in-bag concrete and end up with end up with rough looking stuff. I understand some stuff like a fence might have been a shack or reusing the houses in Sanctuary for a metal house.    "], ["Respiratory issues with vaping", "5", "4", "2024-06-18T11:43:23.577000+0000", "https://www.reddit.com/r/stopsmoking/comments/1diom68/respiratory_issues_with_vaping/", "Hey everyone, I just joined this sub today because I've been having some respiratory issues and have become concerned about my vaping habits. Some background: I have played sports for the majority of my life very consistently from ages 4 to 15. I'm 23M now. I was a baseball pitcher, so definitely nowhere near being considered very athletic, but regardless never had much issue with stamina apart from jogging. I got back into tennis a few months ago and was able to play for like 30 mins at a time with no breaks. I had become rather sedentary after I quit baseball at 15, but still regularly exercised, mostly free weights and even did olympic lifting for about a year starting 2ish years ago. In the past couple weeks, I started noticing that I'd get really winded playing tennis for even like 5 mins at a time. I play pickleball as well and similar issues arose. I have been vaping for over 2 years or so now, and have been smoking weed since I was 17. I'm in the blistering heat of Florida right now, so my respiratory issues could be partially due to heat exhaustion, but I'm starting to think it's more than that. It feels like I can't catch my breath, and I get winded quicker after each break. I've also used inhalants for some time so that's an issue too, but I find that easier to stop than vaping. I guess my question is, has anyone had a similar experience that has caused concern about their smoking habits? And maybe also, should I see a doctor about this soon? It's heavily affecting my ability to play sports. My parents don't know about my smoking, so they just think I'm out of shape, which is probably also true. Kind of just trying reasons to kick this stupid habit. Tips for quitting are appreciated! TLDR; Staring noticing respiratory issues playing sports and think its because of vaping. Childhood athlete but haven't been as active in recent years    "], ["Does anyone else have issues with bruising?", "14", "13", "2024-05-30T17:52:16.215000+0000", "https://www.reddit.com/r/Hypermobility/comments/1d49z87/does_anyone_else_have_issues_with_bruising/", "Hey everyone, I have a weird question for all of you. Does anyone else not really bruise? I've been diagnosed with HSD for about 4 years now, but even before that I didn't really bruise. I can count the number of bruises I've ever had on one hand and they've all been cause by either getting my blood drawn or getting an injection. I know of multiple instances where I know I should have gotten bruises, but never did. e.g. having baseballs thrown at me full force, being thrown at multiple walls, and the dislocations I have daily. So is this a hypermobility thing or is my body just weird?    "], ["Anyone having issues with xfinity stream?", "8", "1", "2024-04-16T23:59:37.988000+0000", "https://www.reddit.com/r/Comcast_Xfinity/comments/1c5vgn7/anyone_having_issues_with_xfinity_stream/", "More specifically in Washington state? Cable on the living room tv is fine, internet is fine, however the bedroom TV has a firestick, all other apps on the tv work fine. Xfinity stream worked until last night, tried loging out, uninstalling, and no change. Channel names and icons will load, but no programming, just 3 dots. No error message. I just want to watch baseball when i go to bed dang it lol.    "], ["Issues with Goldin", "2", "0", "2024-05-14T15:42:15.063000+0000", "https://www.reddit.com/r/baseballcards/comments/1crv9s6/issues_with_goldin/", "Anybody have issues with Goldin auctions site and how they deliver? I won 4 PSA baseball cards, which totaled $115. After fees, shipping, buyers premiums, etc etc, I ended up being on the hook for close to $160. That's Goldin. I pay, wait patiently for my cards. 2 weeks goes by, and I receive a card from another auction that I won. I reach out to customer support asking where the first 4 cards were. She said that they were unable to be delivered (which I think is BS because I've received all my other packages from them). Then I was told my cards were going back to a â\u0080\u009cvaultâ\u0080\u009d and I could request them. Now they are returned, and I go to request my own cards, and I'm being told that there is a $6 fee PER CARD,m to get them since they have not been in the vault for 90 days. I'm new to the hobby, but this seems like a Surefire way to make sure no one returns to your brand @kengoldinreddit12    "], ["Issues With Adaptive Volume", "2", "1", "2023-10-29T16:41:14.002000+0000", "https://www.reddit.com/r/airpods/comments/17j6vhu/issues_with_adaptive_volume/", "Went to a football game Friday night, and was listening to a baseball game (using APP2). Every time the announcer spoke or the lady behind me spoke, volume would reduce. I like the adaptive mode, but the constant down and up volume was annoying. Is anyone else having issues with adaptive mode?    "], ["Trouble with Osaka baseball tickets", "0", "0", "2024-03-04T17:02:43.902000+0000", "https://www.reddit.com/r/JapanTravelTips/comments/1b6g1xn/trouble_with_osaka_baseball_tickets/", "The Orix Buffaloes website isn't sending me the confirmation email, and the only other option I can find is japanballtickets which charges a $70 delivery fee. Is there another way to buy tickets in advance? TIA!    "], ["Having trouble with my swing ", "0", "1", "2024-03-17T15:43:19.851000+0000", "https://www.reddit.com/r/GolfSwing/comments/1bh0nka/having_trouble_with_my_swing/", "Driving is my main problem. I tend to \"baseball swing\" and the ball barely goes. I'm serviceable everywhere else.    "], ["Struggling with my baseball fandom today", "87", "128", "2023-11-16T20:26:08.114000+0000", "https://www.reddit.com/r/orioles/comments/17wwj5c/struggling_with_my_baseball_fandom_today/", "For those not following the news, today the owners of the MLB teams, including the Orioles' owner, voted unanimously for the Athletics to relocate to Vegas. It's a really bad day in baseball history and it's going to make it super hard to care about baseball going forward, at least for me. So many cities are being threatened with losing their teams so their billionaire owners can extract more wealth from struggling cities' budgets and this sets a bad precedent. I love baseball. I've been a lifelong Orioles fan, my grandparents were season ticket holders for decades and started to attend games literally the moment the Orioles came to Baltimore (my grandfather also ran a farm team and coached little league for decades in my western MD hometown). While the Orioles have always been my home team, I have come to love the A's ever since moving to Oakland 10 years ago, and I root for them as my 2nd choice team. If you have never been to the Oakland Coliseum for an A's game, I'm truly sorry you missed out. I've been to 8 baseball stadiums and outside of Camden Yards. There's been no other place I'd rather watch baseball. As a stark contrast to SF Giants fans, the A's fans are some of the most passionate, die-hard fans I've ever experienced. Even as Fisher under invested in the team, sold of the best players, closed concessions, jacked up ticket prices, and started to threaten to leave as soon as he bought the team, A's fans always made that stadium feel electric whether it was sold out or just a couple of thousand fans. It feels like an extra shitty day in baseball as the MLB owners voted to waive relocation fees and allow a billionaire trust fund baby to abandon one of the most diverse cities in the country, with one of the largest and wealthiest baseball markets, and perfect weather most days of the year, to set up shop in Vegas, a small market in the middle of the desert. If the Raiders games are any indication, future A's players will be playing in a mostly empty stadium where most of the fans will be rooting for the opposing team. Who wants to watch baseball in 120 degree weather? Anyway, thanks for letting me rant. I'm sad and angry, and feeling frustrated with Manfred, MLB team owners, and it sucks watching people who don't know anything about the situation or Oakland talk shit about this beautiful city, much like how people denigrate Baltimore without knowing what they're talking about. I hope one day billionaires are taxed into oblivion. Especially trust fund billionaires who did nothing to deserve their wealth other than to luck into a family (and in John Fisher's case, a family who's wealth was largely built off of sweatshop labor).    "], ["Struggling with my fandom", "74", "0", "2023-11-16T15:40:37.652000+0000", "https://www.reddit.com/r/angelsbaseball/comments/17wpvtn/struggling_with_my_fandom/", "It was officially announced about 30 minutes ago that MLB approved the relocation of the Athletics to Las Vegas. This relocation saga has plagued me, my home, and my community for some time. I'm from the LA area, born and raised. I went red when most everyone else in the neighborhood went Dodger blue. I got to see my team win their one and only World Series title, watched it on tv with my dad. Have continued to be a fan through all of the clubs bullshit these last almost 40 years. But now I'm supposed to blindly march forward with my fandom knowing our crap owner could pull the same bullshit as John Fisher, and that MBL will without issue support it. That shit don't fly for me. I moved away from the southland to pursue college in NorCal. Been here in the east bay for some time now. My partner of 8 years is a diehard A's fan. Baseball was a cornerstone in our home; we went to every Angels/A's game when Anaheim came up to Oakland. We both hated on our respective regional rivals (her the Giants, and me the Dodgers). Being a fan of the bigger better ball clubs was easy. Being a fan of our teams was a choice and took work. That's what being an underdog is all about. We have matching OG Starter jackets, new school Starters, matching ugly christmas sweaters, custom jerseys, hell, we have a reversable team blanket on our bed (winners team gets to have their team up for the night). Baseball is a cornerstone in our relationship, specifically Oakland baseball. I've now easily seen more games at the Coliseum than back in LA during my childhood. Local east bay baseball means a great deal to us, so we were passionate about this relocation. But now, how am I (and even her more so) supposed to continue supporting MLB for ripping baseball away from our community, from us? I am appalled at the handling of the relocation in support of a broke billionaire that wants nothing more than free money. And to hear there are almost 7 other teams (including our own) waiting in the wings to pull the same stunt is inexcusable. This scam professional sport teams pull for public money in exchange for our fandom is a greedy attempt of making money at the expense of the poor. These organizations and teams are asking for our hard earned dollars upfront and then stealing our wallet to further line their own pockets. How much money do these owners really need? It's an embarassment, and they should all be ashamed for supporting the distruction of our love for the game. Thanks clown-shoes Manfred, limp-dick Fisher, and everyone other owner that voted yes for ruining something so special to so many people. With the Athletics completing their move to Vegas, baseball is officially dead in our home. The romance of the game is forever gone. Today I hang up my Angels hat.    "], ["Struggling with roster choices", "46", "7", "2024-06-10T11:50:43.364000+0000", "https://www.reddit.com/r/MLBTheShow/comments/1dcjllm/struggling_with_roster_choices/", "I wanna mess with s2 cards more but the facts are facts. They kinda suck, I definitely suck and both of those can't happen if I wanna win any baseball. That Castillo captain bonus is just so good I can't let it go but that's 19 roster slots. What's everyone else doing?    "], ["Wrist set importance! What small change did you make that completely unlocked your golf swing? A post for baseball players struggling with consistency.", "7", "5", "2023-06-29T16:22:25.525000+0000", "https://www.reddit.com/r/golf/comments/14m9bj5/wrist_set_importance_what_small_change_did_you/", "Typical baseball to golf convert here. Started practicing seriously this year and fighting all the typical muscle memory related wrist and arm movements from years of baseball training. My hand eye is excellent but my consistency is abysmal which can be so frustrating. I try to stay positive and keep at it. I rely on Danny Maude (YouTube) religiously for help whenever I'm lost and trying to better understand the golf swing- he's 10/10 excellent for anyone new or struggling who hasn't watched him. I'm so impressed with his way of explaining things that I sometimes make my girlfriend watch a quick video because it's that exciting to figure out one more aspect of a proper swing. I can't recommend him enough. I just happened upon a random 30 second YouTube clip from the dark haired polo guy who looks like he definitely own a small yacht - talking about the wrist set showing how the pros almost fold their lead wrist up and over the club/trail wrist in the back swing. I couldn't do this naturally, it felt forced and terrible but once I started setting my wrists like that from the jump I was able to hold it in the backswing. This completely unlocked my natural golf swing. I can't believe it, so for anyone struggling with inconsistency, the typical wrist flip, and maybe have a swing where you unnaturally focus on your arm movement in the backswing-you've gotta try this. Yes it makes sense for the feet/hands to be the most important part of setup up for a consistent swing but this small change has been incredible for me. The most impressive thing is it makes it impossible to chicken wing the trail arm and locks it into a completely natural stopping point from which I can drive down and towards the ball- which I needed so badly, to be able to feel a natural/solid stopping point effectively stopping me from over extending and getting into a baseball ready position from which point so many things can go wrong. Seriously check it out if you're struggling! If you've read this far I'd love to know what small change you made lead to a more consistent swing for you?    "], ["Iâ\u0080\u0099m struggling with my sexuality", "12", "1", "2024-02-17T07:40:51.774000+0000", "https://www.reddit.com/r/AdviceForTeens/comments/1aswhgj/im_struggling_with_my_sexuality/", "So me (M 14) has always been a relatively normal guy. I do stereotypical masculine things like football, baseball, etc. I have also always been taught that being LGBTQ+ is wrong and I should never partake or interact with it. Lately since I was about 13 I keep finding myself sexually attracted to other guys. I'm entering the horny teenage boy years so i'm just now discovering what I like and what I like is men. I am bisexual as I still like women but I think i'm going to wait until i'm out of the house to tell my parents. Should I tell them sooner? Please give me general advice in comment ð\u009f\u0099\u008f    "], ["Struggling with the Mishandling of Bee Swarms", "1", "3", "2024-05-02T18:22:29.319000+0000", "https://www.reddit.com/r/TrueOffMyChest/comments/1cimt43/struggling_with_the_mishandling_of_bee_swarms/", "I need to vent about something that's been deeply disturbing me recently, the way bee swarms are being handled. Two weeks ago, a swarm settled in a tree at my apartment complex. Some residents, including myself, reached out to a local beekeeper, hoping to safely relocate these thousands of bees for FREE. However, before the beekeeper could arrive, pest control was called in, and they exterminated the entire swarm. The situation repeated itself on a larger stage just yesterday, at a baseball game in Arizona where a docile swarm of 20,000 bees delayed the game. It's all over the news right now. The crowd cheered as an exterminator, mistakenly hailed as a beekeeper, killed the bees while hyping up the audience, and being rewarded with the first pitch of the game. The dissonance between the crowd's reaction and the grim reality of what was happening was jarring. I understand the concerns about public safety, especially in crowded places like apartment complexes and baseball stadiums. The presence of a bee swarm can indeed be alarming and poses a genuine risk to people, particularly to those with allergies. It's reasonable for management and event organizers to prioritize human safety and take swift action. However, the methods employed and the urgency to resort to extermination, rather than exploring safer, more humane alternatives for relocating the bees, is a part of the conversation that seems distressingly overlooked. It's shocking how these events are spun into stories of heroism. The narrative often shared is one of rescue and relocation when the reality is extermination. Despite widespread claims and reassurances that the bees are being safely moved to new locations, the truth is far grimmer, as confirmed by firsthand accounts and clear evidence from pest control practices. This consistent misrepresentation makes it feel like I'm in the minority for caring about these bees, which is both isolating and frustrating. I'm not looking to rally people to a cause right here; I just want to express how upsetting it is to see such disregard for life and truth. It feels like these bees, crucial to our ecosystem, are just seen as nuisances or even entertainment. This is about more than just bees; it's about our relationship with nature and our willingness to overlook the destruction of vital parts of our environment. Does anyone else feel this way, or am I just shouting into the void here?    "], ["Struggling with Tall Lefties in Batting", "11", "8", "2024-01-23T17:21:02.654000+0000", "https://www.reddit.com/r/MLBTheShow/comments/19dtibu/struggling_with_tall_lefties_in_batting/", "Hello everyone, I've been experiencing a curious issue in my baseball gaming performance, particularly with tall left-handed batters. For example, I had a solid .330 average with Juan Soto, but it's sadly dropped to .270. Poor Ohtani is hitting like an actual pitcher at .170. On the other hand, I'm doing quite well with other players like Jordan Walker, boasting a .345 average in over 200 at-bats. The challenge seems to be specific to tall left-handed hitters. From a right-handed perspective, which I'm more accustomed to, their stance on the plate appears quite different. This shift in perspective seems to throw off my game. I'm reaching out to this knowledgeable community for any tips or insights on how to adapt my strategy or approach. How do you adjust your batting technique for different types of players? Any advice would be greatly appreciated! Thank you all in advance for your help and support!    "], ["Am I autistic? Struggling with eye contact, avoiding conversation, not knowing what to say. Where do I get tested?", "23", "20", "2024-06-21T21:53:56.714000+0000", "https://www.reddit.com/r/mentalhealth/comments/1dlfr0b/am_i_autistic_struggling_with_eye_contact/", "Hi all. I've always just been a different kid. I've always struggled with communication. For example, if any of you guys have played baseball before, you may have done a drill where you yell each others name while playing catch, for some I just never could. I just couldn't yell the other persons name. At work, somebody will try to talk to me and I'll respond with the most awkward thing ever. Someone asks me how I'm doing, and for the longest time I couldn't even answer. The words wouldn't come out. I grew out of that, and learned to say \"I'm good, how are you\" but then the conversation ends there. Like what do I say next? Well I know what to say, but I just can't say it. The words don't come out. I struggle with eye contact big time. Especially when I don't know someone super well. Even if they're super important and the person who decides if I get a promotion or not, I can't keep eye contact. It comes off so disrespectful and I hate it. I'm not sure if this applies, but when going to someone's house who has pets, I tend to spend a lot of time with the pets to avoid eye contact and conversation. If I have autism where can I go to get tested? Just my family doctor? Edit: I know WHAT to say. I just can't say it. Lots of times I say something and it is disrespectful or inappropriate and I don't even realize it    "], ["6u assistant coach struggling with drills", "9", "4", "2024-04-20T01:47:56.782000+0000", "https://www.reddit.com/r/Softball/comments/1c8e5e5/6u_assistant_coach_struggling_with_drills/", "This is my third year involved, first year in softball, but I have several pre-k girl on my daughters team. We have three girls at the 6u level and play really well, but the rest of the squad struggle to be involved. I know, at this age, it's better to get them involved and having fun, but our girls struggle with knowing what to do while fielding. What are some drills we can practice to help them with knowing what to do when the ball comes their way situationally? We also have one girl who is possibly on the spectrum. She wanders around the outfield and it's challenging to get her engaged. I want to make sure she's included and feels apart of the team, but it's a challenge to keep her still and engaged. Any advice is needed. I want this season to be fun for them and make this a great season. For context, our in-field is all dirt so a lot of them want to play with it. Our head coach and other assistant look up to me since I have more experience in baseball coaching. Edit: more context. When we are fielding, our girls will get the ball, but look around and not know what to do. So any fun situational games or drills we can do would be awesome. Also, willing to take any chants or cheers our girls can do in the dugouts would be awesome too. My daughter and her friend and both cheerleaders, so they can lead the chants/cheers easily    "], ["Baseball help needed", "3", "16", "2024-06-10T03:24:57.402000+0000", "https://www.reddit.com/r/wildcats/comments/1dcbzlk/baseball_help_needed/", "Where can I find the UK baseball cap with the UK in the Red White Blue. Watching the game and I want one. Go Cats!    "], ["HELP needed with Backhand: Baseball swing", "25", "1", "2023-11-29T21:23:47.523000+0000", "https://www.reddit.com/r/10s/comments/1870hfi/help_needed_with_backhand_baseball_swing/", "Hello community, I am currently extremely frustrated with my backhand and I feel like it is really dragging me down. I am quite satisfied with my forehand and I feel that I can lead the points and take an aggressive stance most of the time. However, whenever I play against someone with a similar level as me (except the backhand, of course), my backhand quickly becomes my obvious weak point. I can't really play long baseline rallies switching back and forth from forehand to backhand because I lack the consistency with my backhand. I have zero confidence with it and the ball could either go straight to the fence or directly to the net. I have the feeling I could play 50 straight forehands without an unforced error and a proper itnensity, but get me to play 3-4 backhands in a row and I am done. Attached you will find three videos after I recorded myself to see my weak points. The outdoors video is the first one and includes a slow motion version. The last video is after I became more self-aware on things to improve, not sure if I succeeded. Basically, I do not know how to modify my baseball swing (unfortunately, I am not Jim Courier). The baseball swing-style is really obvious if you check the second video at around the 20-seconds mark . After watching the videos, I see the following issues/improvement points:   Slightly adjust my grip so that I have an easter forehand on my non-dominant hand (right-hand)   Perform a better shoulder turn, so that I have a \"longer\" preparation   Relax my wrists and lower my racket before contact point.   Ensure my non-dominant hand is leading the swing   Do you see it in a similar way? If so, do you have any tips on how to translate theory into practice ? I am in my late twenties, I am beyond the point of completely changing my technique, but some small improvements here and there would really help me have much more fun on the court. Any feedback will be highly appreciated! Thank you very much! PS: sorry for filming vertically on the last one, and also for the blurring , I'd rather stay annonymous on the internet :) hopefully you understand                                                       "], ["Baseball Savant Home/Away Video Help Needed ", "0", "4", "2024-04-29T16:32:30.547000+0000", "https://www.reddit.com/r/baseball/comments/1cg3juv/baseball_savant_homeaway_video_help_needed/", "So when I watch different clips on savant, the option to watch the home or away broadcast only allows me to watch the home broadcast. When I try to click on away broadcast, it does nothing and just highlights it. Furthermore, the \"HR: 30/30\" link that will show which ballparks the hit is a homer, is not working either. So, I am assuming it has something to do with my computer processing the links? This has only been a problem for the last few days. I am using a iMac if that has anything to do with it. Is there an easy fix that I'm just missing? Thank you for all help in advance!    "], ["Help Needed Looking at Baseball Cards :)", "1", "2", "2023-08-07T22:36:54.638000+0000", "https://www.reddit.com/r/baseballcards/comments/15kzhto/help_needed_looking_at_baseball_cards/", "hi everyone:) was looking through old stuff from my garage and found a pencil box full of baseball cards in good condition. i was wondering if there was any particular features to look for or possibly someone to help me look at them once they're sorted. im a girl trying to get through college so if any of these could get me a bit of extra money i wouldn't mind lol. there's a lot from the 80s and some ranging a bit before and after, i saw some all star sets too but honestly i am not at all educated in any sorts about baseball. there's easily a hundred or more cards i need to look at and reference values for. i do have some sleeves though just in case some are worth keeping safe, i already protected some that *looked* a bit special but again, i am clueless and any advice would be appreciated! :)    "], ["Help needed for sim for my son.", "14", "2", "2024-05-25T05:43:18.484000+0000", "https://www.reddit.com/r/Golfsimulator/comments/1d052qk/help_needed_for_sim_for_my_son/", "I'm new to this so bear with me. I've always enjoyed playing any sport but I really enjoy golf. My son was a very good baseball player but unfortunately he tore his ACL and couldn't play baseball this spring so his doctor allowed him to play golf. He's hooked and I'm enjoying the quality time on the course. I bought him clubs in February and he finished his high school tournament in the top spot on his team as an 8th grader. He wants to practice all the time so I've been trying to figure out how to put together a budget simulator. Like I said I'm new to all this and it feels like I'm over my head. What is a good budget setup consist of. Any advice is appreciated. Thanks    "], ["Shopping Help Needed!", "28", "5", "2024-06-06T12:25:05.445000+0000", "https://www.reddit.com/r/transfashionadvice/comments/1d9gx2f/shopping_help_needed/", "I'm seeking some advice on finding the right clothing sizes, especially with my specific needs. Current Sizes: â\u0080¢\tShoe: Men's 13 EEEE / 14 EE\nâ\u0080¢\tSocks: Men's 6-12\nâ\u0080¢\tPants: Men's XL-2XL or 40/29 - 42/32, though I wear them low to avoid pulling them over my belly\nâ\u0080¢\tUnderwear: Men's XL\nâ\u0080¢\tTops: Men's 2X, 2XB, 2XTall, 3X\nâ\u0080¢\tHats: Men's baseball hats adjusted as big as the strap goes I'm autistic with sensory processing disorder, and clothing has always been a major challenge for me. Current Women's Clothing: â\u0080¢\tTarget Women's Hoodie (2X): Much too short for my torso\nâ\u0080¢\tOld Navy Women's T-Shirts (2X): A bit small all around\nâ\u0080¢\tOld Navy Women's Joggers (2X): Too short About Me: â\u0080¢\tBody Shape: Apple-shaped with a muscular chest and neck, broad shoulders\nâ\u0080¢\tHeight: 5'11â\u0080\u009d\nâ\u0080¢\tWeight: Around 280 pounds\nâ\u0080¢\tProportions: Shorter legs, longer torso, and long arms (men's long sleeves are usually too short) Given these challenges, I'm looking for recommendations on brands, styles, and sizes that might fit better. I'm particularly interested in tops, hoodies, pants, and joggers that offer more length and room, as well as any tips on finding comfortable and sensory-friendly clothing. I love athleisure and someday hope to have some womenswear from to replace my old worn out masculine track suits. Any advice or insights from those with similar experiences would be greatly appreciated. Thank you!    "], ["New fan need help choosing a team out of a baseball market", "225", "56", "2024-01-01T14:31:21.814000+0000", "https://www.reddit.com/r/baseball/comments/18vxuyg/new_fan_need_help_choosing_a_team_out_of_a/", "Hey all! Long time baseball fan but never grew up with a household team, just sort of watched who was on (usually the Cubs, Cardinals and Braves). I have been watching baseball more as an adult the past season and plan on getting an MLBtv sub and really going hard this season. I want a team to follow and want recommendations. I have a few in mind, but want real fans opinions I live in TN. Braves and Reds are blacked out. I have a family member on my wife's side who is a huge Reds fan so that's a plus to talk to someone about it, otherwise no one I really interact with or friends with care about baseball. Stadiums I have been to:   Miller park- lived in Milwaukee for 3 years growing up, didn't love my time there in Wisconsin cause I was a southern kid, though I think I would as an adult   Busch Stadium when I was like 5 but hardly remember it.   Wrigley when I was a baby.   Grew up in a household with parents who had teams but honestly didn't care, mom was a mild orioles fan and dad liked the Cardinals and the Cubs (?) probably due to Sosa vs McGwire and the stadiums he had been too. Minor league teams near me within reasonable driving distance: AAA Milwaukee AAA Reds AAA Cardinals AA Cubs AA Angels Major League Teams within driving distance (5 hrs approx.) Cardinals Reds Braves I want a team I won't suffer forever with but also not a bandwagon. Most importantly I want to be able to watch them and follow them but also not deal with awful fans. Considering: Cardinals (uniforms, Busch stadium experience and history but the whole best fans in baseball is a turn off) Reds (love the uniforms and GABP and history) Brewers (one of a few childhood teams) Cubs ( sick uniforms, frat boy fans though eww) Mets (little brother syndrome) Guardians (love their jerseys and organization sounds great) White Sox (little brother syndrome, FJR, sick uni) I listed some pre-conceived notions to see if they are actually true. Thanks in advance! Happy new year! 87 days til regular season baseball!    "], ["Need help choosing a baseball team", "30", "4", "2024-04-08T12:02:55.328000+0000", "https://www.reddit.com/r/NPB/comments/1byw4ea/need_help_choosing_a_baseball_team/", "So I want to start watching baseball and want to choose a team, just something to get me started and maybe i'll find a new team when i've gotten to know the sport. So here's what i like about sports teams: an underdog, i dont like a team that a favorites and win every game. I prefer a mid table team that fight for wins (something like Maclaren, if you know F1) maybe they have fast players, like they are known for stealing bases or trick plays, something that could make the game a bit more interesting. They take gambles to try and win kind of thing. They have \"old stars\", they have on there team players close to retirement, that used to be one of the greats but now the have been transfered and are con they way out, they dont always play but still make magic every now and then. I'm not sure my post makes sense or there are any baseball teams like that but i would love to chat about the teams and get to know them anyway :) Thank you for reading <3    "], ["Need help with a baseball technique", "7", "4", "2024-04-19T18:48:29.354000+0000", "https://www.reddit.com/r/CTsandbox/comments/1c84mc1/need_help_with_a_baseball_technique/", "I have a jjk oc that plays baseball so like I need help making a technique Grade 1 or special grade if you want :)    "], ["Need help coding 2d baseball game", "0", "0", "2024-06-02T01:38:17.649000+0000", "https://www.reddit.com/r/godot/comments/1d62b5m/need_help_coding_2d_baseball_game/", "This is my first time coding/game developing and I'm working on a 2d baseball game. Currently I have a 2d.ball sprite with the following code attached to it: extends Sprite2D var crosshair: Sprite2D var initial_position: Vector2  # Declare the variable at the top var current_pitch: int = 0  # Variable to store the current pitch type (0: None, 1: Fast Ball, 2: Curve Ball) var initial_scale: Vector2  # Variable to store the initial scale func _ready(): # Ensure you get the reference to the Crosshair node\n\ncrosshair = get\\_parent().get\\_node(\"Crosshair\")\n\ninitial\\_position = position  # Set the initial position\n\ninitial\\_scale = scale  # Store the initial scale func _input(event): if event is InputEventKey and event.pressed:\n\n\tif event.keycode == KEY\\_1:\n\n\t\tcurrent\\_pitch = 1  # Fast Ball\n\n\telif event.keycode == KEY\\_2:\n\n\t\tcurrent\\_pitch = 2  # Curve Ball\n\n\telif event.keycode == KEY\\_3:\n\n\t\tcurrent\\_pitch = 3  # Splitter Ball\n\n\telif event.keycode == KEY\\_ENTER:\n\n\t\tif current\\_pitch == 1: throw_fast_ball() elif current\\_pitch == 2: throw_curve_ball() elif current\\_pitch == 3: throw_splitter_ball() func throw_fast_ball(): var tween = create\\_tween().set\\_parallel(true)\n\ntween.tween\\_property(self, \"position\", crosshair.position, .6)\n\ntween.tween\\_property(self, \"rotation\\_degrees\", 30, .6)\n\ntween.tween\\_property(self, \"scale\", Vector2(.8, .8), .6)\n\ntween.finished.connect(\\_on\\_tween\\_completed)  # Connect the finished signal func throw_curve_ball(): var tween = create\\_tween().set\\_parallel(true)\n\ntween.tween\\_property(self, \"position\", crosshair.position, 1).set\\_trans(Tween.TRANS\\_BACK)\n\ntween.tween\\_property(self, \"rotation\\_degrees\", 150, 1)\n\ntween.tween\\_property(self, \"scale\", Vector2(.8, .8), 1)\n\ntween.finished.connect(\\_on\\_tween\\_completed)  # Connect the finished signal func throw_splitter_ball(): var tween = create\\_tween().set\\_parallel(true)\n\ntween.tween\\_property(self, \"position\", crosshair.position, 1.0).set\\_trans(Tween.TRANS\\_QUART)\n\ntween.tween\\_property(self, \"rotation\\_degrees\", 150, 1)\n\ntween.tween\\_property(self, \"scale\", Vector2(.8, .8), 1)\n\ntween.finished.connect(\\_on\\_tween\\_completed)  # Connect the finished signal func _on_tween_completed(): position = initial\\_position  # Reset the position\n\ncurrent\\_pitch = 0  # Reset the current pitch\n\nscale = initial\\_scale  # Reset the scale this allows me to select pitches and control where they go. I have a sprite2d that replaces the cursor with an octagon using the following code: extends Sprite2D func _ready(): # Hide the default mouse cursor\n\nInput.set\\_mouse\\_mode(Input.MOUSE\\_MODE\\_HIDDEN)\n\n# func _process(delta): # Update the position of HitCursor to follow the mouse\n\nglobal\\_position = get\\_viewport().get\\_mouse\\_position() What I am having issues with is that I want the ball to be sent off screen with a tween animation if it is clicked on by the cursor. But specifically I want the direction it goes off screen to be determined based on which side of the octagon it hits. I also need it to go straight up if it hits in the center of the octagon sprite. I am unsure of how to do this at all. I guess I need some sort of detection based on pixels ?? I essentially what it to be whichever side of the octagon has the most pixels on the baseball when clicked then sent that direciton? Can anyone assist please?    "], ["I need help choosing a baseball team. ", "1", "1", "2024-05-29T04:44:20.424000+0000", "https://www.reddit.com/r/mlb/comments/1d33zi7/i_need_help_choosing_a_baseball_team/", "For the life of me I can't decide I'll go threw periods where I'm convinced it's one but then I'll see the other and I'll have doubts vice versa. It's between the Chicago Cubs and the Boston Red Sox. I'm not geographically tied to either since I'm from Australia. For the other sports I go for the Blackhawks the Bears and the Celtics. Celtics being the highest on the hierarchy as Basketball is my favourite sport out of hockey and football although I love all sports. Reasons I like the cubs is because of their pinstripes and the mix of modern and classic in their uniforms I don't think they have a bad uni all look super clean plus I have a few friends in Chicago if I was ever going to move to the US Chicago is where I'd go. Red Sox I was born October the 27th 2004 the day they broke the curse of bambino and won the World Series. I love their hats the B looks so clean and while I much prefer the cubs jerseys I much prefer Bostons hats by a mile. Im really big into fashion so that's playing a factor two whatever team I could pull off more outfits with would be cool. I guess the biggest factor would be the passion and sizes of crowds noise I really want to follow the louder and more passionate team aswell because passionate fanbases mean everything to me. If I were Red Sox I'd have a even split of Chicago and Boston sports. If I were to choose the Cubs I'd basically be a Chicago sports fan minus the Celtics. I think that's a lot more easier to explain to people and makes more sense. In terms of what I've seen on videos the vibes at both Fenway and Wrigley are awesome. I'd be happy to become a fan of either and what ever one I choose I'll have a soft spot for the other.    "], ["I watched a baseball yt short and now I'm hooked & need help learning ", "28", "29", "2024-05-06T03:00:48.708000+0000", "https://www.reddit.com/r/mlb/comments/1cl8wfz/i_watched_a_baseball_yt_short_and_now_im_hooked/", "Watched a baseball yt short, now I'm hooked As my title says 2 days ago I watched a yt short of double plays (no idea what that meant), tonight I've watched moneyball (cliche I know but I enjoyed it when it came out too) & just watched 6 or 7 condensed games. Im sport crazy, you name it I watch it except baseball, I once declared it the world's worst sport (I'm British to us it's boring american cricket lol) I was wrong by a long way. Now I want to learn more & hopefully pick up a team so I have a reason to care beyond fascination, I want passion. I don't want to make this post too long so if anyone wants to guide me through it, answer my questions and become friends please do message me, I'd really appreciate it.    "], ["Need help finding this baseball comedy sketch", "5", "0", "2024-04-04T22:09:04.712000+0000", "https://www.reddit.com/r/baseball/comments/1bw0kkr/need_help_finding_this_baseball_comedy_sketch/", "Trying to find a recording of a comedy bit where two baseball announcers are calling the first game of the season, and everything, EVERYTHING, is sponsored (\"And the batter steps into the batter's box, brought to you by Bob's Boxcutters\" or something). Not a real game but pretty funny. Anyone know who did this or might have a link?    "], ["I need help 11.9.6 Baseball diagram ", "1", "1", "2024-04-18T00:57:30.441000+0000", "https://www.reddit.com/r/CodingHelp/comments/1c6qiek/i_need_help_1196_baseball_diagram/", "Help I can't code this Tracy Turtle program    "], ["NEED HELP HOSTING MY FIRST BREAK OF BASEBALL", "2", "0", "2024-03-15T04:10:20.243000+0000", "https://www.reddit.com/r/baseballcards/comments/1bf59f3/need_help_hosting_my_first_break_of_baseball/", "I have 12 Topps chrome hobby 2021 and 6 Topps chrome hobby 2023  and I'm doing a random team break. Any suggestions on a price per spot?    "], ["Hey guys, i need help solving a question about the First Book that is bugging me, after the baseball game.", "32", "33", "2024-05-18T19:51:22.635000+0000", "https://www.reddit.com/r/twilight/comments/1cv5ngw/hey_guys_i_need_help_solving_a_question_about_the/", "Ok, so the Baseball game happens, the nomads listen to the bat hitting the ball because of the climate change, the thunder didnt appear at the right moment, then they come to see what is going on with curiosity, and also smell the cullens from far away and maybe Bellas scent as well. They begin their encounter with the cullens smoothly, Laurent as their representative talking with Carlisle, Carlisle admits having a permanent residence nearby and Laurent gets impressed and also interested about their life style, Carlisle then suggests they come to their house later and see for themselves what they have created in Forks, but then the wind comes and reveals to James Bella is a Human, they all then have a faceoff, afterwards everybody leaves. Now here comes the interesting part, Laurent and Carlisle even after their quarrel still agree that the nomads go see the house, so   Bella, Edward, Emmet and Alice go to the Jeep take Bella away.   Jasper, Esme, Rosalie and Carlisle are to take the nomads with them to the house.   Now, its confirmed Laurent got to the house and probably had a chat with the cullens inside, afterwards he abandoned his coven and went for the Denali. BUT what about James and Victoria? why didnt they follow Carlisle? did they just ran into the forest abandoning Carlisles lead after following him for a while? that part was not clear for me in the books, because the nomads actually leave the field together and Carlisle then leads them to the house, but its never explained how the two nomadic vampires left and Laurent stayed, did they give any reasons for leaving?   Like for example, James said: Look, your house is probably pretty interesting, but im feeling hungry right now, so I hope you dont mind, nice meeting you though! sorry about provoking your boy earlier, sometimes my instinct gets the better of me.   Or Victoria : Im going with James, he will probably need my help, but nice meeting you guys, looking forward to another time!   Like, isnt that weird that they didnt explained in the book? maybe they explained in midnight sun but i didnt read that one. Also, Laurent is supposed to be submissive to James, how is that he can make his own choice to go with Carlisle? What you guys think ??    "], ["Seeking help for a friend who wants to pursue his career in Baseball...", "4", "12", "2024-05-14T08:58:00.683000+0000", "https://www.reddit.com/r/indiansports/comments/1crnj6h/seeking_help_for_a_friend_who_wants_to_pursue_his/", "Hey Y'all... I'm writing this post to seek help for a friend of mine who wants to pursue his career in career in baseball he doesn't have any idea (neither með\u009f¤·ð\u009f\u008f¿â\u0080\u008dâ\u0099\u0082ï¸\u008f)where to go, what to do and all that. Hes from Bihar and has recently wrapped up his tenth  board exams and is eager and worried at the same time..like what is he gonna do now... What I'm basically asking is...as there any schools(or whatever) in India(or neighbour countries) which promote Baseball? Please consider DMing me (or asking me to DM you)for more specific details... Any help would be greatly appreciated..ð\u009f\u0099\u008fð\u009f\u008f¿    "], ["Help for an OG collector trying to get back into baseball cards", "6", "0", "2024-02-09T02:21:50.638000+0000", "https://www.reddit.com/r/baseballcards/comments/1amd8jt/help_for_an_og_collector_trying_to_get_back_into/", "This is my first post, hoping this hasn't been asked alot. I was really big into collecting in the 80s/90s and am looking to get back into it. That being said I don't even know what brands to target. I'm looking to find rare inserts and limited run/high value cards. Any advice on where to start? Thanks for your help!    "], ["Need glove help for a non player", "12", "2", "2024-05-02T16:08:46.184000+0000", "https://www.reddit.com/r/Homeplate/comments/1cijjlo/need_glove_help_for_a_non_player/", "My son is almost 10 (tall for his age with big/long hands).  He gave up baseball this year. It was never really his thing, he just enjoyed going out with his friends until kid pitch started. The glove he's been using is too small now and he needs a new glove for â\u0080\u009clife.â\u0080\u009d Just to play occasional catch with his sister or participate in a pickup game with his friends. So it's not going to get a whole lot of break in time. Also, he's a lefty (left hand throw). Neither my husband or I are baseball people so we're totally lost. Any suggestions? Anything out there used on eBay right now that would fit the bill?    "], ["I need help for fantasy draft.", "18", "0", "2024-01-19T15:30:49.901000+0000", "https://www.reddit.com/r/fantasybaseball/comments/19aloqc/i_need_help_for_fantasy_draft/", "Hello, I am doing an mlb fantasy league with my friends and I need some draft picks for a good team. I know absolutely nothing about baseball and who is good or bad. The only reason I'm in this league is so there is enough people for my friends to do this. There are no punishments they said so I thought it would be funny if the only person with no baseball knowledge ended up doing pretty good in the draft and tables. This is my first ever fantasy tram for all sports so I ha e no clue what I'm doing. We have our league on espn fantasy or smtn like that. Anybody have good draft picks to help me out?    "], ["Help for a beginner!", "1", "1", "2024-06-21T13:00:23.392000+0000", "https://www.reddit.com/r/tradingcardcommunity/comments/1dl3fyt/help_for_a_beginner/", "Hey all, straight forward ask -- I recently grabbed all of my childhood baseball cards and am trying to understand an efficient way to go through them to determine their value. Any thoughts? Thanks!    "], ["Help for my 85 y.o. dad, a retired CE", "53", "29", "2024-03-01T19:49:18.161000+0000", "https://www.reddit.com/r/civilengineering/comments/1b43kts/help_for_my_85_yo_dad_a_retired_ce/", "Here's a weird request: my dad was a professional CE for like 55 years, worked for several firms, retired and did small consulting gigs for years. His eyesight began to fail (he's legally blind now), he's developed either early dementia or cognitive memory problems over the last 3 years, his wife (my step-mom) recently died. he lives out of state, has moved into assisted living, we're selling his home, he's depressed, in shock some.  But, he's bored AF.  He used to work in the yard, build decks, fix shit. He doesn't wanna play bingo, trivia, or balloon baseball. He lives in a small-ish city in TN where he has his church and friends. But most days, he sits in his room. Any suggestions as to something a guy like him should do? His nurse suggested Legos, which sounds appealing, maybe. Or one of those electric kits where you can make stuff by connecting wires. W/ his eyes, things are tough, like he can only read using big magnifiers.    "], ["hello i need help for understand the game", "7", "0", "2024-01-24T03:22:40.449000+0000", "https://www.reddit.com/r/footballstrategy/comments/19e7cuf/hello_i_need_help_for_understand_the_game/", "for example i know about the attacking team can made points when they scord a touchdown or with a free shot. But i need to understand the tecnical game for example i run 10 miles and later i started again i mean what is the purpose of that. the game has 4 times? that's exatly my point.  in the baseball i think i have the same type of question. I knew that when you do a homerun you win point but i did not knowyou can run the bases and if you run of the diamond 4 bases you can win 1 point. The baseball not is the point but the type of the question it is.    "], ["Need help for a middle name for Cole Calloway", "5", "1", "2024-05-05T14:57:54.844000+0000", "https://www.reddit.com/r/namenerds/comments/1ckt4io/need_help_for_a_middle_name_for_cole_calloway/", "I had wanted something more unique, like maybe something that wasn't traditionally used as a name (like Apollo or Wolf) She liked the name Tucker but decided against it since Cole Tucker is the name of a baseball player / Vanessa Hudgens' husband, so we're back to the drawing board. Would love some suggestions!    "], ["Desperately need help for my son playing 9u travel ball kid pitch for the 1st time... Any help and advice through observation would be appreciated...", "28", "0", "2023-11-12T01:32:43.667000+0000", "https://www.reddit.com/r/Homeplate/comments/17t9gnz/desperately_need_help_for_my_son_playing_9u/", "https://www.reddit.com/r/baseball/s/9a9qSsVjkj     "], ["Other youth sports that help with baseball", "57", "12", "2023-10-13T01:23:39.629000+0000", "https://www.reddit.com/r/Homeplate/comments/176n1u9/other_youth_sports_that_help_with_baseball/", "What sports do you think help the most with becoming a better baseball athlete? I have heard tennis, racquetball, pickleball, wrestling and basketball help a lot. Any other fun sports that would translate well to the diamond? TIA    "], ["Help with a baseball-game chant", "32", "7", "2023-11-27T05:39:07.490000+0000", "https://www.reddit.com/r/baseball/comments/184voor/help_with_a_baseballgame_chant/", "Hi r/baseball . I'm an English teacher in Taiwan, and my students here want to know some common fan cheers and chants in English. I am not a baseball guy, so I don't know any. Anyone have any good baseball chants/ cheers that students could use to cheer their team on at a sports day ceremony?    "], ["Help with baseball ticket.", "5", "1", "2024-04-12T04:59:58.548000+0000", "https://www.reddit.com/r/OsakaTravel/comments/1c20pvt/help_with_baseball_ticket/", "I bought a baseball ticket for the Orix Buffalo game at Kyocera Stadium tonight through StubHub. I took a screen shot of it and there is a barcode.  Can I just show up at the stadium with this on my phone and use rhe barcode?  In North America, this would be the process. But I had others online tell me I need to print it at a convenience store. Tried that at Lawsons and failed. Staff told me it doesn't work. Please put my mind at ease, do I just show up at the game with that screen shot?    "], ["Help with baseball late games", "0", "1", "2024-04-14T01:18:32.488000+0000", "https://www.reddit.com/r/sportsbetting/comments/1c3hlht/help_with_baseball_late_games/", "Anyone have ideas on the late games for baseball? Every pick I make is wrong.    "], ["Need some help with the website baseball almanac", "5", "1", "2024-04-08T05:25:05.243000+0000", "https://www.reddit.com/r/baseball/comments/1bypxqx/need_some_help_with_the_website_baseball_almanac/", "If anyone is familiar with the website baseball almanac plz help me with this. So I search on google players that retired in different years for example, players who retired in 2022 it takes me to the website, I try to search the players that retired each years on the main page and  I don't know where to go. I click on every page and I just can find it and I know its there cause how else would I search it up on google, and I know I can just search it up on google and call it a day but I want to know where it is on the page. If anyone can help me out I would gladly appreciate. Ps if you have trouble understanding I'll try to explain it better.    "], ["Baseball Historians -- I need your help with some pitchers!", "23", "5", "2024-01-09T23:44:48.815000+0000", "https://www.reddit.com/r/mlb/comments/192tkas/baseball_historians_i_need_your_help_with_some/", "PLEASE READ THE ENTIRE POST HERE BEFORE YOU COMMENT!   I'm not asking about players who played in the 1980's to present right now!  I'm sure there's a number of you in here who can help. Part of my baseball card collection is knuckleballers. But what I want is actual knuckleballers. Players who throw/threw the knuckleball as their primary pitch. Not \"player who has a knuckleball in his repertoire\" (i.e. I don't consider Matt Waldron a \"knuckleballer\"). I have several already. The problem I'm running into are the prewar and some vintage. For instance, Wikipedia has Johnny Niggeling listed as a Knuckleballer. But was he an actual knuckleballer, or a \"guy who had a knuckleball in his repertoire\"? I don't want to buy cards of guys who I think are knuckleballers. ETA: What I'm talking about is \"early\" 20th century knuckleballers going up to about the 1950's or so. Like I have a Dutch Leonard, Hoyt Wilhelm, Phil/Joe Niekro, and Wilbur Wood. What I'm asking about is guys like Jesse Haines, Eddie Rommel, Ted Lyons, etc. Because as far as I can tell, not everyone on this list:  https://en.wikipedia.org/wiki/List_of_knuckleball_pitchers  Is a knuckleballer. Some of them were a \"guy who had a knuckleball in his repertoire\", which isn't what I'm looking for. Any insight is greatly appreciated.    "], ["Help with recording baseball games using DirecTV stream", "8", "3", "2024-03-20T14:24:28.675000+0000", "https://www.reddit.com/r/DirectvStream/comments/1bjeolm/help_with_recording_baseball_games_using_directv/", "I've got my DirecTV streaming service set to to record all Dodger baseball games and normally it works very well. Except this morning, of course, when it recorded ESPN instead of SportsnetLA. So I have a recording of a screen that says \"This broadcast is not available in your area.\" Anyone know how to make it pick a specific channel without undoing the \"Record all Dodger games\" option?  I'm guessing it will do this every time the game is on a national broadcast channel, which is often blacked out for me. Thanks!    "], ["Help with importing from baseball reference.", "3", "1", "2023-08-15T19:32:17.029000+0000", "https://www.reddit.com/r/googlesheets/comments/15s2e1v/help_with_importing_from_baseball_reference/", "I've been trying to import the second table with the standard importhtml method at this link:  https://www.baseball-reference.com/leagues/majors/2023-standard-batting.shtml  I've looked around and seen some answers that state that I have to find an embed link for the htmlimport to work in this instance, but haven't had much luck getting it to work. Appreciate any help.    "], ["This sub is for people who want help with learning new things in baseball", "1", "1", "2024-04-05T04:55:00.592000+0000", "https://www.reddit.com/r/baseball_help/comments/1bw9lb7/this_sub_is_for_people_who_want_help_with/", "This means â\u0080¢pitching â\u0080¢batting â\u0080¢Base running â\u0080¢catching â\u0080¢fielding    "]]