[["The REAL problem with Miami Heat Basketball right now.", "55", "0", "2024-04-11T12:53:12.978000+0000", "https://www.reddit.com/r/heat/comments/1c1eay4/the_real_problem_with_miami_heat_basketball_right/", "Heat Nation, please hear me out. First off, this season is very much still in the works. I will never rule out these boys, as they always can have a sneaky playoff run in them. It's not even sneaky at this point, since it has happened so many times now. Each player on the Heat, and the team more broadly, have shown many streaks of greatness throughout this season. The Heat have an unbelievable culture holding the fabric of the organization together which drives progress each season. We have an awesome group players that ride for each other. Most importantly, we undoubtably have one of the greatest basketball coaches of ALL TIME at the helm. So what's going on here? It has become clear to me that the issue with the Miami Heat is systemic. While we have the best culture, we must reflect on the core strategic component of the culture that is no longer working: our stout defensive approach has become outdated in today's NBA.  The Miami Heat are known for having rugged defense, having the most well-conditioned players, and ensuring that the team as a whole plays all out on every, single, play. This defense-first approach truly disorients other teams, and we do our best to build out our offensive proficiency from there. Unfortunately for us, the NBA of this modern era has changed significantly over the last 10 years. There are many players and many teams now that have sacrificed defense to put up offensive numbers that were previously unimaginable. 3 pt shooting rates have skyrocketed and final scores are ridiculously high these days. It is safe to say, that at this point, it feels like the Heat are constantly working from behind in these games. We always hold it down defensively, but the best teams simply score more. And at the end of the day, the team that scores more, wins.  It feels like we are old. It feels like we are trying to compete with the new, innovative NBA style. But it's not actually an age thing for us. We have a well-balanced roster in that regard. It's more about the approach. We still embody the 90s style of play, which has truly brought us remarkable success for many years. But now, it seems to be a tipping point. We're not keeping up in the same way anymore. Being so defense-oriented, in SUCH an offensive-oriented league has put our team at a significant disadvantage. Yes, we lack size, but at the end of the day, we generally just don't score as easily as other teams. Additionally, because we are so defense oriented, we have to work even harder to win games, which tires our guys out. Then, shooting percentages decrease because guys are more gassed, even with great conditioning. Then, there are more injuries because guys are going all out, which further leads to offensive woes. Lastly, at the end of games, when our defense keeps things close, it is harder to close those games without the same offensive superpower. It's a cycle that just feels difficult. It seems like an ridiculous grind for players and coaches. More than it used to. It's not sustainable. Overall, I think we need to take a hard look in the mirror as an organization. We don't need to change everything. We will always be Heat Culture and defense wins championships. But at the end of the day, we need to swing back to the other side of the pendulum and pump our roster with more offensive fuel. The pendulum hopefully will swing back to a well-balanced offensive and defensive approach. Also, we can't blame this issue any individuals here, players, Spo, or the front office. Blaming individuals is nonsense and that needs to stop on this sub. This is a systemic issue, and everyone needs to come together and make a strategic adjustment together. I honor that we have taken this strategic approach as far as possible, and we literally got to the finals last season, somehow, off of sheer willpower. I do think adding Rozier was a really good step in the right direction. Herro is healthy again and he is always a great scoring threat. Jovic is starting to play more minutes and that has been exciting on both ends of the floor. Bam is expanding his shooting, and Duncan is seemingly working through a back issue, so I hope he's back in his early-mid season form soon. Playoff Jimmy is awakening and is always dangerous. We could still make a run, so never count this team out. I'm just grateful to watch this team, as there will always be highs and lows. Most basketball fans either don't have a team in their city, don't like the team ownership/front office of their team, or their team just has a losing culture. We are lucky to have such a good organization with a winning culture for so many years. Nothing like Heat basketball. I'll ride with our boys through it all.    "], ["A problem with NCAA basketball rules and shot clock standards", "18", "0", "2024-03-01T17:09:51.972000+0000", "https://www.reddit.com/r/CollegeBasketball/comments/1b3zjev/a_problem_with_ncaa_basketball_rules_and_shot/", "I am planning to notify NCAA officials of this problem. I would appreciate reviews and comments on this draft explanation: When the officials precisely follow the NCAA rules and approved rulings in certain venues, the 10-second backcourt violation becomes a defacto 9-second backcourt violation. But in other venues, this problem does not occur. The NCAA has not standardized the display truncation specification for the shot clock. Some clock displays (Type 1) reach 20 at 10 seconds after the clock is started, and other displays (Type 2) reach 20 at approximately 9.01 seconds after the clock is started. Approved Ruling 236 in the 2023-2024 Men's Basketball Case Book Â specifies that a 10-second backcourt violation has occurred when the shot clock display shows 20. This is the correct rule for Type 1 displays. For Type 2 displays, this is one second too early. Video evidence of this clock specification problem is easy to find. In this clip, we see a Type 1 clock in action:  https://www.youtube.com/watch?v=F2UhejNskDk&t=108s  The Type 1 shot clock display ticks down to 0 at the precise moment the clock expires (at around 1:50 in the clip).Â  So, of course, it ticks down toÂ  1 when one 1 second is left and it ticks down to 20 when 20 seconds are left. And, of course, the clock is stated at the 30-second point. Early in this next clip, we see the type 2 clock in action:  https://www.youtube.com/watch?v=nnJ1RuMl_c8  The Type 2 shot clock display ticks down to 4.9 when 4.9 (or, perhaps 4.99) seconds are left.Â  It ticks down to 5 approximately 1 second before that. I infer that the Type 2 clock implements the mathematical floor function such that it ticks to 5 at approximately 5.99 seconds.Â  So, the Type 1 clock display ticks down to 20 at approximately 20.99 seconds. And, of course, the clock is started at the 30-second point. Hence, the display ticks down to 20 approximately 9.01 seconds after it is started. As evidenced by the second clip, the Dean Dome is equipped with a type 2 shot clock.Â  With approximately 3.3 minutes left in the second half of the recent 2/26/24 Miami-UNC game. RJ Davis caught an inbounds pass.Â  After a couple of passes in the backcourt, Cadeau took possession in the backcourt.Â  Cadeau passed to Ingram in the front court. But before the ball was touched by Ingram, the shot clock display ticked down to 20 and the whistle was blown after only 9 seconds of possession in the backcourt.Â  UNC was charged with violating the 10-second backcourt rule when, in fact, 10 seconds had not elapsed.Â  The officials did everything correctly according to the rules. The clock was started when RJ Davis touched the ball and the display immediately ticked down to 29 indicating that the time on the clock was 29.99 seconds.Â  This was not an officiating error, this was due to the NCAA's failure to standardize their shot clocks or adjust their casebook rulings. One quick fix is to modify Approved Ruling 236 to specify that a shot clock display of 19 (instead of 20) indicates the violation in venues with Type 2 clocks.    "], ["I think the BIGGEST problem with the community is that our expectations of everyone is not realisticâ\u0080¦", "51", "28", "2024-06-19T14:48:05.997000+0000", "https://www.reddit.com/r/NBA2k/comments/1djl06x/i_think_the_biggest_problem_with_the_community_is/", "Let me preface this post with the fact that it is strictly directed at SOLO REC or any type of SOLO online play  The game would be TERRIFIC if everyone had the typical basketball IQ and wasn't selfish. But in all honesty, that will never happen. The problem is that the community expects it too. ESPECIALLY IN RANDOM REC. Everyone expects their teammates to be as smart as they are, never make mistakes, only take good shots, etc etc. Someone really smart once told me that the best way to avoid disappointment is to stop expecting shit. We constantly get disappointed by this game and let the game ruin our day over a couple bad teammates. I get the frustration of having your typical random that never passes, only throws up bad shots, and gets cooked on D. But what else do you expect? Everyone isn't as good as you are. Everyone isn't as smart as you are. Everyone isn't always gonna be playing team basketball. It sucks ASS, but that's the harsh reality of the game. On the rare occasion where you get teammates from God, cherish that moment. Because in a few games or so, you're gonna get teammates from hellð\u009f\u0098\u0082literally went on a 5 game streak with randoms before I had to leave, then the very next time I played, my next teammates were terrible and we got our asses DESTROYED. In short, just try to enjoy the small things about the game. When you constantly nitpick every little thing about the game, it's much harder to enjoy. You're gonna get trash teammates. So what? Roll with the punches and deal with it. The beautiful thing about random REC is that the chances that the other team is bad too is very highð\u009f\u0098\u0082    "], ["My problem with Muslims( I'm a muslim)", "123", "168", "2023-12-24T15:27:18.508000+0000", "https://www.reddit.com/r/IndianModerate/comments/18pxb9q/my_problem_with_muslims_im_a_muslim/", "Hijab : I daily go for a walk with my mother. It's a stadium where children can play all sports. I have literally a 5 year old girl playing basketball with hijab? And I wonder why the society hates us. My sister represented my district in state volley ball games and my father still doesn't ask her to wear hijab( She's  24 now).I even argue with my girlfriend not to wear burqa when coming to college but guess what? She never listens to me. Imo burqa should have been done away with right after independence. India Islam must have been different.  Ego : Muslims get offended over a thing faster than speed of light. My father literally lost his cool when muslims protested against CAA without knowing shit. I don't fast during Ramzan coz I can't stay long without eating. My Muslim friends proved how lame they are by shaming me for not fasting. And I wonder why the society hates us. Islam has nowhere mentioned that it's fine not to follow every line from holy texts.  Parenting : One of my cousin got too influenced and how he says he'll join his kids in a urdu medium muslim school( they are rich, can easily afford english medium). I literally argued him to the core that our both families no more talk. I never saw any extreme right wing kattar hindu willing to join his children in a hindi medium even if he can afford English medium. I have seen many people not bothering about their kids..\"whom are they hanging out with? What kind of places he visiting? How is he performing academically? \". Many just give birth and stop giving a shit. Recently a fellow sub member posted a video of a Muslim kid speaking against BJP. Why the fuck you want your kid to know about politics at very such age?  Politicians : I can't name one muslim politician who envisioned the progress of religion. Sab ke sab radical h. Did atleast one politicain mention that \" we are indians first , muslims next\"? Nope. Did any Muslim politician say\" we must fight hindus, but in being progressive\". Nope. These assholes never spoke about triple talaq and the credit went to bjp. No reforms about inheritance to women. Average muslim L. What can normal muslims like me do when the Politicians aren't willing to change anything.    "], ["The Problem with Keyshawn ", "21", "16", "2024-05-13T19:34:36.514000+0000", "https://www.reddit.com/r/UndisputedFS1/comments/1cr86mm/the_problem_with_keyshawn/", "When he sounds salty towards the Nuggets it's bad TV and not how an analyst should conduct themselves. Problem is Keyshawn is thinking as a Lakers fan. Of course a fan would be salty and want Denver to lose. But that shouldn't spill into your job as an objective analyst. A lot of Key's \"analysis\" and discussions comes from feelings and rarely does he offer objective narratives.  It's bad in football but terrible in basketball since he doesn't know ball. So when he's there saying \"I wanted Denver to get swept\" it's kind of jarring. Instead of pretending and at least giving reasons why you think the Wolves should win, which is how how Skip would make his arguments even if we all see through them, just outright saying you hope a team loses is not what an analyst should say on air.    "], ["The Problem with Mat Ishbia", "30", "0", "2024-03-26T19:43:06.102000+0000", "https://www.reddit.com/r/suns/comments/1boh0bq/the_problem_with_mat_ishbia/", "The problem is that he throws money at all the teams problems. This is going to be a good thing to have in the years to come but in the short term it has led to roster problems and more than likely different philosophies in coaching. What Frank Vogel is good with he does not have here. They made Kevin young the highest paid assistant coach and gave him no point guard to run the offense. Our defense does not have to be hunted for mismatches because there is always mismatch for whatever guard are in at the moment with slow footed centers behind them. This is a very very talented and mismatched roster. Here's to hoping he finds a balance and the right basketball people to tell him when he's wrong.    "], ["My problem with the team name \"Yeti\" ", "24", "1", "2024-06-03T22:35:33.185000+0000", "https://www.reddit.com/r/Utah_Hockey/comments/1d7hocu/my_problem_with_the_team_name_yeti/", "Its not that other teams like avalanche had a yeti mascot, or that it isn't utahn; to me it seems, unoriginal, plain, boring. When someone tells me to think of any wintery name for a winter sport Yeti is high on that list for its likeness to winter, it is the safe option. It lacks originality and is plain and simple, its the saf option. Whereas your taking more risk with names like outlaws, swarm, black diamonds etc because more people would be opposed to those options    "], ["The problem with new strats.", "35", "0", "2024-05-26T16:06:38.901000+0000", "https://www.reddit.com/r/helldivers2/comments/1d14nsu/the_problem_with_new_strats/", "We have 3 armor classes for enemies; light, medium, and heavy. We also have 3 weapon classes to deal with the enemies respectfully being side arm, primary, and support. The issues with the new weapons / strats is that they don't do anything that we need them to do. The new mech takes 80+ headshots to a bile titan to kill it... 80! That's half of the ammo in the entire mech! The airburst rockets have similar effectiveness against heavies and its proximity sensors are still WAY to sensitive to be reliably useful against smaller enemies. The anti take mines when they were tested took WAY too many mines to kill heavies as well. I'm not saying you can't get creative and make these stratagems work, I'm saying there's no point in using these new additions to the game if we already have stratagems that do the job BETTER. Why bother dumping 80 shots into a titans face when you can kill it in just 2 rockets to the head? Why risk wiping your whole team with airbursts when you could kill smaller enemies better with just about any stratagem without the risk? Why take up a strat spot for anti tank mines when the regular / incendiary mines already do a good job at killing enemies as long as you bring a flame thrower or something to finish off the heavies that make it through the mine field in a few seconds? Why not make the mechs powerful? They're the last strat you unlock in the menu! Not to mention, later difficulties have enough titans that a whole team wouldn't be able to call in enough mechs to deal with them all. Why not reduce the sensor sensitivity on the airbursts to a few feet away instead of half a basketball course away? Why not have anti tank mines drop few but bigger mines that can't be set off by smaller enemies because they're not heavy enough? And instead of take 4-5 mines to kill a heavy, make it 1-2 mines to kill a heavy?    "], ["My problem with the TS% (True Shooting Percentage)", "25", "0", "2023-12-14T04:15:10.864000+0000", "https://www.reddit.com/r/nba/comments/18i05nm/my_problem_with_the_ts_true_shooting_percentage/", "The way that TS% is defined  TS% = PTS / [2*(FGA + 0.44 * FTA)] If player A made all of his 10 3s and made 5 perfect free throws for a total of 35 pts:  A's TS% = 35 / [2*(10 + 0.44 * 5)] = 143%  Now let's assume his opponent player B did the same + adding 5 more free throws and scored 40 pts:  B's TS% = 40 / [2*(10 + 0.44 * 10)] = 138%  As you can see, the TS stat punishes player B for making 5 extra free throws, even though he made all of them.    "], ["The problem with â\u0080\u009ccopy whatâ\u0080\u0099s already workingâ\u0080\u009d", "7", "23", "2024-06-15T22:17:43.181000+0000", "https://www.reddit.com/r/dropship/comments/1dgt31o/the_problem_with_copy_whats_already_working/", "If you've been following me here, you know I've been doing dropshipping for a long timeâ\u0080\u009411 years to be exact! I think I can confidently say I know all the secrets, tricks and pitfalls of the business. It's still crazy to me that a lot of so-called dropshipping experts promise you'll get rich in two weeks with hardly any effort. Let me tell you the truth: that's not how it works. I've made a lot of money with dropshipping, but I've also learned a lot from my mistakes. One bad piece of advice they give is to copy what other people are already doing. This is not a good idea at all. Usually, they tell you to look at what your competitors are selling and sell the same stuff. But think about it. If everybody copies what everyone else is selling, you will end up competing only based on product price (because it's your only differentiating factor) and your profit margins will gradually disappear - that's why the majority of product spy tools are, in my opinion, useless; I only recommend you use them for inspiration. So don't just sell what everyone else is selling. Instead, start by picking a niche (a specific topic or area). You can get a free guide with over 300 niches in the links section of r/PassionsToProfits . Next, get to know your niche well. Read that again. Get to know your niche REALLY well. Find every subreddit, forum, blog, FB Group, website or magazine you man and study it. Look at what product features they value, their product choices, what gear and accessories they buy and which are being advertised Look at which products they are already buying and look them up on Amazon. Read the NEGATIVE reviews to see what they DON'T like about the products they already use - this will give you ideas for better products to sell and it will also help you filter \"bad\" products After doing your research, go to sites like AliExpress and search for unique products that not many people are selling and that you think your target audience would love. Yes, it takes time and patience. Some of my best products were found on page 53 of the search results! Sometimes it took me two weeks to find a good product to sell. Here's a trick I use to find unique products on AliExpress: Almost all Ali sellers don't speak English and use translators for their product titles and descriptions. Sometimes these translators will use different words than the ones we're used to. Here's an example: Often you will find that Ali sellers will use the word \"choker\" instead of \"necklace\". What you can do is grab a Thesaurus tool (just google \"thesaurus\" on Google and go with the first one that shows up) and insert your search term - for example, \"basketball gear\" or \"basketball jewelry\". Look at what synonyms that website gives you and use THOSE to search for products on Aliexpress. The word \"choker\", for example, is indeed part of the list of synonyms the Thesaurus shows you for the word \"necklace\". You'll be surprised at the little gems you can sometimes find using this method :) I don't promise you'll find gold everytime you use it (most of the time it shows irrelevant stuff). But when you find it, it is worth gold indeed.    "], ["Problems with NBA/basketball discourse", "18", "11", "2024-03-09T21:39:18.033000+0000", "https://www.reddit.com/r/NBATalk/comments/1baszoy/problems_with_nbabasketball_discourse/", "There are many things which plague contemporary basketball discourse. Box score watching (especially without context), over-emphasis on ring culture, etc. The biggest thing that I find concerning, though, is the constant need to discredit past generations and those who paved the way and allowed for the progression of the game. You don't see this phenomenon occur in baseball nor football, despite those sports undergoing just as much evolution as basketball. You simply don't see newer fans of the MLB/NFL say shit like â\u0080\u009cGerrit Cole > Pedro Martinezâ\u0080\u009d or â\u0080\u009cTyreek Hill >>> Terrell Owensâ\u0080\u009d (examples) on a large scale while completely downplaying previous eras. What gives? I understand that kids and young adults aren't heard in society whatsoever in just about any space outside of social media, hence the obnoxiousness, but what about basketball specifically attracts fans who hold such contempt for the past as opposed to literally any other sport?    "], ["A fascinating SI article from February 1979: \"There's an ill wind blowing for the NBA\" = the problems with pro basketball at the end of the 1970s", "16", "32", "2024-03-27T19:20:57.984000+0000", "https://www.reddit.com/r/VintageNBA/comments/1bpaemj/a_fascinating_si_article_from_february_1979/", "https://vault.si.com/vault/1979/02/26/theres-an-ill-wind-blowing-for-the-nba-attendance-is-slipping-and-the-leagues-tv-ratings-have-plummeted-leading-to-a-lot-of-cries-and-whispers-about-the-real-problems  We hear so much about where the NBA was before the arrival of Bird and Magic would soon help lift the NBA to great heights in the 1980s. How bad was it really? You know that old saying \"it's always darkest before the dawn\"? Boy the NBA was in a rut before it rose to such great heights: \"ATTENDANCE IS SLIPPING AND THE LEAGUE'S TV RATINGS HAVE PLUMMETED, LEADING TO A LOT OF CRIES AND WHISPERS ABOUT THE REAL PROBLEMS\" \"Twelve of the 22 teams are drawing fewer fans than they did a year ago for the same number of playing dates. League-wide, attendance is down 3%, after 621 of 902 games.\" \"the most alarming news is that attendance in the big four markets of New York, Los Angeles, Chicago and Philadelphia is down drastically: the Knicks (11%) and Bulls (31%) are once-strong teams that have become woefully weak, but the 76ers (19%) and Lakers (11%) are bona fide championship contenders.\" \"television ratings are down a whopping 26%. The first four regular-season Sunday CBS telecasts were beaten soundly by everything the other networks threw at them, including Superstars and boxing (ABC), and college basketball (NBC).\" \"blaming the Knicks for all the NBA's troubles is illogical. Just like the NBA, the NFL took off on New York success, but pro football has done splendidly even though the Giants and Jets have had poor records and little national attention for years. And baseball did just as well in those years when the once-powerful Yankees were in eclipse. Although CBS has been properly criticized for treating its telecasts as little more than a bridge between a refrigerator race and a golf tournament, and for further compounding its error by showing regional games rather than focusing attention on one big national game.\" \"Far more realistic reasons for the league's troubles lie within the game itself. The teams play a tedious 82-game schedule that begins during the World Series and doesn't end until early April; then the playoffs begin and go on until June, when most spectators have long since wearied of watching a winter sport. The seven games of last year's championship series between Washington and Seattle stretched over 18 daysâ\u0080\u0094for television. Instead of reflecting the beauty and intensity of the sport, the series was about as exciting as the pro bowlers' tour, whose ratings are higher than those of most regular-season NBA games.\" And in 1979 Sports Illustrated was basically the source for sports news (remember this was 7 months before ESPN's debut).    "], ["Just starting Out and already having Problems with shooting", "12", "6", "2024-02-12T17:50:50.716000+0000", "https://www.reddit.com/r/Basketball/comments/1ap61vp/just_starting_out_and_already_having_problems/", "Hey im 14 years old and Just thought i wanna learn basketball. 2 weeks ago i bought a basketball and Started playing basketball every day and anytime I could. Even tho I've been putting in the work I seem to not be able to shoot the ball right. First said I'm pretty small at like 153cm or some or in other terms 4\"11 as I believe. I can't throw really far and it just doesn't feel right  it doesn't feel like the ball flies out my hand its rather really hard for me and I think I'm using My second hand accidentally because of that as well. Basically I think I have many issues on my shots which I believe to be the release and probably a guide hand issue. Basically I've wanted to ask if there's some drills or exercises I can do to learn shooting the right way without so many issues..    "], ["Anyone have billing problems with Physiq gym?", "5", "6", "2024-04-23T01:33:39.806000+0000", "https://www.reddit.com/r/albanyor/comments/1cas98p/anyone_have_billing_problems_with_physiq_gym/", "We've had problems with them double charging and they are impossible to reconcile with. Emails to the main office go unanswered and the front desk staff say they can't do anything. Looking them up on BBB shows numerous complaints. What is up with this place?    "], ["Who else has run into problems with claiming points for becoming a trusted trader?", "1", "0", "2024-02-21T06:48:02.980000+0000", "https://www.reddit.com/r/Monopoly_GO/comments/1aw5jut/who_else_has_run_into_problems_with_claiming/", "It seems like every time I try to submit a trade on discord to earn the trusted trader, I just keep running into confusing and ever-changing/arbitrary \"guidelines.\" Nothing is ever good enough. Oh well. Kudos to y'all who stuck it out enough times to get your points. I'll stick to the og outlaw trading instead of jumping through random hoops that keep moving. Have fun with y'all's basketball game. â\u009c\u008cï¸\u008f    "], ["Having problems with shoes being too tight on the sides?", "4", "1", "2023-10-28T12:32:35.596000+0000", "https://www.reddit.com/r/BasketballShoes/comments/17ict47/having_problems_with_shoes_being_too_tight_on_the/", "Recently whenever I buy basketball shoes after playing for like 15 minutes the pain starts kicking in on the sides, outwards. It tends to go away the more I play or when I loosen up my laces a bit ( But I think this is not so smart due to being more prone to twisting my ankle ). I am wearing size 45. Should I maybe get 45.5 next time I buy shoes? Any advice?    "], ["10 Problems with the Sunday Night Timeline", "92", "84", "2023-11-14T10:08:44.491000+0000", "https://www.reddit.com/r/AshaDegree/comments/17uz5gn/10_problems_with_the_sunday_night_timeline/", "Sometimes I feel the more I read about Asha's case, the less clarity I have over the case facts as I come across more inconsistencies in news reports or realise something else that just doesn't add up. Below are 10 problems with the timeline from Sunday night to Monday morning.  1. THE LACK OF INDEPENDENT SOURCES.  All the timestamps from Sunday night - when the kids went to bed, when Harold checked on them - are provided by immediate family with no independent sources. Now this is really not the fault of the Degrees that their account can't easily be verified given it was at home during the night when people are sleeping. My point though is this means they could have adjusted times to suit them. Establishing and verifying a timeline is one of the most critical tasks for LE and an experience detective would interview the parents separately, check info is consistent etc. but unless they identify something to be contradictory, LE and we are ultimately reliant on the parents' word.  2. THE SCARCE SUNDAY INFO.  On Day 4, a timeline starting 4 days prior to Asha's disappearance was published. We learn what she did and where she was on: Thursday, Friday, Saturday, Sunday and Sunday afternoon but Sunday evening - what's probably the most crucial part - is glossed over. This timeline from LE has zero information about what the family were up to that evening:   Crawford said Asha went to bed around 8 p.m.   Electricity went off in the Degree's neighborhood just before 9 p.m., after a car wreck nearby.   We can expect a Sunday/school night to be low-key but very mundane details were included for the other days - e.g. Asha catches the bus to school . This shows me that there was sensitivity around Sunday night.  3. THE POWER OUTAGE.    A power outage, attributed to a car crashing into a power pole, affected the Degree neighbourhood just before 9pm, lasting till about 1230am. Power outages don't necessarily affect all buildings in the same area at the same time though. Based on first reports :     Her father said that the power went out around 10 and came back on around midnight Sunday. (This is consistent with the broader power outage).    My point again though is there's a reliance on what the Degrees say around when exactly the power went out and was restored at their house.   A digital clock would reset to show 12:00 (if power is lost) once restored. Let's say the power outage lasted until 11pm in reality at the Degree house - clock would say 12:00 once reset. Let's say the outage lasted until 1:00 in reality - the clock would show 12:00 once reset. This could have somehow confused the Degrees time recollection that night - or given them a very easy way/excuse to mislead everyone about the times from that Sunday night. Doesn't matter if they also had a watch or analog clock.   It's worth noting that later that Monday, the Sheriff said Asha may have got up while the power was out    EDIT: Sorry, I just relistened to her recent 2023 interview and Iquilla actually says outright- â\u0080\u009dI guess it was about midnight because the power kicked back onâ\u0080\u009d and. â\u0080\u009dThere was a power jolt that's how I knew it was about 12 o'clockâ\u0080\u009d . Huh? She's literally saying the power being restored is what told her that the time = 12 midnight. No, power doesn't magically get restored at 12 midnight and at this time only. As I said, the clock resetting could have somehow genuinely confused them at the time but it is so weird that Iquilla is explaining it later as if this logic is correct.  4. THE LONG-TERM REMINISCING.  Iquilla reminiscing 20+ years later about that Sunday night is difficult to consider accurate & reliable - because of the additional complexity created by genuine memory loss and misremembering (on top of any intentional misleading). There are some things that I'd expect her to remember clearly from that night/morning but her memories about things like relatives coming by, watching TV etc. could be interweaved from other occasions- not necessarily specific to that Sunday. As I believe the aftermath of the basketball game to be the trigger for Asha's disappearance, I unfortunately have great trouble believing they were sitting there as a happy family watching a basketball game together that night.  5 . THE 2:30AM NARRATIVE.  The narrative for what happened at or around 2:30am in the Degree house that night has always struck me as a little odd.  What was first reported :   Mr. Degree said that he checked on Asha at about 12:30 a.m. and she was sleeping in her bed.      O'Bryant told police that he saw his sister get up around 2:30 a.m. in her nightgown and go to the bathroom but then came back to bed.    LE's timeline published a few days later doesn't acknowledge O'Bryant last seeing her.   When electrical service is restored around 12:30 a.m., Asha's father sees both Asha and O'Bryant in their beds. The children sleep in the same room.Asha's father goes to bed around 2:30 a.m.    Later reports say    Her father said that he had checked on her around 2:30 a.m. and later her brother said he got up to go to the bathroom between the hours of 2:30a.m. and 6:30a.m. and he believes she was there.   On face value, I have less concern for Harold checking on the kids but so many questions about O'Bryant's account. Notice the change from Asha getting up for the bathroom to himself. Was it unusual for Asha (or him) to go to the bathroom or get up for any reason in the middle of the night? If he had been awoken by Asha moving about, it seems unusual he'd bother to look over and notice her apparel - did he sense something to be out of place? As O'B then apparently goes back to sleep and is now not disturbed by a squeak from his sister's bed and doesn't hear a sound from Asha allegedly leaving the house shortly after. Unfortunately his account just seems fabricated to me (my blame is not toward him as a 10 year old but the adults in this situation). Anyway, this all creates a little uncertainty around the crucial question- who last saw Asha & when?  6. THE CIRCULAR REASONING.  A couple of eyewitness sightings were provided of someone on the highway in the early hours of Monday - the first being at 3:45am. A common belief is the sighting must have been Asha because it lines up with the time she was last seen by her family at 2:30am. Also her family saying they saw her at home at 2:30am must be true because it lines up with when the eyewitness saw her on the highway at 3:45am. The fundamental problem with these beliefs is that both start with an assumption. You can't validate an assumption based on an assumption. This is circular reasoning. Basically, you'd be saying â\u0080\u009cX is true because of Y, and Y is true because of Xâ\u0080\u009d. The conclusion is inherently flawed. Both may still be true of course.  7. THE CHANGING BEDTIMES.  Some say that inconsistencies are due to memory loss over a period of time. I agree this can happen, depending on what the information is, but many of the inconsistencies in Asha's case are within the first few days and weeks -such as what time Asha went to bed.  until her father told her to go to bed around midnight - 15 Feb    Asha's father said the girl went to bed about 6:30 p.m.- 15 Feb    She watched TV in the den with the rest of family until returning to bed at 9 p.m - 15 Feb    Crawford said Asha went to bed around 8 p.m - 17 Feb   I would dismiss smaller differences e.g. 9pm vs 9:30pm - but a 4 hour variance is an issue. Note the last time (8pm) from the Sheriff - why did he simply change Asha's bedtime as if it to â\u0080\u0098correct' it? I believe her bedtime must have been around midnight per what Harold first stated. The  advantage to the Degrees with a 8pm bedtime = it conveys good parenting, disciplined children and a normal night. This doesn't apply in reverse i.e. no advantage to say Asha went to bed at midnight if she actually went to bed at 8pm. Plus there was the midnight lounging on the couch...  8. THE LATE COUCH LOUNGING.   Reported the first day    Asha's dad said she laid on the couch in jeans and a purple and white \"Sun Degrees hot in Atlanta\" T-shirt until her father told her to go to bed around midnight.   Why was Asha, whose bedtime was by 9pm on school nights , not in bed and still in day clothes at midnight? This detail weirdly disappears in subsequent news reports. I'm zeroing in on this not simply to be critical that Asha was up but because it shows irregularity in routine just hours before she was reported missing. It needs to be explained.  9. THE LATE NIGHT CANDY TRIP.   Reported by ABCNews GMA    <voiceover-reporter> about 1130, asha's father harold says he goes out to buy valentine's day candy. when he comes home, he watches TV, checks in on the children, and goes to bed about 230.   What's interesting is this aired 10 years later. It's unclear if he said this in 2010 or GMA were reporting what Harold had previously told LE. I cannot know for certain if this was the first time the candy trip was publicised but it makes very little sense for Harold to introduce this information ten years later. If LE's decision, I wonder why it was shared in 2010. Anyway - ultimately it does seem like an excuse. Harold simply making a late candy trip is plausible - but that's what makes it a good excuse for why he/his car may have been seen by someone at that late hour.  10. THE EARLY MORNING BATH.  From an interview with Jet magazine    <Jet> Can you share the basic facts regarding your daughter Asha's disappearance.   <Iquilla> I woke up on Feb. 14, 2000 at 5:45am. The alarm went off for my children to go to school at 6:30am. I went to the bathroom, two feet away from the door, to start the bath water because they could not take a bath the night before since we had a power outage.   This interview with Jet happened 13 years later. The detail about a bath was not out in the public sphere prior to this time, to my knowledge. From a Feb 2000 article    The typical day starts at 6:10 a.m., when Iquilla got up to get ready for work at Kawai American, a piano manufacturing plant in Lincolnton. She'd wake the kids up then, and they were responsible for getting dressed, fixing their own breakfast and brushing their teeth before going to school. At 7:30, Asha and O'Bryant met the bus..   It's unclear if usually the kids would be woken up at 6:10am (when she woke up) or after she got ready for work but just sharing how a typical day in the Degree household had been described. I will however point out she specifies the bathroom being 'two feet away from the door' . Why? I know Iquilla can be verbose with her responses but this detail seems extremely unnecessary. Why did the power outage at 10pm stop the kids having a bath? Unfortunately, this bath overall does seem like an excuse too. Perhaps someone saw movement at the house at an early hour? I suspect the commotion at the Degree household started much earlier than 6:30am. Because of all of this, I think it's worth reconsidering the window of opportunity [2:30am - 6:30am] in Asha's disappearance and asking what other explanations could exist for when this little girl went missing.    "], ["My Issue With Current Basketball", "17", "5", "2024-02-04T00:13:13.577000+0000", "https://www.reddit.com/r/justbasketball/comments/1aiaehp/my_issue_with_current_basketball/", "I'm new here and I guess you all had issues with my videos but just wanted to give some analysis.  Anyways, as a former player, father of a current one, and long time watcher, it's been hard to watch current NBA and even some AAU these days.  I believe it started with positionless basketball and slowly phasing out traditional bigs for more mobile big men that can space the floor.  Now they're so spread out a lot of them are not able to recover to get back and protect the rim.  So we get almost defense the level of the All Star game.  Even in AAU and some school ball, you may see 5 wing players on the court just running and gunning.  From 2010-2016 the amount of games a player scored 40 or better was averaged at 49 since its 123.  It just seems it's all offense and little defense and lack of guys in the game that can actually make a difference defensively, especially in the paint.  Just a little rant.    "], ["Issue with shooting college basketball", "7", "5", "2023-11-26T19:55:51.436000+0000", "https://www.reddit.com/r/photography/comments/184j5yg/issue_with_shooting_college_basketball/", "Hey all, I shoot occasionally for my local NCAA D1 athletic department. Mainly cover some fall and winter sports. After each competition I shoot, I send the edited images to the comms team and throw a few up on my personal social media. This then causes the players to reach out for a download link. But I'm not allowed to share with the student athletes. My question is: is it common for athletic departments to share photographs with the athletes? From what it sounds like my school doesn't share the images with the student athletes so they come asking me! Figured I'd ask here since a lot of the photographers at the games I attend are also confused by this. Thank you!    "], ["A major issue with discussing the show here", "168", "396", "2024-01-20T01:38:33.160000+0000", "https://www.reddit.com/r/TheCurse/comments/19b00t1/a_major_issue_with_discussing_the_show_here/", "false  is that this was a show built on a series of microaggressions and displays of privilege and thoughtlessness, but most people commenting here do not have very well-tuned social cue detectors. It's how we get threads on how Whitney and Cara playing basketball was nice, or how Abshir was a bad tenant.    "], ["My Issue with Sports Romance", "62", "100", "2023-07-21T10:55:31.454000+0000", "https://www.reddit.com/r/RomanceBooks/comments/155km2e/my_issue_with_sports_romance/", "DISCLAIMER: This is my first time posting on Reddit, and I'm not sure how this works, but I hope I'm posting in the right place. This is more of a rant than anything else. I love sports romance (I'm an athlete) but Wattpad college sports romance pisses me off. All the books are quite literally the same thing. The titles sound the same, the name of the characters look & sound the same, the plot line is the same, the motives are the same, and there is no effing originality. It's either the unnoticed FMC who ends up being partners with the MMC or the journalism major who either has to interview the MMC or is partners with him for a class. The MMCs are either basketball or football players and are ALWAYS white. They're also always on the way to making it to the NBA or NFL â\u0080\u0093 (One author pissed me off by saying that the MMC was drafted by like five different teams and he chose his favourite. Drafts do not work like that but whatever). The MMCs are always portrayed as manwhores and players just because they're sexually active and don't date. They always have a baby while still in college, get married, and live HEA as the MMC gets drafted. The number of books I read that follow this damn structure is frustrating. The sports are always ignored and the lack of diversity is atrocious. Considering that basketball and football â\u0080\u0093 at both the collegiate and professional levels â\u0080\u0093 are predominately Black-dominated, it's crazy to me that there's not a SINGLE black character in these books. You mean to tell me that this college football or basketball team is made up of all white people? And your entire starting players are all white? BFFR. While I'm a firm believer that authors should write what they want because it's their book, I also feel they should be realistic. When I read a hockey romance, I'm not expecting black players because hockey is predominately white. Sad but true. When these authors write a 6 series book with only not a single POC character or just a single short story containing a black MMC, I'm annoyed. The MMC's blackness is never explored. His culture and values are not explored. The necessity of code-switching to assimilate in various environments is not explored. If you removed the sentence that says the MMC is black, it makes no difference in the book. There is nothing differentiating him from the 6 other white MMCs in the previous books of a 10-book series. It's just bad representation and it makes me more upset than having no representation. I wanna hear y'all thoughts on the issue. Feel free to disagree. I want a genuine conversation that allows room for mistakes and understanding.  **Thank y'all so much for the recs and upvotes. I'll definitely check out some of the books.    "], ["Slight issue with CCAs in poly", "3", "4", "2024-04-09T07:17:29.990000+0000", "https://www.reddit.com/r/SGExams/comments/1bzm242/slight_issue_with_ccas_in_poly/", "So I may have a bit of issues with CCA selection: I already have two CCAs I wanted to join in mind, both of them are mostly related to martial arts. Both of them combined already take up a good chunk of time. Then my parents really wants me to join basketball, due to thier belief that basketball will make me taller, along with the fact that I'm quite short according to them. What should I do? I feel like I'm at a loss-loss situation here. If I follow thier wishes, it will be very difficult to juggle 3 CCAs and Schoolwork, not to mention basketball and another CCA I want to join clashes with each other, if I don't follow, my parents will continuously nag at me for not following thier wishes. In both scenarios, my sanity will take a hit    "], ["anyone else having an issue with today's daily set", "12", "8", "2024-04-16T04:13:29.582000+0000", "https://www.reddit.com/r/MicrosoftRewards/comments/1c5702g/anyone_else_having_an_issue_with_todays_daily_set/", "so I'm trying to clear the first task of tuesday's daily set which is NBA related i guess and even tho it took to the NBA website and everything, the shit is not checking off for me and I don't feel making an NBA account just to submit a randomized bracket because i don't give a shit about basketball update: it popped on my Xbox Bing app    "], ["Weird Issue with roblox, or my computer.", "1", "1", "2024-05-07T18:52:54.710000+0000", "https://www.reddit.com/r/RobloxHelp/comments/1cmjhbg/weird_issue_with_roblox_or_my_computer/", "I was trying to load up a game on roblox called \"Basketball Legends\" and it just froze my whole PC and I was unable to like actually do anything about it, I looked at my task manager before it completely froze and it said it was boosted up to 97% memory in use. I am unsure what the issue is, is it my computer? or my roblox. My computer isn't the best but I am able to run RDR2 which I would consider a more heavier game than roblox. What do yall think?    "], ["Basketball with a long lens, or are the issues with me? + bonus monopod question", "6", "2", "2024-01-10T00:58:44.432000+0000", "https://www.reddit.com/r/sportsphotography/comments/192v9g7/basketball_with_a_long_lens_or_are_the_issues/", "So I shot my second basketball game using my 24-70 and 120-300 combo (instead of 24-70 and 70-200) and, well, it was not great. I got some good stuff (I'll post later when I actually get around to finishing the edits) as usual but my brain was having a hell of a time zooming with the 120 since sigma zooms backwards to nikon. Muscle memory was fighting me the entire time. I think I will give it another try thursday and then the DH this weekend to see if I'm ready to throw in the towel. I missed a lot of shots last night because of the zoom playing hell on me. But I am also thinking of using a monopod to maybe cut down on the different elements that I have to control (gotta focus and zoom while also hand holding and keeping things in frame). Those that shoot basketball with 300/400's do you hand hold or monopod? There isn't a concern with room or anything, last night we had double our normal \"media\" outlets there with me, our beat reporter from a city an hour away, the visiting media guy and their local reporter.    "], ["What are the fans' issues with TMOs?", "75", "22", "2023-11-04T10:37:41.619000+0000", "https://www.reddit.com/r/rugbyunion/comments/17nixe8/what_are_the_fans_issues_with_tmos/", "As a man from outside of the big rugby nations, who only started loosely following rugby once I went to study in the UK, I don't get why there's so much negativity online around TMOs. Is it simply that people online are more likely to not filter their moaning and complaining, or are people genuinely against having a TMO in the current form it's in? And if it's the latter, why? As a guy who grew up watching mostly football and basketball, rugby seems so much better with its refereeing standards and video reviews. VAR in football is a joke and it's still better than not having it, despite what the old geezer at the pub will say, and NBA reviews are pathetically long and even more infuriatingly they just boil down to \"We made our decision and we're sticking to it, no matter how wrong it seems!\". When you complain about TMOs, do you have another sport in mind that does it better? Now, I'm not saying TMO is perfect, for me one thing that every sport should have is the ability to request a video review which is then decided by the first official and not be at the mercy of a guy sitting in a booth, and even then rugby does it's review way more satisfactory than football and basketball. So, is there something I am missing as a very casual fan that's never played the sport, or do some of you just enjoy complaining?    "], ["[Discussion] What are the biggest issues with your team so far this season?", "81", "16", "2023-11-25T20:56:18.848000+0000", "https://www.reddit.com/r/nba/comments/183tb4j/discussion_what_are_the_biggest_issues_with_your/", "The biggest issues with the Lakers so far: Offense   Ranked #25 with a 111.1 ORtg   Offense is horrible when LeBron is off the floor. On-court ORtg is +7.9, Off-court ORtg is -14.0   3-point shooting   Ranked #25 shooting 34.3%   LeBron (41.4%) and D'Lo (40%) are the only players shooting 35+% on 4+ 3PA   Free throws   Ranked #23 shooting 75.9% FT   Anthony Davis and Austin Reaves are the only players shooting 80+% on 2+ FTA   1st quarters   Ranked #29 with a -4.5 differential in 1st quarters   Sources:  https://www.teamrankings.com/nba/stat/average-1st-quarter-margin   https://www.basketball-reference.com/teams/LAL/2024.html     "], ["Issues with this Bulls team", "35", "19", "2024-03-13T19:43:42.993000+0000", "https://www.reddit.com/r/chicagobulls/comments/1be0qqw/issues_with_this_bulls_team/", "Terrible offensive rebounding   No concept of how to defend pick and roll   Inconsistent shooting   No ATO game   No rim protection   Somewhat undersized, especially at 4/5   Prominent players play at a slow pace, coaches and less prominent players prefer fast pace   Possible chemistry issues between â\u0080\u009cbig threeâ\u0080\u009d   Hard to imagine that with Lonzo, all of this was relatively unimportant, even if it was just half a season, but it was.    "], ["Issues with Jeans", "5", "1", "2024-03-23T14:05:00.473000+0000", "https://www.reddit.com/r/ftm/comments/1blsyd5/issues_with_jeans/", "Basically I just don't know how to wear jeans lmao I'm a big boy, I have wide hips and thick thighs. I usually wear high-waisted jeans because I'm a bit insecure about my stomach and high-waisted pants hide it a little. And I cannot for the life of me figure out how to look masculine in jeans. I can't wear basketball shorts for the rest of my life! What kinds of jeans do you guys recommend for wider hips?    "], ["Tenant having issues with neighbor [Landlord] US-MI", "1", "0", "2024-06-01T01:26:08.042000+0000", "https://www.reddit.com/r/Landlord/comments/1d5blqe/tenant_having_issues_with_neighbor_landlord_usmi/", "My tenant let me know that one of the neighbors regularly keeps their dog chained to a basketball hoop that's on their property, however, the dog can reach the past my driveway and is scaring the tenant. Tenant also let me know that the dog has dug a huge hole that goes under our fence and about a meter into the ground on my property. I talked to the neighbor, asking them to keep their dog on their property and to fill the hole but they were rude and disrespectful. They want me to cut a tree that's on my property because â\u0080\u009cthe birds are pooping on her property, the leaves are going in her gutter, and there's a lot of leaves to clean up in the fallâ\u0080\u009d. I told them I would be open to splitting the cost of removing the tree but would not remove it on my own since the tenant and I do not have any issues with it. I'm at a loss here and not sure what to do, hoping you guys could help provide some advice. TIA!    "], ["Anyone else have issues with certain midsoles?", "2", "5", "2024-02-23T04:16:31.744000+0000", "https://www.reddit.com/r/BBallShoes/comments/1axre5t/anyone_else_have_issues_with_certain_midsoles/", "A year or two ago I bought a Nike basketball shoe with an element react midsole, after a few sessions in them, I gave them away. The midsole was too soft so every time I played more than 5 minutes, it feels as though the energy I put down into the shoe is bouncing back to my foot causing soreness and discomfort. Just got in the new ASW GT Cut 3's with the newer ZoomX midsole tech. First impressions were great, midsole foam was a lot harder to the touch so I thought I'd have no issues. Only 20 minutes of shooting around and I'm getting the same issue. Never experienced this with any other shoes, no matter the brand. Maybe I personally cannot do foam midsoles? Anyone else every experience anything similar?    "], ["Issues with ImportHTML", "3", "2", "2024-01-05T20:21:09.086000+0000", "https://www.reddit.com/r/googlesheets/comments/18zgi2y/issues_with_importhtml/", "I have been working on an NBA model recently, and I have one sheet that imports that last 5 game stats for every player in each teams' starting lineups that day from that player's basketball reference page. However, recently I have been having issues with the ImportHTML. Sometimes, it says \"Error: Cannot fetch URL\", and sometimes it just says \"Loading...\" for a long time and doesn't load. I think this might be due to there being so many ImportHTML calls as I am doing it for every player in the starting lineup for each team, but I have never had any issues like this before when using ImportHTML. Is there anything I can do to improve this so it imports the data that I need more efficiently and effectively without taking a long time to load or having multiple errors that I have to go manually correct?    "], ["Trouble with releasing emotions.", "3", "1", "2024-01-14T09:12:25.487000+0000", "https://www.reddit.com/r/Healthygamergg/comments/196bvoe/trouble_with_releasing_emotions/", "Listen, I'm M/21, I've had this problem my whole life and its hard for me to express my emotions until it builds up to the point where I feel like its a detriment to myself and I would like to get them out. I can give one example of how I know this is really bad. My last basketball game of high school all my senior buddies was crying about it being the end and that we most likely wont be playing again. I love basketball and my friends on that team so much but I felt like I was the odd one out cause I didn't cry at all. not even a tear. Please if anyone has some way to make me be able to have emotions like a normal person let me know.    "], ["Trouble with junior players", "7", "3", "2023-11-07T22:36:46.937000+0000", "https://www.reddit.com/r/BasketballCoaching/comments/17q6njh/trouble_with_junior_players/", "Hey all! First time posting! I coach junior (under 12) basketball and I'm struggling to get one of the kids to work with his team. Individually the kid is the best player by far, probably in the league, however he will consistently try to take the game on himself. I've tried to talk to him about passing and how it spreads the defense, I've tried to discuss different movements and schemes to assist. Unfortunately he's taking the game on as though it's him vs the world and I don't know how to rectify that. Any help will be appreciated.    "], ["Struggling with ACIM tearing me down at the turn of every page", "38", "7", "2024-05-15T13:21:49.558000+0000", "https://www.reddit.com/r/ACIM/comments/1cskobw/struggling_with_acim_tearing_me_down_at_the_turn/", "I've read the full text, and now I am diligently doing the lessons. Currently in the review section; Lesson 56. Just in these two pages the text is just shitting on my entire life and making me feel like an idiot. Â²How can I know who I am when I see myself as under constant attack? [CE W-56.1:2]  Â³The world I see attests to the fearful nature of the self-image I have made. [CE W-56.2:3]  Â²The world I see holds my fearful self-image in place and guarantees its continuance. [CE W-56.3:2]  Â³While I see the world as I see it now, truth cannot enter my awareness. [CE W-56.3:3]  Â²In my own mind, behind all my insane thoughts of separation and attack, is the knowledge that all is one forever. [CE W-56.5:2]   And just from the Lesson 55:  â\u0081¶What I see tells me that I do not know who I am. [CE W-55.1:6]  Â²The world I see is hardly the representation of loving thoughts. Â³It is a picture of attack on everything and by everything. â\u0081´It is anything but a reflection of the love of God and the love of His Son. [CE W-55.2:2-4]  Â²How could I recognize my own best interests when I do not know who I am? Â³What I think are my best interests would merely bind me closer to the world of illusions. [CE W-55.4:2-3]  Â²To me, the purpose of everything is to prove that my illusions about myself are real. Â³It is for this that I attempt to use everyone and everything. â\u0081´It is this that I believe the world is for. â\u0081µTherefore I do not recognize its real purpose. â\u0081¶The purpose I have given the world has led to a frightening picture of it. [CE W-55.5:2-6]  ### Like... it's fucking depressing me to read these review texts and just be shitted on the entire time. It's like going to a basketball camp, and at the start of each practice we sit around and say: \"You do not understand the basketball.\" \"The way you play the game right now is lost on you.\" \"You have not seen a real basketball court before.\" \"Your thoughts you have about basketball have nothing to do with actually playing basketball. You are just in a dark room, and probably alone.\" \"Do you even play basketball? Not in reality. You think you do. But it's just an illusion.\" And this just goes on and on and on and on. Where is the end? I thought I would reach some conclusion or centeredness at the completion of reading the text. Not really. So now i am diligently doing the lessons everyday, and getting really annoyed because I can already tell I'm going to spend the next year or more doing these and for what? To be told every day I am doing it wrong? I'm reaching out for help here, not just to shit on ACIM, because I am hopeful there's a better way here, but this is just really annoying me and I am seriously considering finding a different path because this one is just starting to feel like a hamster wheel. Thanks for being with me.      "], ["Movies with someone struggling with their relationship with their mom?", "144", "45", "2024-05-30T20:15:32.889000+0000", "https://www.reddit.com/r/MovieSuggestions/comments/1d4dc4i/movies_with_someone_struggling_with_their/", "Hi! Tittle says it all. I really liked Everything Everywhere All At Once and I do plan to watch Lady Bird eventually but I need something after that one haha. Thank you in advance!    "], ["Struggling with Keratoconus: Feeling Depressed ", "37", "29", "2024-04-03T22:40:47.523000+0000", "https://www.reddit.com/r/Keratoconus/comments/1bv6pje/struggling_with_keratoconus_feeling_depressed/", "Hey everyone, I'm reaching out here because I'm feeling really down lately, and I could use some support or advice. I'm 21 years old and have been dealing with keratoconus, i suffer from blurry and ghosting vision. It's been tough, especially when I see my peers enjoying activities like football or basketball, things that I used to love but now find challenging due to my condition. Seeing others effortlessly engage in these activities while I struggle with something as fundamental as clear vision has been incredibly disheartening. It's hard not to feel left out or inadequate when I can't participate in the same way. It's like there's this invisible barrier preventing me from fully engaging in things that used to bring me joy. I know comparing myself to others isn't healthy, but it's difficult not to when it feels like my condition is holding me back from fully participating in life. It's not just about the sports either; it's about feeling like I'm missing out on experiences that many people my age take for granted. I'm trying to stay positive and focus on what I can do, but some days it feels like a constant uphill battle. I'm reaching out here in the hopes of connecting with others who might be going through something similar or who have found ways to cope with similar challenges. If anyone has any advice, coping strategies, or just words of encouragement, I would really appreciate it. And if you're dealing with keratoconus or any other vision-related challenges, know that you're not alone. Let's support each other through this. Thanks for listening.    "], ["Struggling with contact ", "4", "2", "2024-05-08T12:31:47.643000+0000", "https://www.reddit.com/r/BasketballTips/comments/1cn3eto/struggling_with_contact/", "I've played basketball for over a decade, and one of the things I always did was shy away from contact. It worked for a while but now because I'm playing better competition, the lack of contact I initiate is opening a huge hole in my game. I've worked with a trainer but I think I just have a mental block with initiating contact. I do have some balance issues when going to the rim and I'm not amazing around the rim but I do alright. I just feel like I'm gonna plateau if I don't figure out how to initiate contact and play through it.    "], ["My boyfriend is struggling with depression and Iâ\u0080\u0099m not sure how to help", "1", "1", "2024-06-19T21:59:15.461000+0000", "https://www.reddit.com/r/Advice/comments/1djvapw/my_boyfriend_is_struggling_with_depression_and_im/", "Hi, my 18 F boyfriend 19 M and I have been dating for about 7 months now and early in the relationship he opened up to me about his depression. It's up and down and he never takes any of his frustrations out on me but on occasion he'll get into the habit of getting in his own head and kind of avoids the world. I've been doing my best to help support him emotionally when it gets bad, and when things are great, I'm the happiest whenever I see him smiling too. It breaks my heart seeing him so anxious sometimes but I'm unsure how to comfort him besides things I've been doing. I work a ton so I cannot always physically spend time with him besides the 1 day a week I am able to have off, but I'm willing to make sacrifices from work to redirect my attention to him as well. How can I help more? The question that comes up about me being unsure if he's losing feelings is that recently it's gotten really bad and I've noticed he's not as motivated anymore at all. He spends a lot of time playing basketball now, usually with friends but sometimes alone. It's one of his hobbies and so I'm happy he's enjoying himself but the recent distance makes me question if he's avoiding me as well. I've tried talking to him about it already and he told me there was nothing to worry about nor was he losing feelings, but I do tend to overthink at times as well. I also did recently gift him a pair of basketball shoes he's been wanting for a long time and he told me he wanted to put them to use. Sorry for the lengthy post. I think my biggest priority is seeing if there's any advice I can get for helping him with his mental health. Thank you for reading of you take the time out of your day to    "], ["I'm struggling with breakfast and I need to run, any tips for motivation?", "9", "2", "2024-01-07T21:33:46.258000+0000", "https://www.reddit.com/r/ask/comments/19138sk/im_struggling_with_breakfast_and_i_need_to_run/", "I hate cardio. Absolutely detest it. But I need to commit more of my workouts to it because I play basketball. So I want to run in the morning before work if I can but I can't find any motivation to get out of bed and run. Akin to this is some weird thing I've been having with breakfast; I know I need to eat in the morning but I just can't bring myself to eat until around 10/11am. It's definitely affecting my mood and I know if I get my runs in and have a good breakfast my mood and productivity will improve. Any tips?    "], ["Really struggling with physicality as a skinny guard, need some advice", "39", "72", "2024-04-03T06:09:43.782000+0000", "https://www.reddit.com/r/Basketball/comments/1buldtl/really_struggling_with_physicality_as_a_skinny/", "I'm a 19 year old 6'2 guard who just got called up to play in my country's D1 men's league from the U19 leagues. It seems the men's league is really a different game in terms of physicality because I felt completely useless on offence in my last game. I find myself constantly knocked off balance on drives and was hounded by the opponent guard all game despite my height advantage over him. The average height of a guard in my league is probably 5'9 which means I have a great advantage in terms of length. I used to abuse this in my U19 leagues but it seems the grown men strength has stopped my bag from working. My fitness coach is insistent on working on my cardio instead of building more muscle but I feel like I'm at a dead end here if I don't work on my skinny frame. Need some advice on how I can use my length against these physical but shorter defenders.    "], ["Struggling with the fact that I might have ruined my own face", "2", "1", "2024-01-28T19:25:13.725000+0000", "https://www.reddit.com/r/AdviceForTeens/comments/1adap0h/struggling_with_the_fact_that_i_might_have_ruined/", "I'm 15 and I have a long narrow face with an awful profile and long midface. Around 2-3 years ago I quit football and basketball indirectly due to Covid and since then my exercise has been inconsistent. I used to have a way more square head so I think my worse posture caused by lack of exercise has fucked my facial growth. Could this be true? My face has gotten so bad and my parents aren't willing to help me    "], ["I been struggling with talking correctly and be comprehended", "4", "1", "2023-12-17T19:08:50.522000+0000", "https://www.reddit.com/r/Christianity/comments/18kolhj/i_been_struggling_with_talking_correctly_and_be/", "After confinement due to covid 19, I have focused on doing much more productive things with my life, among other things, I have started a career as a basketball player, etc. I have realized that when I speak, I do not seem to make things clear to others, although for me, they are. I feel like people don't understand me when I express my thoughts, this causes me a lot of frustration and takes away my desire to express myself, to the point that I don't know how to express my feelings or even have them. Sometimes I feel like a robot because of all this What advice can you give me?    "], ["Help needed! Best basketball shoes", "13", "6", "2024-03-18T14:27:46.822000+0000", "https://www.reddit.com/r/Basketball/comments/1bhs1y9/help_needed_best_basketball_shoes/", "Hi everyone! My boyfriend is a basketball player while I'm completely clueless about it. His birthday is coming soon, and I was planning to buy him new shoes to play with. In the last months, we went to several stores looking for a new pair but he couldn't settle for any of those we found and he wasn't sure about spending the money, so I decided to buy them myself for his birthday. Do you have any advice on what I should buy? I want him to be happy but I have no idea what characteristics I should be looking for ð\u009f¥² he's been looking for the Jordan 4 Superfly for AGES. However, I couldn't find them anywhere (mind that I live in Italy, so the offer is not as wide as in the US). Is this a type of basketball shoe? I thought so, but now I'm not so sure anymore lol if it is, maybe it can be useful to understand what he likes. Thank you!!    "], ["Help needed for a beginner with no basketball experience ", "4", "2", "2024-05-09T14:47:58.956000+0000", "https://www.reddit.com/r/BasketballTips/comments/1cnz28c/help_needed_for_a_beginner_with_no_basketball/", "I am a awkward non atheletic teen who wants to play basketball but i have no idea how to start I do not want a professional coach or smth just want to learn on my own Plz give some tips and online sources from where i can learn Thank u    "], ["College Basketball Fantasy Help Needed!!", "7", "0", "2023-11-02T17:32:38.641000+0000", "https://www.reddit.com/r/CollegeBasketball/comments/17m8wd2/college_basketball_fantasy_help_needed/", "My friends are putting together a for fun college basketball fantasy league and it includes I think basically every D1 team! I have never even done fantasy nba or anything other than football and the draft is tonight!! Obviously there has to be like thousands of players, and I feel like there have got to be some small schools with players throwing up 30 shots a game somewhere. Anyone have any recommendations for players destined for big stat line numbers this year in or out of the power conferences??  I have been struggling to find many online resources for this, so any links would be appreciated as well!! I think we have 5 guards and 5 forwards/centers and the scoring is 1 p/point, 1.25 p/rebound, 1.5 p/assist, 2 p/block, 2 p/steal, -1 p/turnover, +10 points if player is ejected (for fun lol)    "], ["stretching help needed", "3", "1", "2024-05-04T19:14:46.344000+0000", "https://www.reddit.com/r/Stretching/comments/1ck81aa/stretching_help_needed/", "specifically low back,hamstrings,glutes,knees,ankles and groin most of these pains ill blame on basketball but i also want to feel more loose and in control of my body if anyone has any stretches i can do it would be loads of help,thanks    "], ["Action shots - Help needed!", "3", "1", "2024-02-11T16:15:43.168000+0000", "https://www.reddit.com/r/osmopocket/comments/1aobl9i/action_shots_help_needed/", "I am looking for a way to capture action footage from sons basketball practice, my nephews basketball games and my daughter's gymnastic competitions. The pocket 3's active track is just not cutting it, so I have been just picking an area and manually moving as the action moves. I am going to see if zooming in, tagging and then zooming out works, but I am also looking for a mount that holds my cell phone so I can get a bigger imageâ\u0080¦ sort of like what the pocket 2's extension handle did. Any suggestions from lives experience?  Camera tips or accessories welcome.  Thank you.    "], ["HELP NEEDED! Trying to visit all D1 arenas", "12", "11", "2023-12-01T02:38:09.317000+0000", "https://www.reddit.com/r/CollegeBasketball/comments/1880r3b/help_needed_trying_to_visit_all_d1_arenas/", "I have a lifetime goal of visiting all D1 basketball arenas (I'm currently at 97). However, it has become increasingly difficult to plan trips efficiently. I was wondering if there was a way to view the Men's basketball schedule on ESPN or similar website as a map? The way I'm picturing it, you could select a date and there would be pins on the map where all of that days games are being played. Maybe when you click on the pin it gives more info (time, venue, etc). This may be more of a website coding question, but I thought this might be a good place to start. Appreciate any help    "], ["Christmas magic help needed for 4 kiddos - PA ð\u009f\u008e\u0085 REPOST!!", "14", "4", "2023-12-16T22:25:47.657000+0000", "https://www.reddit.com/r/SantasLittleHelpers/comments/18k2ami/christmas_magic_help_needed_for_4_kiddos_pa_repost/", "This year has been really hard with bills and keeping up with the home.. so sadly Christmas for the kiddos has just become impossible. Super grateful for SLH and everyone that's here to help create those Christmas morning smiles ð\u009f\u0098\u008a The youngest is Myles. He'll be turning 3 on 12/8 and so FULL of energy and love. He enjoys singing and playing with his siblings. He also loves trucks, cars and anything that makes sounds.  https://www.amazon.com/hz/wishlist/ls/3M9C610ZLL22D?ref_=wl_share  Triston is a 9yr old boy. He enjoys playing baseball, basketball and going to school. He also loves building with legos and creating new things.  https://www.amazon.com/hz/wishlist/ls/192BBZRWVGOPX?ref_=wl_share  Jolynn is a 10yr old girl. She loves art, playing with makeup and all things leggings lol. She has a huge heart and enjoys helping others.  https://www.amazon.com/hz/wishlist/ls/1J4KB6ENNPX18?ref_=wl_share  Aaliyah is a 15yr old girl. She enjoys playing basketball and softball. She's super silly and loves to joke around with everyone. She's grown from shy to very outgoing this past year.  https://www.amazon.com/hz/wishlist/ls/376SECHVI6CF0?ref_=wl_share  ITEMS BOUGHT BY AMAZING SANTAS: Myles- sippy cup and truck otw Triston- backpack otw Jolynn-  necklace and Diamond kit otw Aaliyah- nail item and phone case    "], ["Help needed", "26", "17", "2023-10-11T07:46:03.679000+0000", "https://www.reddit.com/r/indianbikes/comments/1758iez/help_needed/", "I got in an accident last night here in Gurgaon. The traffic light turned red and the XUV guy stopped as he should. I didn't notice it in time as I just peeked in my RVM and couldn't brake on time and so hit his car from behind. I was wearing gear so I am safe without any injuries. Apparantly this guy is a police person and I asked him not to file an FIR. He asked for my license ID and I had to give it as I was alone. Now he's asking me to cover the damages which he sent an estimate of 28k, I thought I will claim third party insurance. He said he doesn't want any insurance claim on his papers as his car is new. What to do in this situation?    "], ["I NEED HELP WITH BASKETBALL", "8", "6", "2024-05-20T12:35:34.494000+0000", "https://www.reddit.com/r/BasketballGM/comments/1cwei3a/i_need_help_with_basketball/", "hello, i am a boy from the Netherlands and im trying to get wayyy better at it. i have played basketball for 5 years but im trying to get someone to help me get better. if you want to help please dm me on discord (po1skastra1ght) thx to everyone that wants to help me!    "], ["I need help getting over the fact that my basketball career is over.", "81", "45", "2023-12-10T04:22:55.801000+0000", "https://www.reddit.com/r/Basketball/comments/18evdes/i_need_help_getting_over_the_fact_that_my/", "I'm a 17 year old male who just graduated highschool back in June. Basketball was always something I was really good at growing up. Grade 7 and Grade 8, countless mvps in tournaments, 30pt games, I was under 5ft at the time which gave me a disadvantage but I always played well. Grade 9, I was around 5ft-5'3ft and started struggling with confidence. I would cook everyone in practice or scrimmages but when it came to games, I would struggle performing 100%. The games where my confidence was really good though, I would score 20+ pts. Grade 10 was Covid no ball but grade 11 was the first time I played SR. Varsity. We had scrimmage one of our first practices and I hit 15 3s. My confidence was through the roof that year coming into the season. I was cooking my teammates who eventually went D1 and D2. I was 5'5 at the time but I'm very athletic. I was the fastest on the team and was able to dumk off a lob. First game of the season, I came off the bench and got on. I lost the ball after 2 possessions and coach took me out and I didn't play for the next 5 games. We played a trash team and were up 101-28 and coach didn't put me on until the last 4 mins but put everyone else on. I always came to practices, always worked on my game, was nice to everyone, good grades, and didn't know why my coach never put me on. I fell into depression due to basketball and external factors and fell out of love for the game and stopped playing the last 2 months of the season. My grade 12 year I played senior varsity again. This time I hoped things would change and it kinda did. I would be benched all season but I would play like 10 mins here and there for the first 3 games. One game I crossed someone up and made a jumper. Scored 6 pts in 3 mins. The next game I didn't play at all. Same thing was starting to happen like last year but I kept pushing through hoping that my coach would change. Last few weeks of the season. A game before playoffs; it was our senior night. Not really a shocker but I never played a single minute. Cried so hard that night. Playoffs came around. I started to play more and things were turning around. I would play 20+ mins our first game, and our second. I would play a lot again our 3rd game but we lost and our season was cut short. For the 10 months I have been struggling with the fact that I could've had so much better if I had a better coach. Everyone on my team was surprised and how little I played. I hated how my family would come to my games to watch me sit the whole game. I cried so hard after so many games. Up to this very point in time, I can't seem to get over the fact that basketball is over. I play in men's league games but it is not the same. Dead crowd, zero atmosphere, etc. i have many sleepless nights thinking about how great I could've been. My potential. Years wasted on basketball. I wish I can turn back time. How can I get over this immense pain I'm feeling? I feel like this will never go away. My love for basketball was so deep, even my breakup with my gf of 2 years was so much easier. I wish I was taller, I wish I went pro, I wish I had a different coach, I would do ANYTHING to turn back time. Please help    "], [" Need help from basketball coaches ", "0", "0", "2024-06-25T14:33:39.839000+0000", "https://www.reddit.com/r/BasketballTips/comments/1do7h8j/need_help_from_basketball_coaches/", "Have you been a basketball coach in the last 2 years? ð\u009f\u008f\u0080 Dr. Dish is conducting research, and we'd love to get your perspective: https://form.typeform.com/to/SAOFFAOh     "], ["Basketball Autograph - Need help?", "2", "1", "2024-06-02T02:35:17.651000+0000", "https://www.reddit.com/r/AutographAssistance/comments/1d63bj6/basketball_autograph_need_help/", "Found this in my things with this note - however I looked up rosters from 2005 until 2010 and can't seem to find a number 10 or 1 on the NJ Nets that fits this. I went to a game in 2005 - that's why I think it's from then. However, I also went to a basketball camp from 2008-2010 that was headed by two basketball players. If I can find their names I'll update that here - believe me I tried. This was all when I was young so I do not remember too much. It's definitely from 2005 to 2010. Any help would be appreciated!    "], ["Need help with 4th grade girls basketball", "23", "11", "2024-02-07T15:33:31.623000+0000", "https://www.reddit.com/r/basketballcoach/comments/1al5mky/need_help_with_4th_grade_girls_basketball/", "Coaching a 4th grade girls team, and most of our girls have never played before.  Adding to the challenge, the school placed us in a 5th grade league. Specifically, I'm trying to figure out how to give us the best chance at getting shots up.  The defense is allowed to guard once we cross half court.  I have a decent ball handler at PG, but she is often under pressure soon after she crosses the half court line.  I had our biggest girl set a screen for her, which does give her a little space to advance the ball, but more pressure typically arrives when we're still behind the 3-point arc. Usually we have someone decently open inside the arc for her to pass to, but due to our skill level we dribble with our head down.  If we pick up our dribble to see the passing options, it usually results in a steal or forced jumpball. I tried ditching the screen idea and just have her make an initial pass around the half court line, but the first defender is usually a foot taller and just swats it and takes off for a breakaway layup. I understand the odds are greatly stacked against us due to skill/age, but for those have been in this situation, what if anything can we do to get the ball within say 10-12' of the goal to give us a chance to attempt a shot?    "], ["Need help with basketball shoes", "0", "1", "2024-04-22T18:32:57.759000+0000", "https://www.reddit.com/r/BBallShoes/comments/1caicxn/need_help_with_basketball_shoes/", "I'm a 14 year old small forward who is 5'4\", 125 pounds. i  specialize in defense and like to dribble and shoot middies and layups although i can shoot 3s too. i want something under 140 dollars and am open to anything    "], ["Need help with a basketball sites", "1", "1", "2024-04-18T18:38:41.614000+0000", "https://www.reddit.com/r/BBallShoes/comments/1c7awp1/need_help_with_a_basketball_sites/", "I found a shop called dunkshop.eu they have really good prices and 20k followers on instagram but the prices are lil suspicious (80$) for freak 4s. I think thet are legit cuz they have some local stores in europe. Do you have any sites with good prices???    "], ["Need help finding basketball shoes", "0", "1", "2024-04-04T13:07:37.156000+0000", "https://www.reddit.com/r/Shoes/comments/1bvmomc/need_help_finding_basketball_shoes/", "Hello! I have been struggling to find basketball shoes that fit for a while. I played in college and always jammed my feet into narrow shoes and made it work. Now that I don't play all the time my feet aren't conditioned for this, so whenever I do play it is very uncomfortable. I wear a size 14 4E running shoe and was wondering if there is anything even close to this for a basketball shoe. The closest I have found is New Balance has 2E shoes but I can never get these in stock. Looking for some help! Thanks! For some context I currently wear some Lebrons from 2022, had to get them in a pinch because my other shoes had a blow out. The most comfortable shoes that I've played in are actually 2017 Adidas Crazy Explosive.    "], ["need help calculating 3 point percentage in basketball.", "5", "1", "2024-04-28T17:41:34.470000+0000", "https://www.reddit.com/r/askmath/comments/1cfc54y/need_help_calculating_3_point_percentage_in/", "okay,  I am not a math person im sorry, and I was wondering if i can get the *how* and not just the number, but here goes. Trae young made 39 3 pointers and shot 32% on them. How many did he attempt to get to make 39 shots?  I tried asking google for help, but I cant even put into words what Im trying to do to make a search helpful. Thanks in advance if anyone answers.    "], ["Quick help for first time basketball coach for U16s", "5", "1", "2024-04-21T05:32:16.310000+0000", "https://www.reddit.com/r/basketballcoach/comments/1c9a9wt/quick_help_for_first_time_basketball_coach_for/", "Hi, it looks like I'll end up coaching my son's U16 basketball team, as no one else has put their hand up and the team will fold without a coach. I've coached my kids' soccer teams when they were little, and know enough about that sport to be dangerous, plus coaching at that level's not too difficult.  But I'm not a \"basketball guy\" and these are teenagers and decent players.  (They won their first game last week with a stand-in temp coach.)  I watch basketball ocassionally, and know the very basics of the game, but will need to educate myself on all the fouls, strategies, techniques, drills, etc.  I'll definitely spend some time digging through this sub and online. More immediately, though, if I have to coach the boys at a game in the next few days, does anyone have any quick advice/tips/suggestions on what I should be looking for, telling them to do, etc?  I mean I can stand there, sub players in, and yell \"rebound!\"; but would appreciate any immediate advice that will help me provide a bit more value, at least until I can spend some time on it.  Thanks!    "], ["need help for improvement", "2", "1", "2024-04-22T18:04:05.431000+0000", "https://www.reddit.com/r/BasketballTips/comments/1cahmb2/need_help_for_improvement/", "i am currently training for basketball working out for it improving my body.. and last week i played basketball for the first time and it was amazing.. so that gave me more motivation to continue improving myself and trying to strengthen my skills and abilities in basketball though the problem is i dont have the space for it.there aren't any basketball courts in me area except in skills and not everyday we've got pe and the semester is about to end which means that i will not be able to play anymore. is there a solution to this problem like an alternative to a basketball court?    "], ["No II's and Looking for Help for Next Cycle", "37", "5", "2024-01-23T23:15:10.691000+0000", "https://www.reddit.com/r/premed/comments/19e23jk/no_iis_and_looking_for_help_for_next_cycle/", "Hi everybody, I applied to 35 schools this cycle and am waiting to hear back from around 30 of them. This cycle unfortunately did not go as I hoped and I was hoping to get some feedback for next cycle. I submitted everything by mid to late August except for a couple of schools whose secondaries I received later. 23 yo CA ORM 514, 3.75 cGPA, 3.65 sGPA Clinical ~1000 hrs broken down into the following: - 650 hours (paid role + leadership) : Lead Medication Technician at hospice/memory care and elderly living facility - 50 hours (volunteer) : homeless medical clinic - 100 hours (volunteer) : COVID-19 vaccination clinic - 150 hours (volunteer) : hospital emergency room volunteer - 50 hours physician shadowing Non-Clinical Volunteer >1500 hrs - founded and ran/coached a competitive travel basketball club for low income kids - high school basketball coach (in a low-income school district where I also help tutor kids who struggle to stay above the 2.0 GPA cut-off) - animal hospital: volunteered here the summer after my freshman year before I knew I wanted to pursue human medicine Non-Clinical Paid - basketball trainer for elementary aged kids Research - 500 hours in a plant pathogen lab (basic bench research, have one publication in the works hopefully coming out later this year) Random stuff - I speak Mandarin and Spanish (use Spanish a decent amount in my clinical experiences) School List: California:   UC Davis (from NorCal)   UC Riverside (have ties to the area)   UC Irvine   UC San Diego   California University of Science and Medicine   UC Los Angeles   Kaiser Permanente   UCSF   USC   OOS:   Rush Medical College   University of Arizona College of Medicine - Phoenix   Emory University School of Medicine   Albany Medical College   New York Medical College   Miami Miller   Chicago Med Franklin   George Washington   VCU   University of Rochester   Drexel   Temple   Sidney Kimmel   St. Louis University School of Medicine   Wake Forest   Oakland Beaumont   Hackensack   Creighton   Georgetown   Colorado   Eastern Virginia   Quinnipiac   Tufts   Medical College of Wisconsin   Geisel at Dartmouth   University of Vermont   During this application cycle, I have continued to do research, volunteer in the hospital, and coach high school basketball. Additionally, I am volunteering at the food bank and volunteering as a photographer for the food bank's events and for animal shelters, where I take portraits of pets hoping to get adopted. Thank you for taking the time to read my post. For those of you who received acceptances this cycle, congratulations! For those of us still waiting to hear back, just stay patient, we got this!     "], ["Quality adds to help for this week and beyond", "32", "21", "2024-03-21T05:39:04.765000+0000", "https://www.reddit.com/r/fantasybball/comments/1bjzarv/quality_adds_to_help_for_this_week_and_beyond/", "I wrote this Monday night. Sorry if it is late. (It had to go through an editing process) Feel free to ask me any questions you have.  https://fftradingroom.com/373/Quality-Fantasy-Basketball-Waiver-Adds-for-March-18th---March-25th     "], ["gift help for boyfriend", "22", "2", "2024-02-29T15:36:44.316000+0000", "https://www.reddit.com/r/teenagers/comments/1b3370e/gift_help_for_boyfriend/", "hello it is my boyfriends birthday in like a week and i literally do not know what do get him PLEASE SOMEONE HELP i dont want to get him something generic like jewellry or like hot wheels but i dont even know what teenage boys like these days i dont really have a budget but i just really want him to like it he likes basketball, giraffes, physics, the gym, ralph lauren clothing and ME :3 PLEASEEE HELP MEEEEE    "], ["Need Help for a game", "2", "0", "2024-06-08T00:04:17.075000+0000", "https://www.reddit.com/r/robloxgamedev/comments/1dapqea/need_help_for_a_game/", "I'm making a basketball game, and I'm struggling on making a shooting script, I'm trying to make it where when I press e to shoot, it does the animation, but when I used a script, it didn't work, can someone please give me a script so I can keep my dream game alive    "], ["Help for sbp student", "3", "1", "2024-06-16T06:22:24.270000+0000", "https://www.reddit.com/r/Bolehland/comments/1dh1e10/help_for_sbp_student/", "So currently in form 4 and i see most people start to glow up around this age. i have no problem with my face, it's average. but does anyone know how to lose some weight when you go to sbp and can't control what you eat? because you eat what dewan makan serve so.. i also do some exercise at waktu riadah(mainly jogging and playing basketball) so if you know how to help would very much appreciate it, thanks    "], ["Bracket Help for work competition ", "7", "0", "2024-03-19T18:44:28.610000+0000", "https://www.reddit.com/r/NCAAW/comments/1birsfc/bracket_help_for_work_competition/", "So my work is doing a competition for the women's basketball championship bracket thing and I know nothing but I want to beat my friend at work. Could someone link or provide a photo of their completed bracket predictions? Thanks you so much!    "], ["help for moving on offense", "3", "1", "2024-01-03T07:27:06.003000+0000", "https://www.reddit.com/r/BasketballTips/comments/18xdlcp/help_for_moving_on_offense/", "14m 5'6 i am very good on the defensive end of the game but i have major struggles in offense, not like shooting or passing though i could also improve on those. But i have barley any idea on how to correctly run the floor on offense, like when to set screens, when to move around the court and when and where to move the ball. Especially since the school i go to is a a top 10 basketball school in the country and i want basketball to be my future. i feel like i can do better but keep finding areas im not great at. Any tips or advice on how to get better would be greatly appreciated ð\u009f\u0099\u008f    "], ["Help for a new player", "1", "2", "2023-09-12T00:23:49.338000+0000", "https://www.reddit.com/r/Basketball/comments/16gceaj/help_for_a_new_player/", "Hi, i just turned 14 a few weeks ago and am starting freshman year of highschool. I decided that this year im gonna be serious and try and be good at basketball. I have done a few other sports in the past(including basketball) but It was nothing long term, and I was dogshit at all of them and didnt try or practice much at all. I didnt care about basketball at all until my parents signed me up for some practice last year, where I played for the first time. I had(still have) issues with procrastination so I didnt practice at all, or really cared about it. So like the lessons ended and I didnt do anything. I told myself that I would practice daily, but even though I had so much free time I didnt do anything, also I had no idea what I was doing or how to practice, nor did I have any friends to play with(or friends period) so I had no motivations and stopped. My parents really want me to play basketball and are disappointed that I dont. Like I already disappointed and failed them enough so I want to get good at basketball this year. Not like play on a school team or any high level or anything; I started too late for that. But my goal to be able to play decently well, maybe with some other kids my age. Anyway I found some 10 minutes handling workout on youtube so im just gonna try and do that everyday. Emphasis on try. If anyone has anymore help or advice for me and knows what I should do that would be greatly appreciated. Thank You    "], ["Help with Finding New Basketball Shoes ", "15", "3", "2024-04-13T12:29:30.166000+0000", "https://www.reddit.com/r/BBallShoes/comments/1c30ts5/help_with_finding_new_basketball_shoes/", "I'm looking for ideas for a new basketball shoe to wear. I've worn Nike until about a couple months ago I bought the Tatum 2, and I love them but apparently everyone else does too. The resell market doesn't make sense half the time, and I don't think they're worth the resell price lol  ð\u009f¤·ð\u009f\u008f½â\u0080\u008dâ\u0099\u0082ï¸\u008f I'm open to all brand ideas. I liked the KD 15s, and the PGs were always comfy for me. Thoughts?    "], ["Help with bolt on basketball goal please!", "15", "2", "2024-05-10T17:10:10.184000+0000", "https://www.reddit.com/r/Concrete/comments/1counxv/help_with_bolt_on_basketball_goal_please/", "https://imgur.com/a/befFXkL  Hey all, Installing a bolt on basketball goal for my kids and looking for some recommendations. The instructions recommend a 36â\u0080\u009d deep x 16â\u0080\u009d wide hole that's flared at the bottom. Used a bobcat auger but hit a granite boulder at 25â\u0080\u009d deep. The hole ended up being about 24â\u0080\u009d in diameter also. I was thinking about drilling 3 3/4â\u0080\u009dx10â\u0080\u009d holes into the granite at an outward angle, epoxying rebar into the holes meeting in the middle, then pouring the concrete onto that while following the rest of the instructions for the anchor. Just wondering if anyone sees any issue with that approach or can recommend a better way or additional steps I should add onto my existing plans for maximum stability. Thanks!    "], ["Does dancing really help with footwork in basketball", "33", "11", "2024-01-29T12:13:35.855000+0000", "https://www.reddit.com/r/BasketballTips/comments/1adtwps/does_dancing_really_help_with_footwork_in/", "I was supposed to ask here on reddit how to become a smarter player besides form experiences. But later I asked it to a friend who is very smart at the game. Then we chatted for a bit telling lots of things, then his main topic became that besides from basketball i should also try dancing to help with my footwork. I cant tell if he is serious or not. But i did say to him that I remember I think kobe also practiced dancing when his hand became unable to shoot for a while. So is this really effective if so what dances should i try to implement to my practice     "], ["Help with basketball sign-up", "1", "1", "2024-04-03T17:20:45.006000+0000", "https://www.reddit.com/r/BasketballTips/comments/1buydqx/help_with_basketball_signup/", "Hi, I organize pick up games at my company. We usually only play if there are 8+ players so we can play full court. Sometimes we'll play half court if we have less. I've been using Slack Polly app to send out weekly polls and people select when they can play. So the poll has options like this: Monday\n8+ at noon\n6+ at noon\nAny at noon\n\nTuesday\n8+ at noon\n6+ at noon\nAny at noon etc.. The Slack Polly app works okay but it's very basic. I have it scheduled to send out the poll automatically. I want to have an auto message when enough people vote for a certain option but it doesn't do that. I wanted to reach out to this awesome community to see if anyone has a good system for signing up that works well for you. Thanks!    "], ["Help with camera and lens - indoor basketball", "7", "1", "2024-04-21T21:17:17.259000+0000", "https://www.reddit.com/r/canon/comments/1c9szhr/help_with_camera_and_lens_indoor_basketball/", "We have an AAU basketball team that travels around playing basketball tournaments. The gyms have various lighting situations. Our photographer would be sitting on the endline only a few feet from the court. Photos do not need to be super high quality as their only use will really be social media posts and promotional material. I'm lost on what decently used camera and lens to buy. Doesn't need to be 100% high quality but I don't want something that you'd get with a $50 walmart camera. Anyone have any suggestions? Would like to stay in the 500-600 range.    "]]