[["I'm the one working for our family and my husband is the one taking care of the house and kids, and everyone we know has a serious problem with that", "392", "5454", "2024-05-02T02:02:29.510000+0000", "https://www.reddit.com/r/TwoXChromosomes/comments/1ci3ztc/im_the_one_working_for_our_family_and_my_husband/", "When I got a good job in an area with a low cost of living, while his job prospects looked bleak, he expressed interest in exploring his productivity at home. He wanted to experiment with finding ways to save and generate income from home. He's exceeding all expectations! He tends to a large garden, growing fruits and vegetables, manages fruit and nut trees, mastered the art of canning, prepares all our meals from scratch, excels at household chores, engages in beekeeping as a hobby, attends local beekeeping association meetings, has introduced us to a vibrant community of beekeepers, brews our own beer, and recently acquired the skill of soap-making. I couldn't be prouder of his accomplishments. He sells produce and honey at the Farmers market on weekends during the growing season. It's disheartening how some people perceive his efforts. They unfairly paint him as lazy, disregarding his significant contributions. I had to distance myself from one friend who suggested I should divorce him. It's absurd. If our roles were reversed, with him working and me managing the household, I doubt anyone would question my efforts.    "], ["My (25M) girlfriend (23F) never wears a bra and it makes me uncomfortable - how do I fix this problem with myself?", "434", "2134", "2024-03-14T19:38:11.732000+0000", "https://www.reddit.com/r/relationship_advice/comments/1betwzv/my_25m_girlfriend_23f_never_wears_a_bra_and_it/", "Everytime I have research this problem, the advice I have always seen was to speak with your partner about this and let them know it makes you uncomfortable, and if they're willing to adjust behavior for you great and if not maybe you aren't compatible. I disagree with this, because even though this makes me uncomfortable I also believe it's ridiculous for me to feel this way, and I definitely don't think I should police how she should dress. I want advice on how to fix this problem WITHIN ME. This is a problem within myself, I don't understand why I feel this way because it's not like she's walking around naked. I am extremely happy in this relationship, so I don't want something dumb like this causing any issues. I want to be a better, more healthy person.    "], ["Problem with drugs in my social circle", "74", "209", "2024-06-18T20:42:34.927000+0000", "https://www.reddit.com/r/Anarchism/comments/1dj0z6t/problem_with_drugs_in_my_social_circle/", "Hello, I am part of an anarchist association. We do some activities and meet quite often and I have an issue I have problems bringing up. Several of my colleagues take hard drugs (mainly speed) and I don't think that is the space it should be used. I am all about being able to choose whatever you like but I am a little worried about it going further. I ahve problem bringing it up because I am the first to drink a beer during assemblies. Do you think is important enough or fair that I talk about it? Any suggestion?    "], ["Dear Slovenians, I think you have a problem with your dogs!", "190", "264", "2024-05-18T05:39:04.309000+0000", "https://www.reddit.com/r/Slovenia/comments/1cuq8cz/dear_slovenians_i_think_you_have_a_problem_with/", "Dear reader, what you're reading isn't a rant from a tourist who wants to teach the locals how to live, but a heartfelt message from someone who loved visiting your country. Last week, we visited Slovenia for the first time, together with our dog. We found kind people, great food, clean cities, and breathtaking views. The first incident happened in Ljubljana: a free dog crossed a central street twice to reach our dog and bark at her. Luckily, the dog was small and just annoying, but the owner didn't care much about us or about the cars that had to wait for her dog. She left without saying anything. As beer lovers, we decided to spend two nights in Kamnik to enjoy the guided visit to the famous craft breweries and the city's surrounding areas. While walking in the main pedestrian street, we met an unleashed Belgian Shepherd. Our guide kindly asked the owner to check the dog, but she refused. Less than one minute later, the dog attacked ours. Luckily, we were able to stop it without any injuries. In the end, the owner put the blame on us, saying she always left her dog free and she was in her city. The day after, we took a walk after dinner. While we were at the foot of Mali Grad, we literally had to hide to avoid being noticed by an unleashed German Shepherd. We were worried about encountering other free dogs, so we decided to go back home. Sometimes, small things can have a big and unexpected impact on other people, but not everyone seems to be aware of it. Lep pozdrav!    "], ["Women, would you have a problem with your husband having his buttcrack and beer belly showing, or would you not care?", "12", "0", "2023-09-28T05:51:47.801000+0000", "https://www.reddit.com/r/Marriage/comments/16u7u0k/women_would_you_have_a_problem_with_your_husband/", "Say your husband's buttcrack is shown when bending over, whether he is in the house or not, and has put on some weight due to depression or whatever the case may be, to the point that his beer belly is exposed. Would you feel uncomfortable where you would no longer want to be married to him, or would you not care and still love him regardless?    "], ["Problem with hooks in React", "7", "0", "2024-03-16T16:56:03.225000+0000", "https://www.reddit.com/r/reactjs/comments/1bgaksh/problem_with_hooks_in_react/", "I have a project about a beer wishlist in which I used React. The problem is I get this error ``` TS2786: 'EditBeerPage' cannot be used as a JSX component. Its return type 'Element | undefined' is not a valid JSX element. Type 'undefined' is not assignable to type 'Element | null'. 32 |                     <Route path='/' element={<DisplayBeersPage />} /> 33 |                     <Route path='/addBeer' element={<AddbeerPage />} /> > 34 |                     <Route path='/editBeer' element={<EditBeerPage />} /> |                                                       ^^^^^^^^^^^^ 35 |                 </Routes> 36 |             </BrowserRouter> 37 |         </BeersContextProvider> ``` and I don't know how to fix this. I can provide more detail about my code if it is needed. ``` import { BeersContext } from '../../contexts/BeersContext'; import { BeerForm } from '../../features/CRUD operations/Beer form/BeerForm'; import { Layout } from '../../shared/components/layout/layout'; import { Button } from '../../shared/components/button/button'; import { Beer } from '../../models/Beer'; import React from 'react'; import { useContext, useRef } from 'react'; import { useNavigate, useParams } from 'react-router-dom'; function handleOnClick( idInput: React.RefObject<HTMLInputElement>, nameInput: React.RefObject<HTMLInputElement>, manufacturerInput: React.RefObject<HTMLInputElement>, typeInput: React.RefObject<HTMLInputElement>, urlInput: React.RefObject<HTMLInputElement>, ) { if (!idInput.current || !nameInput.current || !manufacturerInput.current || !typeInput.current || !urlInput.current) throw new Error('Inputs references are null'); if (!idInput.current.value || !nameInput.current.value || !manufacturerInput.current.value || !typeInput.current.value || !urlInput.current.value) throw new Error('You must provide values for each field!'); const beerId: number = parseInt(idInput.current.value), beerName: string = nameInput.current.value, beerManufacturer: string = manufacturerInput.current.value, beerType: string = typeInput.current.value, beerUrl: string = urlInput.current.value; return new Beer(beerId, beerName, beerManufacturer, beerType, beerUrl); } export function EditBeerPage() { document.title = 'Edit Beer'; const idInput = useRef<HTMLInputElement>(null); const nameInput = useRef<HTMLInputElement>(null); const manufacturerInput = useRef<HTMLInputElement>(null); const typeInput = useRef<HTMLInputElement>(null); const urlInput = useRef<HTMLInputElement>(null); const navigate = useNavigate(); const beersContext = useContext(BeersContext)!; const { beerId } = useParams(); if (!beerId) { navigate('/'); return; } const givenBeer = beersContext.beers.find((beer: Beer) => beer.getID() === parseInt(beerId)); console.log('Given Beer:', givenBeer); // Log the value of givenBeer const handleOnClickWrapper = () => { try { const newBeer = handleOnClick(idInput, nameInput, manufacturerInput, typeInput, urlInput); beersContext.removeBeer(newBeer.getID()); beersContext.addBeer(newBeer); navigate('/'); } catch (error) { alert(error); } }; return ( <Layout> <div className='main-page-container'> <BeerForm idInput={idInput} nameInput={nameInput} manufacturerInput={manufacturerInput} typeInput={typeInput} urlInput={urlInput} givenBeer={givenBeer} /> <Button type='submit' buttonMessage='Edit Beer' onClick={handleOnClickWrapper} /> </div> </Layout> ); } ``` thats the code for the EditBeerPage part. the project is correctly created using npm create-react-app lab1 --template typescript. I use Visual Studio Code. Tried editing EditBeerPage part of the code and others, changing from undefined to null and other things, but none worked. I installed the latest versions of react-router and react-dom. ChatGPT confirmed EditBeerPage return valid JSX components    "], ["When it's sunny I think Beer garden.When it rains I usually go to the pub for a while.When it's snowing I like to sit in front of the TV with a case of Beer.Im starting to think I have a problem with the weather.", "0", "1", "2023-12-09T19:31:34.855000+0000", "https://www.reddit.com/r/ApparentJokes/comments/18el319/when_its_sunny_i_think_beer_gardenwhen_it_rains_i/", "When it's sunny I think Beer garden. When it rains I usually go to the pub for a while. When it's snowing I like to sit in front of the TV with a case of Beer. Im starting to think I have a problem with the weather.    "], ["I donâ\u0080\u0099t know if I am having a problem with alcohol?", "13", "4", "2024-06-12T20:43:32.600000+0000", "https://www.reddit.com/r/NoStupidQuestions/comments/1deh11q/i_dont_know_if_i_am_having_a_problem_with_alcohol/", "I love drinking, there are some days (weeks in winter) that I don't drink at all, then in summer, at example today I drank two bottles of beer and one glass of wine. I don't feel drunk, I just feel good and relaxed. I don't feel THE NEED to drink, but when I have a long and hard work day I like to drink a can of beer (not everyday). On my free days maybe a little more. What are some signs that I need to watch for? I am a 29 yo female. I drink since I was 14/15    "], ["My problem with Other Half brewery", "41", "8", "2024-02-25T00:54:35.208000+0000", "https://www.reddit.com/r/beer/comments/1azarix/my_problem_with_other_half_brewery/", "Whether you like them or not, Other Half makes quality beer.  Yes they make a lot of IPAs, a whole lot.  Im not the biggest connoisseur of IPAs, but Other Half taste pretty darn good to me.  But it's almost as if thats all they make; it's  all IPAs with an occasional German or Czech Pilsner thrown in.  And therein lies my problem:  their pilsners are excellent and they need to make more.  Not every brewer that specializes in IPAs can make a quality Pilsner, but these guys do.   I don't mind them making all those IPAs; I get it, that's the market.  But really, those pilsners are so good they should be making them too, and often.  Sorry, I'm drinking one now and got carried away with my enjoyment.  That is all.    "], ["Problem with carbonation?", "1", "1", "2023-10-30T16:59:08.783000+0000", "https://www.reddit.com/r/Homebrewing/comments/17jy21k/problem_with_carbonation/", "Hello, I bottled my blonde ale, final gravity was around 1.010 but it was stable for some days so i thought it's ok to bottle. I calculated how much priming sugar i needed with this website https://www.brewersfriend.com/beer-priming-calculator/ and with 22Â°C and 22 L it said 163g of sugar which i put in dissolved in a little bit of water. I already posted about this, i waited a couple weeks longer but the carbonation didn't improve much. It seems like the beer makes plenty of foam when poured into a glass but the beer itself feels flat which is kind of weird. Any reason as to why this happens?    "], ["Problems with Kegging beer", "18", "7", "2024-02-08T13:39:21.146000+0000", "https://www.reddit.com/r/TheBrewery/comments/1alvx2u/problems_with_kegging_beer/", "Anyone having any problems kegging beer when at the last 5% of a keg? We have a 7bbl system and when kegging off of the brite tanks I'm flowing at almost 6.5 gallons per minute. But as soon as I hit roughly the last 5% of the keg I slow down to less than a 1/4gpm. Have ran head pressure in the brite tank from 12psi up to 20psi trying to counteract that problem. Any advice would be greatly appreciated. Edit: -Kegs are pressurized to 15psi off of our keg washer. -I do not have this problem with 1/6bbl kegs only 1/2bbl -I am filling 3 1/2bbl kegs at a time -I can keg 201 gallons 9 1/2bbls and 12 1/6bbls and only lose maybe a gallon of beer. -I have dropped down to a 1/2bbl keg at a time and tried filling slowly, trying to identify the problem -in 2 of our brite tanks we have had problems lately with them consistently chilling the whole volume of beer down to temp due to short thermal wells. IE temp probe says 34Â° but when pulling the beer for a carb sample it's reading 38Â°    "], ["Solved all my problems with a beer", "1", "5", "2023-12-19T18:00:27.888000+0000", "https://www.reddit.com/r/Vent/comments/18m83bh/solved_all_my_problems_with_a_beer/", "I was stressed with school, tasks, housework, I worked as much as I could but was tired, I opened a beer and now life is amazing. Cheers!ð\u009f\u008d»    "], ["Problems with kegs", "3", "3", "2023-10-23T20:29:59.098000+0000", "https://www.reddit.com/r/bartenders/comments/17eu92m/problems_with_kegs/", "Hello :) I have quite a situation right now and both my superiors dont answer my phone so im a bit stressed. We have these huge tanks for beer and both of them are empty. We have a small keg of beer but i have to conect it to a cider tap. I have thrown a shitload of cider smelling/tasting beer and it still smells and tastes like beer, is there hope that if I tap enough beers from the tube it won't taste or smell cider? Customers will notice but my boss says to use it either way... I feel like people will end up getting sick from it after drinking it.    "], ["PS5: persistent problems with companions (and the beer-bot) not actually traveling to settlements... What kinds of mods could be causing this, and why? I would like to be able to sort out the problem and avoid doing it again in the future.", "0", "2", "2024-05-24T22:20:34.227000+0000", "https://www.reddit.com/r/fo4/comments/1czx02n/ps5_persistent_problems_with_companions_and_the/", "At some point, my characters started ignoring my wishes in this regard. If I tell my current companion to get lost and go from wherever we're at (\"A\") to settlement \"B,\" the companion will dutifully leave me alone, but never leave location A. If A is a settlement, then the character will stop counting as a member of that settlement and no longer be accessible in the workshop. This happens, as far as I can tell, no matter what settlement I try to send them to. It also happens with the robot that makes your drinks cold--he will not budge from the bottom of the Shamrock Taphouse! With companions, I can at least go back and get them from wherever they plopped themselves down, but there's nothing I can do about the robot. The only workaround for this with companions is to have them as my buddy at location B when I tell them to get lost. Unfortunately, I'm having a repeated bug where Preston's companion menu doesn't open when I initiate conversation--he asks about taking over the Castle, but I can't trade items or ask him to come with me. (Originally, this seemed to be a bug in the very first quest in Sanctuary, and I used a mod to fix it, but he's regressed.) Preston is currently wandering around Greygarden, not counting as a member of that settlement, and not doing anything particularly companionable. I think that these are two separate issues. From posts from years ago, I've seen that some people blamed mods that changed settlements for possibly wrecking this somehow, but there was never a lot of detail. I do have one mod that remakes all of the vanilla settlements, but it seems like it's pretty widely distributed. I don't have anything messing with any of my companions. I am willing to try to reset Preston again if anybody thinks that redoing the first quest he gives me (going to another settlement) in order to get him to talk to me again is a good idea. I don't know what quest to do this with, though, because I did successfully complete the original one I missed by using the mod to reset its progress. I don't know what could have happened since then to cause the problem. And, just for kicks, if you used the robot crafting station to make a beer bot, will he keep your beer cold?    "], ["Having problems with SARP Counselors and my local program.", "23", "0", "2024-06-24T05:42:57.566000+0000", "https://www.reddit.com/r/navy/comments/1dn67sx/having_problems_with_sarp_counselors_and_my_local/", "I am a 20 year old sailor in SARP continuing care. I self referred for alcohol use back in November, I've been sober since then. I had an appointment in January to see a SARP counselor, at which point I was told when I returned that if I was still sober in 3 months I would be disenrolled and get to go back to normal. I returned three months later for my follow-up, still sober, it was only then that I was told I was supposed to be in â\u0080\u009cContinuing Careâ\u0080\u009d for those months. My DAPA never told me, nor did the counselor I saw initially. I was given a letter for my CO and sent to SARP at my base to start the program. Now I have been in continuing care since March, I have been sober since November, not drinking (for me) has been easy as hell. Haven't struggled or had cravings or any of that stuff, I had only wanted some assistance back in November. I turn 21 soon, and want to be able to go to bars and hang out with buddies without having the looming threat of â\u0080\u009ctreatment failureâ\u0080\u009d over my head if I want a beer or something while hanging out. The sobriety hasn't been a problem, but the lack of control, and their insistence that I need their help despite months of sobriety before I ever joined the program has left me disillusioned with all of it. And none of my concerns have been taken seriously. I was wondering if there is a way for me to get out of the program, and make a report against the local program, since the whole â\u0080\u009cContinuing Careâ\u0080\u009d thing after I'd already been sober for months feels like they are covering their own asses that they didn't enroll me sooner, or that they fucked up somewhere and don't want big navy to know.    "], ["Problems with duotight connections / EVABarrier tubing", "9", "2", "2023-10-05T14:37:40.761000+0000", "https://www.reddit.com/r/Homebrewing/comments/170jmxb/problems_with_duotight_connections_evabarrier/", "I recently decided to upgrade my 3-tap Komos kegerator with a 4-tap draft tower.  I also decided that I may as well replace my lines since my old lines were installed about 3 years ago.  After fussing with getting everything connected, I connected my kegs to test everything out, and two problems arose that I haven't be able to figure out.   One of the connectors is leaking where it connects to the shank (the reducer).  At first it leaked really bad, but I disconnected the line from the keg and pulled it underneath thinking the duotight maybe hadn't quick clicked into place.  It's not leaking as bad, but it's still dripping bad enough that I can't leave it connected to the keg or I get a puddle of beer in my kegerator that eventually makes its way onto the floor.   One of the connectors at the keg perpetually shoots out beer when it's connected.  Specifically, n the quick disconnect for the keg I have a duotight connector screwed in, and the beer is coming out the back end of that connector where the tubing goes.  I've tried switching out the quick disconnect, switching the duotight piece, and it's the same deal every single time.   Those issues are on two different taps/lines by the way: the other two taps work perfectly fine. My fear is that for the first problem there's something wrong with either the shank, the reducer, or maybe the tubing.  In any event, I'm worried this will be a pain to replace since those Komos draft towers are quite annoying to connect and disconnect.  Luckily that tap is on the top, so *maybe* I can loosen it and replace whatever is necessary without taking the whole tower off. The second problem really puzzles me.  I tried three different quick disconnects and maybe four duotight connectors, and it's the same deal every time.  My only guess is that something's wrong with the line.  I think the EVABarrier tubing comes in 8mm and 9.5mm OD versions, and I'm 99% sure all my stuff is 8mm, so I don't think I have the wrong size connector (plus, like I said, the other taps work fine).  The tubing was folded up a lot when it arrived and it has some bends in it.  My only guess is that maybe where I cut the tubing it was at one of those bends and that's somehow preventing the tubing from getting all the way into the duotight connector. Anyway, hoping someone out there might have some ideas or insight. Thanks and cheers!    "], ["Sudden problems with Honda Shadow", "1", "1", "2024-06-28T22:33:51.478000+0000", "https://www.reddit.com/r/MechanicAdvice/comments/1dqw8lq/sudden_problems_with_honda_shadow/", "Hello! I bought a 2005 Honda Shadow VLX600 back in October. It was very well maintained. Haven't had any issues with it up until yesterday. Earlier this week, I left the key on like a dummy, so I had to jump it. After riding awhile, it started fine all this week. I rode it to the pub last night(one beer only) and when I went to leave, I started it to let it warm up. While I was inside grabbing my stuff, my buddies outside said it started sputtering and then died. When I tried to start it, it would turn over fine, rev, and then die. I let it sit for awhile, and when I tried again, started fine. I rode it a couple times around the block to be safe. So I headed home. A few miles down the road, sputters and dies. Wait a few minutes. Starts fine. Few miles later, same thing. Finally it craps out completely, and my short ass had to walk it to Speedway. Now yes, it had gas. You could hear it sloshing if you shook the bike. I topped it off to be sure. But then, it wouldn't turn over. So I left it. Today, a buddy takes me and the trusty jumper cables to pick it up, and without jumping it, starts fine. Roars to life, and I rode it home with no issues, including stopping for some quick snacks at the corner store. I'm not even sure what to check at this point. I'm a fairly new rider, and not the most mechanically inclined.    "], ["recently diagnosed -- should i go gluten free and dairy free even though i dont have digestive problems with these foods?", "54", "3", "2023-09-06T07:22:50.490000+0000", "https://www.reddit.com/r/Hashimotos/comments/16bdkdn/recently_diagnosed_should_i_go_gluten_free_and/", "I recently got diagnosed with Hashimoto's, I already have PCOS. I live in Europe (belgium) where there is amazing (sourdough) bread and patisserie everywhere. I usually eat tartine for lunch. I never have a bad reaction to gluten or dairy, or any digestive problems. I've done the food sensitivity test, and I don't have a sensitivity to either of these foods. I don't really have hashimotos symptoms related to digestion, i really went to the doctor to address my cycle-related mood-swings. I also found out I have high level of mercury and heavy metals, vitamin D deficient, which I am working on. Is it still advisable to cut out these foods? I know that intestinal permeability for most people happens with gluten, but I am wondering if I just reduce gluten to like one croissant a weekend, and the occasional pasta dish when I go out, if it's okay. I don't drink beer, and I guess I can switch my tartine to rice crackers </3 But i don't want to cut out entire food groups if it's not necessary Thank you     "], ["Issue with friends Boyfriend...how to proceed?", "241", "132", "2024-04-02T10:27:23.420000+0000", "https://www.reddit.com/r/AskIreland/comments/1btvayh/issue_with_friends_boyfriendhow_to_proceed/", "Friends Boyfriend Issues...how to proceed So this weekend my husband and I had the displeasure of spending a few days with a friends bf. We were in a larger group and one friend brought her bf whom we have met twice before. The 2 previous times before he was a bit intense but he was relatively alright and we were looking forward to seeing him...or so I thought. This lad probably means well but every extremely poor behaviour is met with 'well X had ADHD' or 'you can't tell x what to do, he has ADHD' or 'oh you'll never have a full conversation with X because he has adhd'. I have adhd diagnosed adhd which X does not have and I don't act like that. I struggle to fathom how at 30 something year old you can do whatever the fudge you please and when anyone says anything you can just say 'I have adhd'. Jesus I must have been missing a trick because I didn't realise I could just be doing whatever I pleased as an adult and just say sorry I fudged with your shit and break it after 7 times of you asking me not to touch it but I have adhd so it's not my fault. You know those kids that bounce around, scream at the top of their lungs when they don't get attention, touch and play with things without asking or doing it after it being expressedly told not to. The ones who know they're in trouble and dead look you in the eye and do it anyway then laugh as your stuff breaks...imagine a 30 something year old of that. That's EXACTLY the kind of person we're talking about. No impulse control, like less than 0, every intrusive thoughts comes out and is acted upon. My poor husband spent 7 hours standing on his legs with a disability because this lad wouldn't let him sit or pee or leave his stuff because he kept messing around with it, twisting knobs, messing with sliders and music and speakers, blasting them all the way up to max until the decks were freaking out and speakers were almost blowing. He couldn't even step out the side door for a cigarette. He couldn't even go to the fridge to get a beer this guy was that bad and defiant. If we ever said anything his girlfriend would say 'he has adhd he can't help it.' 'He has adhd so you can't tell him what to do'. The guy literally said to me 'ah I know I'm in trouble now' and laughed and when husband went to grab a beer from the fridge he did it again everything up to max. I genuinely met one of those. I was speechless, I've never met such a mentally regressed adult who 'functions' as a normal person in society. This friend is an integrated friend and her boyfriend is a total tw*t that having spoken to several group members separately, hate him but won't say it to her because she's 7 years deep and they like and want to support her. We have been integrated longer and are normal human beings who until this utter spanner came in all got along without a fight for years. Now we can't be harmonious because of literally 1 person. Do we just separate from the group? Or do I stick to my guns and make him as uncomfortable as he makes us? I can't even look at this person again they are that bad. Their face now makes mine and my husbands skin crawl. My mother absolutely despises this guy too and his poor gf thinks my mum loves him. Even my sister says she can't do more than a day and she's this girls best friend and can't hack the moron for longer than a few hours. So why are we accepting the spanner who's making everyone else's life a misery when it was fine before. Any advice?    "], ["Issue with Belgian regions", "6", "2", "2024-02-24T13:51:33.753000+0000", "https://www.reddit.com/r/Untappd/comments/1ayv062/issue_with_belgian_regions/", "I have encountered an issue with Belgian regions, where the same region will appear under different names. For example: Duvel Moortgat is based in â\u0080\u009cVlaams Gewestâ\u0080\u009d: https://untp.beer/r8x6A  But Belle-Vue is based in â\u0080\u009cRÃ©gion Flamandeâ\u0080\u009d: https://untp.beer/vQx35  And Brouwerij De Bie is based in â\u0080\u009cVlaanderenâ\u0080\u009d: https://untp.beer/Olb5p  All three names are referring to the same entity, Flanders. Same goes for Wallonia: Caulier (Wallonie): https://untp.beer/VrdAq La Chouffe (RÃ©gion wallonne): https://untp.beer/xOqX1  Is there anything that can be done to fix this? Maybe it's possible to base the division on Belgian provinces instead of the two entities?    "], ["John's issue with driving?", "39", "16", "2024-01-28T17:03:47.637000+0000", "https://www.reddit.com/r/DabblersAnonymous/comments/1ad7a40/johns_issue_with_driving/", "Has anyone definitively found out why John cannot drive?  Clearly, he needs a ride just about everywhere.  He also can't seem to go out for himself.  Vince seems to be his lifeline to beer and food.    "], ["My issue with famous KPOP commentary channel KOOKIELIT", "54", "165", "2023-12-20T01:48:26.300000+0000", "https://www.reddit.com/r/kpopthoughts/comments/18mipte/my_issue_with_famous_kpop_commentary_channel/", "When I say this channel is an easy way to derail yourself into a toxic community and gain yourself a bunch of misinformation, I'm not even exaggerating it. Take their video of B.I as an example: https://www.youtube.com/watch?v=vSWxkN50zfY Their overprotective nature for idols shows throughout the entire video. They said that B.I left IKON willingly and YG terminated his contract, 30 seconds later they say that YG abandoned B.I (I have no problem with B.I, I'm just surprised they made a quick contradiction seconds later) Example 2, Their video on PNATION They discussed D.Ark's controversy after posting pictures of beers, he later said that he was having dinner with a producer that was an adult and he didn't purchase or drink any of it. KOOKIELIT immediatly tries to make the story more interesting by leaving out D.Ark's response to the allegations and says that he left the company due to the allegations, funnily enough, it turns out that his contract ended and he left to pursue his own direction of music. I get pretty pissed when I see their videos because not only they fabricate the story, they post this video for thousands of people to see and it only causes more confusion and damage.    "], ["Issue with Co2 Regulator or Gauge?", "8", "1", "2024-01-07T14:31:28.955000+0000", "https://www.reddit.com/r/Homebrewing/comments/190tcxx/issue_with_co2_regulator_or_gauge/", "My last 2 kegged beers suddenly took weeks to carb. My usual maintenance pressure is 11lbs with 6' beer lines and I'm now having to raise it to 15-16lbs just to get decent pours with a 1/2\" head. I noticed to, when filling a growler for friends that when I reduce pressure to 1lb as I usually do, I get a tiny dribble and had to raise it to 4lbs for enough flow for a slow foam free fill. My tank pressure gauge shows a level in the green. So, I'm wondering if my 6-year old tap-rite regulator is failing or if it's simply the gauge sagging. What's your take?    "], ["Boiling issue with G30v3 and steam condenser", "8", "1", "2024-01-06T19:24:01.430000+0000", "https://www.reddit.com/r/grainfather/comments/1907ry5/boiling_issue_with_g30v3_and_steam_condenser/", "Hi community, Last week I was brewing a german wheat beer and used the first time a steam condenser with a glas lid so I could see inside. I felt like the boiling was too strong because there were huge bubbles rising  up to the top of the condenser. I tried to reduce the temperature by one degree but i felt like it stopped boiling so i had no choice and let it at 100 degC. After boiling i saw hat there was a lot of wort stickig everywhere above wort Level  and also lots of hops. I hope that the beer has enough bitterness because of that â\u0080\u009c lost\" ammount of hops. Do you have a hint how to improve boiling or how to setup the boiling Parameter?    "], ["Who else has this issue with the story?", "8", "0", "2024-04-27T07:28:16.855000+0000", "https://www.reddit.com/r/fo4/comments/1ce8p41/who_else_has_this_issue_with_the_story/", "false  Who else? I've played the story once and enjoyed the game.  However, I can never bring myself to enjoy it again because of how the story is set up. If I'm supposed to be finding my flesh and blood son, why should I be exploring and doing frivolous things? Why should I venture off and do tasks to get a beer brewing robot back online to hang out with me, for example? Such things are so ridiculous to me when I have this â\u0080\u009cmassive burdenâ\u0080\u009d of finding my son. It totally ruined the game for me. This is my opinion, I'm curious about yours.    "], ["Gut issues with NA beer?", "24", "4", "2024-02-04T07:07:03.106000+0000", "https://www.reddit.com/r/NABEER/comments/1aii013/gut_issues_with_na_beer/", "I started trying out NA beer last week for dry January, opened a new 6-pack today and had just one beer from it about 6 hours ago, and not to be graphic, but I've had 4-5 episodes of diarrhea over the last 3 hours. I kept it in the fridge constantly since buying it, and it doesn't expire until June, but I just realized looking back that I don't think it was in the refrigerated area when I bought it. I didn't know when I bought them that NA beers need more strict refrigeration because of the lack of alcohol... Has anyone else had this issue?    "], ["Stomach issues with very little beer", "0", "1", "2024-03-01T11:46:55.063000+0000", "https://www.reddit.com/r/alcohol/comments/1b3sdoh/stomach_issues_with_very_little_beer/", "Day before yesterday, I had 1.5 cans of beer and since then I've been feeling this burning sensation in my stomach. Just that much beer and my stomach is protesting I don't feel like having water or anything I've had antacid. also, I had two cig puffs that day but that was about it What's wrong with me ð\u009f\u0098¢ð\u009f\u0098¢    "], ["What could be causing my issues with certain beers?", "11", "0", "2023-07-04T01:32:26.679000+0000", "https://www.reddit.com/r/beer/comments/14q1589/what_could_be_causing_my_issues_with_certain_beers/", "Hello. I recently switched to Heineken light beer (3.3% alc/vol) and it has been fantastic. This beer does not cause me a hangovers, headaches or stomach problems , even after drinking too many. It tastes great and gives me a smooth buzz. Just yesterday I tried corona light (4.0% alc/vol) for a change, and it started giving me a stomach problem and I felt a hangover , headache and nausea creeping up. What could be causing those symptoms? Could be the higher alcohol content that does that? Could be the ingredients? Heineken light has been so good to me and I don't think I will drink anything else because I hate the feeling of sickness instead of enjoyment. I want to mention that I sip my beer and usually takes me 45 mins to 1h before next one. Any thoughts?    "], ["TIFU by thinking I was discussing tax issues with my friend on WhatsApp.", "81", "3357", "2024-04-11T11:37:28.104000+0000", "https://www.reddit.com/r/tifu/comments/1c1cugf/tifu_by_thinking_i_was_discussing_tax_issues_with/", "I do taxes for expats in Europe.  My friends parents both passed in the same year, and I'm helping him with the declaring his inheritance this year. He's one of my best friends, lives in another country (still has a US tax filing obligation) and doesn't know up from down when it comes to this stuff.  We chat on a regular basis, usually Saturday evenings around a few (too many) beers. Last Saturday evening, we spent a good amount of time shooting the shit and discussing his tax situation. On Monday, I get a message on WhatsApp from him (or so I thought).  It was a very casual message asking about renouncing his citizenship out of curiosity.  The message wasn't addressed like \"Hey Hobo, I have a question about x\", It was just a casual 'Also, just out of curiosity, what would it take to renounce my citizenship?'. I casually fielded his questions, he had a few more questions to the point where he asked if he could call me.  At the moment, I was on the toilet and needed to rush out the door.  So being one of my best friends I told him \"nah, can't right now mate.  Taking a massive shit and running out the door to the doctor's appointment'. We texted back and forth until he started asking me questions that have nothing to do with his actual situation.  I started scrolling up to re-read the discussion, and then realize...I'm not talking to my best friend....I'm talking to one of my biggest clients .  Investment banker.  Clears 1mm a year.  Pays a big fat check to me for doing his taxes every year. I never usually give out my personal number to clients.  Too many people that call 'quick questions' constantly blowing up my phone.  But this client is an exception, and is very effective at communicating.  Also, does not try to call me immediately after I send him a text (I fucking hate that).  His profile photo is nearly identical to my friend's (both taking a selfie in a tuxedo in the mirror, similar colored backgrounds, etc.).  The opening message from the client on Monday morning  'Also, just out of curiosity..' was him continuing a discussion we had from a week before. I'm so used to very frequently receiving WhatsApp messages with such a similar photo, I just defaulted to thinking it was my friend without even reading the name.   His questions were also at first very much aligned with what my friend and I were discussing on Saturday night. Responded, apologizing to the client, explaining the situation, I'm so embarrassed and to please excuse my familiar language.  I'm lucky this client is cool, young (late 40s), laid back, etc. as opposed to some of the other clients who could have taken offense to my slip up.  He said 'not a worry at all' and we continued discussing his tax matters. TL;DR TIFU by thinking I was talking to my friend on WhatsApp in a very casual manner, when I was actually talking to one of my largest clients.    "], ["Issues with keg transfer", "3", "2", "2024-01-20T14:41:20.968000+0000", "https://www.reddit.com/r/Homebrewing/comments/19bd6sv/issues_with_keg_transfer/", "I'm trying 5o transfer beer from the corny keg that I used to ferment the beer into my serving keg. I have a floating dip tube that originally came with a silicone tube, but I recently replaced it with vinyl (all the shop had). I have only transferred about 20% of the beer and am only getting foam then lots of CO2. Has anyone had similar issues, and if so, how can I improve the transfer back to full beer?    "], ["Anyone having issues with auto insurance rates?", "153", "127", "2023-08-06T21:05:15.391000+0000", "https://www.reddit.com/r/massachusetts/comments/15k0muf/anyone_having_issues_with_auto_insurance_rates/", "Geico renewal came and quoted me an extra $100 each month. I used a few of those auto insurance comparison tools and out of apparently 30 insurers checked with progressive comparison, they all declined. I tried putting my partner's info in and everything has been declined. On the Jerry app, it says all the insurance companies they checked that declined (19) say temporarily not accepting new customers in Massachusetts. When I call insurance companies, I'm getting quoted a ridiculous number, like over $1,000 for 6 months. I have a 2018 Kia optima so I know there's all the bullshit surrounding Kia right now, but I wouldn't expect to not be able to get a quote or reasonable quote from anyone. Is there something going on with auto insurance in Mass? Like what the hell is going on?    "], ["Issues with quantity", "8", "2", "2023-10-21T16:40:28.756000+0000", "https://www.reddit.com/r/alcoholicsanonymous/comments/17d6oh2/issues_with_quantity/", "Sorry if this I'd drug out just giving my situation. Thanks for taking the time to read. I know I have a problem and have had one for about 6 years now. It all started after my house flooded and I was at my lowest point mentally. So I started drinking a few beers in the evening. After about a month my few beers turned into a six pack a night. Fast forward about one year and I've dropped beer all together but I'm drinking Vodka. I started similar to the beer. Couple shots would help me relax at night. Those couple of shots turned into a half pint a night.  Fast-forward to now and I've cut back a good bit. I've figured a way to control myself but it doesn't always work. Typically instead of buying a bottle of alcohol, I'll just buy 2 or 3 of the single shot bottles and once they are gone, they are gone. So yesterday my wife's brother came by to wish me happy birthday and dropped me of a HALF Gallon of Titos Vodka. That's what I mean when I said it doesn't always work. Her brother left I drank way too much(about a pint). I have a very addictive personality and it's hard to control myself when I have a large quantity on hand. Can anyone give me any tips on how I can combat my addictive personality?    "], ["Having issues with my soundbar", "3", "0", "2024-06-23T08:34:26.018000+0000", "https://www.reddit.com/r/hometheater/comments/1dmhn76/having_issues_with_my_soundbar/", "So, I have a Vizio soundbar connected to my Roku tv via an hdmi cable. I'm having issues with dialogue. It seems a little too high pitched and there's a distorted sound that happens when people are talking. The best way I can describe the distortion is that it kind of sounds like wind chimes and it's most noticeable when people say words ending with S like â\u0080\u009ctheseâ\u0080\u009d or â\u0080\u009cbeersâ\u0080\u009d. Just wondering what could be causing it. Thanks in advance.    "], ["does anyone else with autism have issues with faces when drinking?", "2", "2", "2024-05-13T02:56:28.644000+0000", "https://www.reddit.com/r/autism/comments/1cqp4kj/does_anyone_else_with_autism_have_issues_with/", "Hi there. Diagnosed Autistic, additionally have some psychotic tendencies. I drink occaisonally, and when I have 2-3 beers or the equivalent of liquor, suddenly faces appear very peculiar and I have trouble looking at them because they are unpleasant to look at. Not necessarily disturbing or upsetting, but they simply look \"off\". the best way to describe it is the melted faces that AI images made in 2021 before they got particularly advanced. I'll watch a tiktok after a few beers and suddenly I cant look at the person making it, their face seems warped/strange, or just not \"real\". its not incapacitating or anything but I still wonder if autism has anything to do with it, IE the reflex of hating eye contact/trouble with looking at people in the face.    "], ["Anyone else having issues with biofine not doing its job?", "21", "11", "2024-02-16T12:23:39.567000+0000", "https://www.reddit.com/r/TheBrewery/comments/1as7bor/anyone_else_having_issues_with_biofine_not_doing/", "I've never had an issue but the past few months I feel like it's just not working like it used to. My beers with cali would drop clear in 48-72 hours all the time. Haven't changed anything and now it seems like it's just not working.    "], ["AITAH for having issues with my boyfriendâ\u0080\u0099s drinking?", "6", "3", "2024-05-06T15:55:32.190000+0000", "https://www.reddit.com/r/AITAH/comments/1clmilr/aitah_for_having_issues_with_my_boyfriends/", "I (25F) have issues with my boyfriends (25M) drinking habits. My bf and I have been together for over 4 years, and although his drinking habits have gotten a bit better, they are still the root of almost all of our issues. He gets mean when he's really drunk, and although it doesn't happen much anymore, I think I have like PTSD from it, so even a sip of alcohol puts me on edge. I'll go into a slight timeline of how things are. When we first started dating, his drinking was a big issue. He was 20 then, but he would get blacked out at his friends house often and act like an asshole. We had a lot of fights, broke up twice, etc. He came to my sorority date party and got black out drunk and we were asked to leave. After while, he moved into a house with his friends. The drinking was a lot more consistent being 21 and living with 3 other guys who also liked to drink a lot. Same thing, he'd get really drunk and then I'm left to deal with him, his puke, and his pee if he was black out. We moved in together about 3 years ago, and it's been a constant fight. There's been a lot of the above in the beginning leading to keeping no alcohol in the house and me watching how much he drinks when we go out. Over the last year, it's been a lot better in the sense of quantity drinking. But almost anytime we go out with his friends, he drinks too much and I have to stop him from drinking, for my own personal safety when we get home. Yesterday, we were out with friends almost all day at their pool. He drank 2 drinks with lunch (Cinco De Mayo) and then proceeded to have 16 beers in 6 hours. When I suggested he take a break and drink water, he drinks water and immediately grabs another beer. Then I tell him he needs to be done because he's slurring his words and slightly stumbling around, and he agrees with me and says sounds good. Then I see him going for another beer, I go and grab it and pour it out. He stops drinking after that. On the way home, we got into a fight about why he continued to try and drink when he says he's done. Then it became a huge thing that brought up old issues and stuff. So I guess what I'm trying to figure out is if his drinking has improved enough for me to stay. He's been black out maybe 2 or 3 times this past year (12 months, not 2024) but still drinks slightly heavy on the weekends. He would drink more if I wasn't there watching him or telling him more. I'm not sure I want to deal with this the rest of my life and start a family with this guy. He's been saying we're getting engaged soon, and all I can think about is I'll have to watch him at our wedding too. Note: when he doesn't drink, he's great. He doesn't drink during the week besides an occasional drink with dinner if we eat out. It's the weekend that's an issue, so much where I begin to dread the weekend because I know I'll have to go out with him and his friends (who are also my friends we had the same friend group before dating) to watch him. I'm much more of a home body and would love to spend weekends relaxing. What are your thoughts?    "], ["Having trouble with sticking to low ABV beers (but it really helps when I do)", "5", "13", "2024-01-16T03:20:15.610000+0000", "https://www.reddit.com/r/Alcoholism_Medication/comments/197sl4n/having_trouble_with_sticking_to_low_abv_beers_but/", "I've been 100% compliant with TSM since the beginning of 2022.  But... I've only been on 25mg, since I some struggles with getting the pills. I have now found a steady source and upped my dose to 50mg. I also started drinking lover ABV beer and are using a smaller glass.  This has resulted in me drinking closer to 3 drinks a night, instead of 12-15 4 times a week. I've been drinking almost every night, but my weekly average is still a lot less.  The problem is that I sometimes just want to get drunk. Even if I don't get the buzz, I just want to drink and get drunk.  If I start with a low ABV beer, I am usually good, but if start with a stronger one (typically around 7%) it's hard for me to stop and I just keep on drinking.  When I drink my 5% beers, it kinda feels like a substitute for the real thing. Like I am not getting the real deal. It's a little hard to explain, but some of you probably know what I mean.  Obviously, the next day I am happy that I didn't get drunk, because I have more energy and can actually do stuff, but still., something in me draws me towards my old habits.  Is it just a matter of time and powering through it and building new habits or is there something else I can do?    "], ["Having trouble with weight loss...", "11", "4", "2024-05-17T23:48:46.078000+0000", "https://www.reddit.com/r/WeightLossAdvice/comments/1cujvhu/having_trouble_with_weight_loss/", "(27M) I've found a way to put on 10lbs even though I work 6am-3pm at a restaurant where I generally walk a minimum of 12k steps, lift heavy stuff, eat a healthy meal with protein and veggies, and don't snack on much other than fresh fruit or some vegetable at home (grape leaves with quinoa and chickpeas have been my obsession lately). The main unhealthy thing I eat/drink is a couple of beers before bed most nights and even that is usually Truly, Simply, etc... Is it the beer, something I have to see a pro to figure out, or am I just missing something? I don't do much actual cardio, so that's probably it, right?    "], ["Trouble with dissolved oxygen and mobile canner", "16", "18", "2023-08-25T15:38:22.077000+0000", "https://www.reddit.com/r/TheBrewery/comments/1612oj9/trouble_with_dissolved_oxygen_and_mobile_canner/", "Over the last 12 months we've been using a mobile canner in our brewery that is new to our area but not new to the mobile canning business. We're a relatively young brewery (but I've personally been brewing professionally for 9 years) that has been serving draft only through our taproom up until this point. We've seen a pretty steep rise in sales through self distro with these cans but we've been getting some pretty inconsistent results as far as dissolved oxygen in the canned product goes. We don't have a D.O. meter of our own but our mobile canner does. They are able to take a reading of the beer in the brite tank before we start filling and all of our brands are consistently starting below 10ppb in the brite. They are running a 5 head Wild Goose and they are consistently checking seams throughout the run so I don't see any issue there and they are regularly checking cans to get D.O readings on each of the five fill heads. The issue we're having is often with the first few D.O. checks they're telling me that they are sometimes hitting around 100ppb but then they are able to make some adjustments after a few cases and get the readings down anywhere between 35-60ppb on all fill heads. Unfortunately, we're somewhat regularly seeing a pretty fast decline in the beer stability, particularly in our hop forward beers, a lot faster than I would expect. By week 2 or 3 you'd think you were drinking a 5 or 6 week old beer, especially when compared to that same beer served on draft in our tap room. So first, I'm wondering what kind of D.O. numbers are you all deeming as acceptable in your packaged product? The last place I worked at we were typically getting numbers around 40ppb in our canned beer and the shelf stability was pretty solid. Are the numbers we're getting numbers that you would be fine with? Second, is there something else that maybe I'm missing on my end? We're extremely diligent with our processes in regards to purging tanks and hoses when we transfer, making sure there's a solid blanket of CO2 when we dry hop, etc. I see the numbers that they're getting and I just wouldn't expect such a fast drop off in the canned product with those numbers, but maybe they are too high? Hope that wasn't too much of a ramble and made sense. Any advice on how to move forward would be appreciated.    "], ["Please help, trouble with neighbour ", "28", "32", "2024-03-29T14:20:57.740000+0000", "https://www.reddit.com/r/AskAGerman/comments/1bqqgr6/please_help_trouble_with_neighbour/", "My boyfriend and I moved over from the UK to the Bavarian region 4 months ago. We both work at the same company here for context. We moved into a new Airbnb LAST NIGHT as we are still waiting for a residency permit. The landlord of this buliding let us know that he already has issues with the neighbour below us, though he didn't elaborate. We have a terrace with an ashtray.. we have smoked outside a couple of times, using this ashtray. About ten minutes ago, someone began knocking very loudly and began to continuously sound the buzzer. My boyfriend answered the door, to be met with her shouting as she emptied the contents of her dustpan into our apartment, on the floor. She kept saying â\u0080\u0098ash', and with this fell out a bottle lid from a beer in which neither of us have ever drank. The only way ash would have entered her property is if it flew out from the ashtray, yet no ash was emptied from her dustpan onto the floor. I did not witness this interaction, but overheard the loud knocking. Even if I did answer, I still do not know enough German to communicate with her. What would the appropriate way to handle things if interactions such as these continue? We have been here for not even 24 hoursâ\u0080¦ please advise.    "], ["Trouble with consistency", "1", "1", "2024-01-30T23:00:25.747000+0000", "https://www.reddit.com/r/Meditation/comments/1af26r1/trouble_with_consistency/", "I find that I gain a lot of benefits when I am active in my meditation practice- but I also am horrible with maintaining any positive things in my life. I live in an area where a lot of the concepts I try to follow or believe it are not promoted or established. I really wish I had more of a community to connect with but I feel kinda silly and alone sometimes and let it get the better of me. I will go for weeks at a time meditating twice a day almost and praying, to going to nothing and feeling guilty and ashamed. I feel like I don't quite have a safe space to meditate in either due to some living environments. How do you meditate and stay consistent when there are constant distractions and outside intrusions etc? I start to beat myself up and fall into old ways and then before I know it I'm so distant from my mind it makes me sad. What techniques or strategies would you suggest to manage a more effective schedule or creating of a safe space to be able to separate myself from the problems in life? Also, I tend to drink a beer after work and I let that also influence my failure to meditate thinking negatively of myself and not letting myself relax or try because I've had a drink and I feel like I fail myself and my practice. Is one beer a day bad?    "], ["Trouble with getting f2 fizzy enough", "25", "2", "2024-01-16T23:39:49.416000+0000", "https://www.reddit.com/r/Kombucha/comments/198hpbr/trouble_with_getting_f2_fizzy_enough/", "Hello, I am fairly new to making Kombucha and I am somewhat struggling to get my Kombucha fizzy enough in the second fermentation. I am using black tea, I donÂ´t know which mix, since I got it from a Turkish supermarket and I can't read the label. The first fermentation works great and I fill it into beer 1l bottles with swing tops (rated to 6bar or 87psi). When I add lemon and mint (about half a lemon without peel, sliced and 1-2 stems of mint, fresh) after about 4 days it comes back really fizzy. The last batch almost blew my eardrums out when I opened it lol. But when I don't add anything and just leave the Kombucha in the bottle on its own it comes out relatively flat, even after 5 days. With the lemon and mint I'm not adding any sugar, so what is it that's making it so much more fizzy? I'm pretty sure that it is fermenting, because the taste is changing and a scoby is forming in the bottle. If any of you know what's going on, and how I can fix that, it would be greatly appreciated!    "], ["Trouble with Hannes rally achievement", "9", "6", "2023-11-28T23:07:01.464000+0000", "https://www.reddit.com/r/MySummerCar/comments/1869ss6/trouble_with_hannes_rally_achievement/", "I walked the rally on Saturday, only stepping off to drink beer I set up and avoid rally cars. It said FINISH when I crossed the line but didn't get the achievement. There's also no time sheet anywhere. I walked the Junior rally, it that makes a difference. Edit: I did not hold anything in my hands at all Do you have to walk both days?    "], ["Having trouble with greens", "29", "0", "2024-02-20T18:04:43.653000+0000", "https://www.reddit.com/r/ski/comments/1avo9pp/having_trouble_with_greens/", "I've been skiing twice in my life. I have taken some basic lessons on my first day. I really love the concept of winter sports. When I was younger I used to watch the Olympics just to see the skiing, snowboarding, ice skating, etc. I didn't grow up doing any of these sports so I am now starting in my late twenties. My boyfriend is a crazy good skier and all of our friends ride as well. I really want to be able to at least tag along on big trips. I just think the whole concept and the culture is so sick. Having a beer on the slopes and then bombing down a hill with all my best friendsâ\u0080¦ but I tried to go down my first green the other day and I ate shit the entire time. It wasn't too bad in the first half and then I had a pretty big tumble and cried a bit, had to take my time getting back up. After that it just got so much worse. I made it down the green but it took me a really long time and I just kept crashing and getting hurt. I limped my way back to the car and found out I pulled a hamstring maybe even tore it. Now I can't even ski again for probably 3+ weeks or longer and I'm just feeling so discouraged. I still want to get back out there but I'm afraid I'm going to get a worse injury, or maybe I'm just not cut out for something like this? I was so excited I bought my own skis already and got some great gear off of Facebook marketplace and all of my friends have been so supportive. What do I do?? Just do bunny slopes for the entire season? Tldr: really want to learn how to ski in my late twenties, been twice but ate shit all the way down my first green and pulled a hammy. Anyone had similar experiences? Am I hopeless? ð\u009f\u0098­    "], ["Struggling with alcohol 0% beers", "3", "2", "2024-05-31T09:06:09.407000+0000", "https://www.reddit.com/r/alcohol/comments/1d4r87h/struggling_with_alcohol_0_beers/", "Hi, am 54 in September, been drinking since I was 15 enjoyed a few guinness or other things plus few whiskeys. But last year or two if I have more than 1 ordinary beer at night  I feel awful next morning, diahorrea anxiety, nausea, poor sleep. Thinking of going for a few % beers now at night. Tried a few before. Heineken and carlsberg are fine. Seen peroni % in my local store. Just like to enjoy a few cold beers maybe with a film and feel fine next day. Could have maybe one ordinary beer or guinness then go %. Fed up feeling like crap next day!    "], ["Struggling with foam, please help!", "18", "1", "2023-09-25T18:03:58.722000+0000", "https://www.reddit.com/r/kegerators/comments/16rz8kt/struggling_with_foam_please_help/", "I just finished my first 2 kegs and thought I had all of my kinks worked out.  I had a hefeweizen and Sam's Summer ale and had consistently good pours at 36 degrees and 11 psi.   I thoroughly cleaned the system between swapping kegs.  I now have a lite pilsner and dark lager on tap and get foam every time.  I noticed breakout on both beers, but especially the pilsner.  I've taken the following steps to try and correct the issue, is there anything else I should do? - decreased temp to 34. (beer pours between 34-35) - purged co2 and set to 10 psi, noticed lots of breakout. - incrementally increased co2 pressure up to 16 psi.  This decreased breakout, but the highpoint of the beer line and where the beer line meets the shank will collect bubbles. - replaced my 5' beer lines with 10' beer lines. (slowed the pour but still all foam.) - checked all connections, seals, o rings, ect.  I'm totally at a loss here, I appreciate any advice/expertise you could offer.     "], ["32 and struggling with addiction", "17", "5", "2024-06-25T08:51:21.853000+0000", "https://www.reddit.com/r/alcoholicsanonymous/comments/1do1cf8/32_and_struggling_with_addiction/", "32(m) and struggling daily to not drink. I've always used alcohol as a stress andnl depression relief. At this point I've normalized alcohol in every aspect of after work life, besides driving kids to sports. That said I'm not a hard liquor drinker I prefer beer. I'll drink 20 to 30 a night and wake up like I'm not wrong for doing it. Recently I've made 2 weeks, but let it in again. Thinking it's ok it's just the weekend and not drinking my typical amount. As you'd think it was a couple to unwind but then quickly turned into 18 then more. I can't talk to many people in my circle cause they are all the same in drinking. I feel so much better sober but I give in to stress and drink again. Not sure why I posted here, perhaps just to air put idk but thanks if you read this far.    "], ["Here for you if you're silently struggling with substance abuse ", "25", "112", "2024-05-23T12:51:39.957000+0000", "https://www.reddit.com/r/Wildfire/comments/1cys0sg/here_for_you_if_youre_silently_struggling_with/", "I've been outspoken on this sub before about being a recovering alcoholic in this line of work. I'm 2 years and 6 months sober at this point and some things have come up at work that frustrate me beyond imagination. When I got vulnerable and wore my heart on my sleeve, my buddies treated it like I said nothing at all and talk about their favorite beers, drinking stories, how they're getting shit-faced this weekend, etc. It makes me red in the face and I know this is my battle to fight, but it shows me how much they actually respect my recovery. (I understand: people don't actually think about you as much as you think they do, but in this job we all know each other on deeper levels, so I had some hope that being vulnerable would speak to them). This whole situation reminded me that I must not be alone and that there must be other firefighters out there silently suffering too. Whether you are trying to recover from alcohol, nicotine, whatever, I'm here for you. I want to turn my frustration into service, so if anyone is having a hard time, please message me. I will be a listening ear, I'll give you advice only if you want it, and I'll stand with you in solidarity. One day at a time. You never know who is fighting a massive battle quietly.    "], ["Struggling with mould", "9", "3", "2023-10-19T14:10:26.820000+0000", "https://www.reddit.com/r/PerfectDraft/comments/17bk2yr/struggling_with_mould/", "Is anyone struggling with mould on their machine? - had a PD for 5+ years, but the last few months, I seem to be having a real issue with mould, in the spout as well as where the beer handle goes into the machine. Every time I change kegs, I clean/wash everything (the silver spout, the keg attachment, etc) - but last night I happened to look inside the silver spout and found a large amount of mould, which had also spread to cover the rubber tube of the keg connector, so all the beer flowing out was going through the mould.  I'd already pulled a pint at that point, so it went down the sink I was a bit ill this weekend with stomach issues, and that was when I last had a drink from the keg, so I'm wondering if that was related....     "], ["Iâ\u0080\u0099m struggling with my Why", "11", "21", "2024-05-11T12:42:49.236000+0000", "https://www.reddit.com/r/stopdrinking/comments/1cpgo5i/im_struggling_with_my_why/", "I've been sober now for 255 days. I did it for health reasons. I thought my body was dying. I felt like I was dying. Recently, I went to the doctor, finally, and got comprehensive blood work and a colonoscopy.  I'm fine. Better than fine actually. My colon is â\u0080\u0098perfect' (which is a weird thing for a GI to say) and my blood work, specifically liver enzymes are absolutely normal and show good function. My cravings had all but disappeared but now they're back. With a vengeance.  I quit so I could live and it turns out I probably wasn't dying at all in the first place and my first urge is to celebrate with a drink. I'm playing the tape through, but again, the cravings are back. I'm currently on vacation in South Carolina and I just KNOW the beach would be better with beer. I'm not going to drink, but this sort of thinking is how I fell down the rabbit hole in the first place.    "], ["Ex fiancee [32F] of 8+ years broke up with me [32M] via text message ~3 years ago, and disappeared. Now is trying to rejoin our circle of mutual friends, and i am struggling with it extremely hard.", "613", "6270", "2023-12-08T05:01:29.578000+0000", "https://www.reddit.com/r/BestofRedditorUpdates/comments/18df8e6/ex_fiancee_32f_of_8_years_broke_up_with_me_32m/", "I am not The OOP, OOP is  u/ThrowRA-192   Ex fiancee [32F] of 8+ years broke up with me [32M] via text message ~3 years ago, and disappeared. Now is trying to rejoin our circle of mutual friends, and i am struggling with it extremely hard.   Originally posted to  r/relationship_advice   TRIGGER WARNING:  emotional abuse and manipulation, abandonment, severe depression   Original Post Â Apr 6, 2020  Me and a girl who i will just call Jessica, were a couple for 8+ years and engaged for 3+ of them. I met her through a mutual friend in my group of friends. We ended up hitting it off pretty quickly as our dorky/nerdy hobbies aligned really well. I personally fully expected to marry this person, and spend the rest of my life with her. In early 2016 her job offered her an amazing opportunity to temporarily work 4 months in the companies satellite office New Zealand (she was an Environmental Engineer), to temporarily manage and lead a new team. It was very sudden, and i was not really happy with the idea, but she really wanted this chance and opportunity. So off she went. I flew out to visit her after ~2 months, only when i arrived at the airport i got a text message from her. The message was short and more or less consisted of \"she was sorry but after thinking it through, she thinks it would be best if we went our separate ways from now on\". She then completely blocked me on almost every single form of social media, cell phone, etc. I was confused, devastated and became an absolute wreck. I remember completely breaking down in Auckland Airport. I spent the next 4 days living at a motel basically trying to get into contact with her in any shape or form. She had apparently blocked everyone of our circle of friends. Even her close friends from our circle of friends were shocked, confused and basically lost. Even her parents were extremely confused when i called them, her dad who i was extremely close with (we coached pee-wee hockey together, and played a lot of beer league for hockey together), refused to believe it at first. I was a mess for a solid year, but my close circle of friends managed to drag me out of my hellish hole along with some therapy. Her best friends became close friends to me. About a year ago, she invited some of her old close friends to her wedding among a bunch of other people from our group. No one went, and i quickly found out which hurt me even more. Over a year ago i started dating one of her old friends, as me and her had gotten close over the last 2 years or so. She felt quite hurt when Jessica basically ghosted her. Unfortunately there was some awkwardness because she fully knew i was not fully over my ex, but she has been a supportive and amazing person and i am extremely happy with her. Life was going great for me. Then in December Jessica apparently moved back home after divorcing a few months after getting married. I don't know much and i don't want to know. However she is making this hugely concentrated effort to reconnect with people in our friend group, which is resulting in some very conflicted feelings for some people. Last week i found out that Jessica and some of my friends have started playing D&D (via roll20), which frankly made me feel like shit. Part of my just wants to move on from this but i am struggling hard. While my SO has been extremely supportive, i just feel numb and dont really know what to do. Today Jessica sent me a long facebook message basically apologizing to me for what she did, and asked to be friends. I didn't respond and blocked her. I told my SO, and i just felt like i was going to break down. Right now my SO is saying she is worried about me, and keeps asking me what do i want to do. My SO confessed that Jessica had sent her a similar message a few weeks ago, and she told her off. I don't know what i am supposed to do, i can't order my friends to not be friends with her. I just feel like a mess and i am struggling with this as i feel like i am teenager dealing with stupid drama again. TLDR; EX Fiancee of 8+ years dumped me via text message after i flew across the world to see her. Now she is trying to reconnect with everyone and i am struggling very hard with this. What should i do?  Update Â Apr 14, 2020  Thank you all for your wonderful support, anyways i have tried my best to follow everyone's advice. I sat down with my SO and explained to her how awesome she, is and explained how i don't have any romantic feelings for my ex at all, all i really have is a lot of painful and hurtful memories. I also asked her what should i do, and she suggested i respond and tell her off, to get closure of some degree. So i did that, i told her:   I don't want to be friends anymore   I want nothing to do with her   I explained how badly she hurt me   I am happy right now and i just want her to leave me and my friends alone   She took it well, apologized one more time and then basically said \"goodbye forever\". That was honestly a huge load off my shoulders. I then went and told our group of friends, and explained how much she hurt me, and how i would rather we not start adding her to our gaming sessions etc. Unfortunately i ended up losing a bunch of friends and have irreparably caused a lot of damage to our friends group. Many of them sided with me, but a bunch of them took the stance of \"You have no right to tell me who i can be friends with\" among other complaints. A few people were very angry, and told me i am being a terrible person as my EX is trying to repent, and deal with pain of her divorce. It was confusing and frankly just made everything more of a mess. In the end, a bunch of us ended up getting booted out of our FF14 free company, which then my SO ended up kicking out of bunch of people from our discord. I don't really know what is going to happen.Â  But it really hurt to see some people i have known for years, and even helped me get through it the first time suddenly take her side. TLDR; Told my ex off, explained to people in our group of friends how she hurt me, it ended up breaking our circle of friends.  THIS IS A REPOST SUB - I AM NOT THE OOP     "], ["Struggling with heterosexuality through transgender masturbation/sex", "32", "0", "2024-05-24T21:44:12.834000+0000", "https://www.reddit.com/r/helpme/comments/1czw6pi/struggling_with_heterosexuality_through/", "Please help! I'm 100% straight guy, I don't even like to watch dudes in porn videos, BUT it just so happens that a while ago I tried experimenting with unknown territory, started paying more attention to transgender prostitutes on the street, then it progressed to one time getting a bj from one of them, THEN one time in one of those ventures the transgender really insisted on riding me on a motel - at the time I thought wrong of it but did it anyway- â\u0080¦ since then I became discussed with myself (with all due respect, I don't mean to offend anyone) Nonetheless, I kinda got into it and procured one more time a trans for sexâ\u0080¦ The things is, masturbating to transgenders became more and more frequent and EVERY SINGLE TIME I felt even more discussed for liking â\u0080\u009cwomen with penisâ\u0080\u009d. The way I was educated throughout my life I always made fun of those types of things, and PLEASE don't get me wrong I respect all of you it's just that I cannot keep on â\u0080\u009cliking itâ\u0080\u009d cause whenever I finish masturbating or having sex with trans I feel sick to my stomach and also ashamed of myselfâ\u0080¦ I WOULD BEG any of you FOR ANY ADVICE on how to stop â\u0080\u009cliking itâ\u0080\u009d and doing stuff I'm doing because like I said, I COULD NOT wrap my head around making out with a dude let alone having sex with one! The trans I like most are the ones more physically like a woman, more feminine, but there's something about fucking that woman that has a dick that turns me on so muchâ\u0080¦ Please! Any advice would be gold for me! I MUST STOP THIS HABIT **Also, I apologize if any of this sounded offensive, that was not the intention at all!!    "], ["Convert occasionally struggling with alcohol", "4", "2", "2023-12-07T01:38:49.740000+0000", "https://www.reddit.com/r/progressive_islam/comments/18ck5yg/convert_occasionally_struggling_with_alcohol/", "If a convert drinks 1 beer(does not feel intoxicated), how would long would he/she have to wait to do salah?    "], ["Struggling with appetite adjustment", "3", "1", "2023-06-29T00:57:03.256000+0000", "https://www.reddit.com/r/Ozempic/comments/14lqng2/struggling_with_appetite_adjustment/", "Hi everyone, love seeing the success stories! I have sort of a happy rant/ complaint about the rapid curb of my appetite and how fast I get full. Im 3 weeks on 0.25 and 9lbs down. I'm currently travelling in a city I've never been to that's known for their food and I keep over ordering!! Its day 3 of my trip and I thought I learned my lesson. I had a yogurt and and a small sandwich for breakfast knowing that would keep me full for most of the day. I had a piece of fruit in the late afternoon and was excited for dinner as I've been looking forward to this world class chicken sandwich the whole week. It came with 2 heavy sides and a beer and I truly struggled. I managed to get most of the sandwich and my fries down but had to abandon the mac & cheese and my beer. Last night I didn't even make a dent in my pad Thai. Before OZ I could have easily crushed that and still had room for more beer! I'm not upset about this change, it's obviously for the better but it's definitely an adjustment I'm ill prepared for.    "], ["Michigan Cider/beer - Help needed", "143", "73", "2023-07-14T10:18:49.020000+0000", "https://www.reddit.com/r/Michigan/comments/14zckss/michigan_ciderbeer_help_needed/", "I'm an Oregonian who has a friend online who turned 21 yesterday and celebrated it by his step-dad giving him HEINEKIN. Followed up by butterscotch schnapps. SURELY you guys have some good as fuck ciders I can paypal him for a case of. Butterscotch schanapps and heinekin is the saddest way I can think of to celebrate a 21st short of a stroke. What are some local beer or cider brands I can recommend him.    "], ["ISO Schlitz Beer, help needed ", "9", "5", "2024-04-08T16:42:14.296000+0000", "https://www.reddit.com/r/beer/comments/1bz2o1w/iso_schlitz_beer_help_needed/", "Located in Mississippi, trying to find some for aging stepfather and me to try, he used to love it back in the day. Website is half functional and the beer locater is of no use. Any websites that ship? Or any leads on it in the southeast area    "], ["Help Needed with Beer Olympics Bracket", "0", "3", "2024-05-08T04:16:54.904000+0000", "https://www.reddit.com/r/DrinkingGames/comments/1cmvrbi/help_needed_with_beer_olympics_bracket/", "Hey everyone, I'm organizing a beer Olympics event and could use some help with creating a tournament bracket. Here's what I'm trying to do:  Context:    I'm organizing a beer Olympics event with five teams, each consisting of four members.   Each team needs to be divided into two pairs for certain games like beer pong.   I want to ensure that every pair from each team competes against every pair from the other teams at least once.   The tournament should be structured to allow continuous gameplay to keep the event lively and engaging.    Challenges:    I'm struggling to understand how to create a tournament bracket for beer pong that accommodates the unique format   I've looked into round-robin formats, but I'm having trouble visualizing how it would work with my setup.   I want the bracket to be easy to understand and navigate for both participants and spectators.    Request:    I'm seeking advice, suggestions, or even a visual representation (diagram, chart, etc.) of how to organize the tournament bracket effectively.   Any tips, templates, or online tools that could simplify the process would be greatly appreciated.    Additional Information:    I'm open to different formats or structures as long as they achieve the goal of ensuring fair competition and maximizing participant enjoyment.   Thank you in advance for any assistance or guidance you can provide!    "], ["Help Needed", "8", "6", "2024-06-07T18:48:16.462000+0000", "https://www.reddit.com/r/NABEER/comments/1daihsr/help_needed/", "Want to get my dad a cool NA beer as he's been a big fan these past few years but I have 0 knowledge on beer in general. He likes a lot of flavour and kentish beers, any recommendations?    "], ["Help needed for the Freezing technique", "6", "2", "2024-03-22T13:36:54.078000+0000", "https://www.reddit.com/r/brewing/comments/1bkzf52/help_needed_for_the_freezing_technique/", "Hello guys im relatively new to brewing beer, I wanted to increase the ABV in my beer and heard of the freezing technique I am ordering high quality yeast that can handle a higher alcohol percentage but, my question is how do I isolate the beer from water not through distilling but through freezing. The ideal ABV for my beer would be something like 12%-20%    "], ["Urgent help needed", "4", "5", "2024-04-29T18:39:36.602000+0000", "https://www.reddit.com/r/randomactsofCA/comments/1cg6r2z/urgent_help_needed/", "So I ended up in the ER with no idea how I got there. Apparently I had a seizure while walking to work. I've not had any food in like 4/5 days I don't remember, just enough for booze. The money for booze has ran out, not even enough left for a beer, so 10â\u0082¬/11$ would be much appreciated. This is my last choice. Will pay it back on the 6th or pay it forward Just don't wanna die Paypal: @Blekte    "], ["Help needed, Iâ\u0080\u0099m going to Venice and need advice o places to eat", "18", "1", "2024-05-18T17:24:32.256000+0000", "https://www.reddit.com/r/2westerneurope4u/comments/1cv2cov/help_needed_im_going_to_venice_and_need_advice_o/", "My Girlfriend has booked a long weekend in Venice and I'm not a fan of pasta or pizza so it's looking like I'm done for, dose anyone know or can recommend a couple of chip shops or Irish themed bars I can go to to get some decent food and maybe some beer other then peroni?    "], ["Help needed is this too much", "6", "2", "2023-09-27T01:04:48.708000+0000", "https://www.reddit.com/r/alcohol/comments/16t66ay/help_needed_is_this_too_much/", "Hello today I got paid and I bought a bit of alcohol I am an alcoholic but this time I think I bought to much This is what I bought I have 8L of vodka 2L of scotch whisky 1L of Jim beam 8 bottles of Leffe blond Belgium beer 330ml 2 750ml leffe blond Belgium beer And 45 440ml coors beer coming Thursday    "], ["Help needed", "5", "0", "2024-02-17T10:58:41.784000+0000", "https://www.reddit.com/r/sydney/comments/1aszew9/help_needed/", "Is there anyone who knows a hostel in sydney where there is a parking spot? We will be in sydney In a few days and we are looking into a hostel for the night (AIRBNB is too expensive). If anyone can help us I would appreciate that a lot and I owe you a beer!    "], ["Help needed.", "20", "8", "2024-06-01T19:24:49.284000+0000", "https://www.reddit.com/r/ITManagers/comments/1d5uo92/help_needed/", "Hey everyone, I need some advice. I've been working like crazy last 2 months as there's a huge and very complicated project at my main site. Now, it's been going fine and smooth but this Friday I've just caught myself sitting at my desk seriously unable to do anything. I just sat at my desk and couldn't even bring myself to make a simple presentation, make a call or anything. Nobody really needed me, because read-only end-of-month friday, but I'm kinda derailed as this has never happened to me ever tbh in my work life and I don't know what to do. (I'm quite young for a manager position) Imposter \"syndrome\" kicked in and I'm completely out of it, like in a limbo. Any advice would be appreciated.    "], ["Brewed our own beer for our wedding. Need help naming it", "536", "252", "2023-11-11T16:01:33.761000+0000", "https://www.reddit.com/r/CasualUK/comments/17sxfek/brewed_our_own_beer_for_our_wedding_need_help/", "In a couple of weeks me and my partner are getting married and  having our wedding reception in a brewery. We have brewed our own beer to have on one of the lines. All we need now is an appropriate name. The best we have currently come up with so far is \"four weddings and a pale ale\"... As you can see we need your help please Reddit!    "], ["SOS: Need help structuring Beer Olympics", "6", "3", "2024-06-14T14:19:33.708000+0000", "https://www.reddit.com/r/DrinkingGames/comments/1dfrz27/sos_need_help_structuring_beer_olympics/", "Currently have 5 teams of 2. Games (so far) are Axe Throwing, Beer Pong, Cornhole, Pickleball, Lawn Darts, Spike Ball.    "], ["Need help remembering name of a beer", "6", "3", "2024-06-27T16:35:51.659000+0000", "https://www.reddit.com/r/beer/comments/1dpvntu/need_help_remembering_name_of_a_beer/", "They sold it at the super markets and bars in Puerto Pensasco, Mexico. It was a plain white can with a red (possibly diamond shaped) label. A light beer in a skinny can. I think the name it may have started with a A. It was called something bier, so German I think. I have looked up all of these key terms and I can't find it.    "], ["Need help finding a beer from TX", "24", "2", "2024-02-19T06:19:23.046000+0000", "https://www.reddit.com/r/beer/comments/1auggi7/need_help_finding_a_beer_from_tx/", "A friend of mine moved to Nebraska a year or so ago. He lived in San Antonio before, and he was telling me about his favorite beer from a brewery there. All I can remember is it was called Electric Jellyfish. We're having a party in April, and I want to try and order some for him. Any help would be apricated.    "], ["Need help finding a beer", "4", "1", "2024-03-21T03:44:33.020000+0000", "https://www.reddit.com/r/bloomington/comments/1bjxc9p/need_help_finding_a_beer/", "So I have been trying to track down some Ye Old Regulator lager for a while now. Been a year or so since I've had one. Starting to thing it's either not a thing anymore. If anyone know more than I do or have seen it recently I'd love to know.    "], ["need help finding a beer [Utah County]", "9", "3", "2024-01-31T00:56:19.010000+0000", "https://www.reddit.com/r/Utah/comments/1af4tch/need_help_finding_a_beer_utah_county/", "Friends of mine got me a 6-pack of Laughing Dog Huckleberry when they went up to Yellowstone. Needless to say I couldn't help myself and want to get my hands on some moreâ\u0080\u0094without having to drive up to Idaho. Their site says they distribute to basically every store that can carry <5% beers in Salt Lake and Utah counties. As the saying goes, \"ain't nobody got time for that\". I'm wondering if anyone has seen it, specifically in Utah county? I'd be very appreciative, lol.    "], ["Need help coming up with a beer list. Help", "18", "0", "2024-01-05T17:47:08.798000+0000", "https://www.reddit.com/r/beer/comments/18zcsav/need_help_coming_up_with_a_beer_list_help/", "Need to come up with some beer for an uncoming tradeshow. A short list but something that its all the favorites. Most of the clients will be from Texas if that helps. TIA!     "], ["Where do I get help for alcoholism? ", "158", "249", "2024-02-18T23:57:10.706000+0000", "https://www.reddit.com/r/Austin/comments/1au90gg/where_do_i_get_help_for_alcoholism/", "I am a functioning alcoholic, I am not alcohol dependent yet. But I drink about 6-8 beers a day. I would like to cut this completely or perhaps limit to 2 drinks a day, All the resources seem to be for alcoholics. But not for people who are trying to mitigate their alcohol use. Edit: this blew up, thanks everyone for suggestions and resources. I really aprreicate it :)    "], ["Should I seek help for my alcohol problem?", "78", "50", "2024-06-22T04:04:39.992000+0000", "https://www.reddit.com/r/AirForce/comments/1dln07u/should_i_seek_help_for_my_alcohol_problem/", "For the past couple of months, I've been drinking every single day after work. And it's not just a couple of beersâ\u0080\u0094I've been going through a handle of liquor daily. Mostly due to home stressors and things going on at work. I'm trying to avoid mental health because I'm underage. I'm worried about going to mental health for help because I don't want to get into trouble or face any charges.Has anyone else been in a similar situation? Thank you for your time.    "], ["Moving help for $100", "4", "4", "2024-05-27T21:29:59.875000+0000", "https://www.reddit.com/r/SJSU/comments/1d22uup/moving_help_for_100/", "I (F 26 not SJSU alum but UCSC alum) need help moving Friday (June 7th) morning around 9am. I need help moving three things a tall dresser, tv console, and tv. It will probably take like 30mins. I can pay you in $100 cash and whatever beer is in fridge ð\u009f\u0098­ (ofc 21+ for the beer LOL) I'm in the Rose Garden area. PM if you're interested.    "], ["Needing help for a graduation present from someone in Maine!", "15", "5", "2024-06-17T14:23:08.670000+0000", "https://www.reddit.com/r/Maine/comments/1dhzbh9/needing_help_for_a_graduation_present_from/", "Hey r/Maine , I'm trying to land a graduation gift for a friend who fell in love with a very specific brand of ginger beer: Captn Eli's. They used to be stocked across the country, but now the soda brand seems exclusive to Maine. Doing some research led me to find I could still purchase the ginger beer from a store called Shaws, but it only allows for local pickup/delivery. With that in mind, I'm wondering if I order some, if would be someone in this sub who would be willing to pick them up and ship the order? I'd cover necessary costs, and would be happy to add something to the cart for whoever help to keep. Thanks a ton in advance! Edit: reaching out to the brand itself to see about ordering through their website!    "], ["Eclipse help for an overwhelmed tourist?", "74", "40", "2024-01-20T13:29:48.418000+0000", "https://www.reddit.com/r/Austin/comments/19bbsnw/eclipse_help_for_an_overwhelmed_tourist/", "Hello from Montreal! I'm a 39F travelling alone to see the eclipse. I love your great city, I'm happy to return. I'm looking for a travel agent or local expert to help me plan and book my eclipse experience. I already read through the many eclipse posts, and decided I should just hire an agent. I'm becoming overwhelmed with where to go, how to plan for possible traffic gridlock if I head out of town, lining up accomodations for a great viewing experience, and figuring out how to balance the longest totality viewing with what my sanity can endure in terms of navigating big crowds and big traffic. I never use travel agents and always book my own travel, but for this event I will happily pay someone to help me plan and book everything. I'll flying in the 6th, out the 11th. I'm also happy to connect with anyone who likes nature, hikes, swimming,  craft beer, to explore with while in town ð\u009f\u0099\u0082 Merci    "], ["Fast help for first reaction?", "20", "5", "2023-12-08T23:17:44.327000+0000", "https://www.reddit.com/r/Allergies/comments/18dzjvw/fast_help_for_first_reaction/", "I never had any allergies, but about an hour ago i drank maybe 200ml of Beer and now my face is bright red and swolen, I am sweating very much and my heart is beating really fast. Ist there anything quick I can do to help with my sytoms? I already took a shower to stop the sweat and am cooling my face so it doesn't get any poofier... Edit: Thanks for the fast help. I slept for a few hours and now it's better. On monday I'm going to visit my doctor and Hope that i am Not allergic to beer and that this was an overreaction to anything. Should something like this Happen again, i'll Go to a Hospital immediatly.    "], ["I need help for my husband", "50", "342", "2023-09-25T05:55:02.414000+0000", "https://www.reddit.com/r/AskDocs/comments/16rjwb8/i_need_help_for_my_husband/", "Please I need help for my husband. He picked me up today after helping his family build a shed in northern Mn. I am devastated. Symptoms: Does not have any memory or the last 48-72 hours. His memory resets about every 5-8 minutes No other signs of strokes, emergency room ruled that out pretty quickly but continued with their protocol after calling a stroke code Doesn't have memory of a job he started 5 months ago Doesn't remember the car we bought that we were driving in Had a heart rate of 200/minute. They gave him meds that helped. They said he was in o believe a-fib and has now returned to sinus. Throwing up. About 7 times in 12 hours Tests: 2 CTs that were good but showed a blood clot in his lungs. They were going to start him on blood thinners. 3 EKGs that were good. A head MRI that was clear of clots, tumor or anything else that could have shown up All blood tests are good except he tested positive for Lyme but they didn't think this was an active infection since all of his other tests didn't show an inflammation response. I had to drive 2 hours home to feed pets that were needing to be cared for since we did not anticipate a hospital stop on our way home. I will return to the hospital before rounds start tomorrow Other information: no head injuries, no drug use, two beers before he went to bed. Ate the same food as everyone at the camp and everyone else is feeling fine. He can't remember anything that happened 5 minutes ago. The hospital is confused and I am struggling to help my husband. 5'8 260 pounds    "], ["Help for an Aussie. Wedding/groomsmen event. ", "15", "13", "2024-04-28T04:01:30.382000+0000", "https://www.reddit.com/r/Temecula/comments/1cexcmj/help_for_an_aussie_weddinggroomsmen_event/", "Hey friendly Americans. I'm one of the groomsmen in my best mates wedding in Temecula next month. Wedding is day before Memorial Day. Travelling over for the big event. I want to organise a group haircut and a cut throat shave for the seven of us blokes before the wedding. This side of the planet this custom is quite normal and is generally accompanied by beers at a cool barber shop. Is there anywhere is your awesome community that would do this? Please, thanks, and high fives.    "], ["Help for a Wake.", "4", "2", "2023-12-12T20:50:33.379000+0000", "https://www.reddit.com/r/beer/comments/18gw11j/help_for_a_wake/", "Hello r/beer !  Throwing a Hail Mary to you.  My FIL unexpectedly passed and his wake is this Saturday.  He was a wonderful guy and a good beer never had a better friend.   He went to law school at UC Berkeley and my MIL has fond memories of scraping together enough for a six pack of Anchor Steam.  She would like to toast to him with one.  As I'm sure you all know they went out of business, so here's the Hail Mary.  Do any of you know where I can get any, any at all,  in or around the Salt Lake area? Thanks for anything!!    Cheers!    "], ["Do meds help for substance use issues? ", "0", "2", "2024-06-27T20:29:32.909000+0000", "https://www.reddit.com/r/ADHD/comments/1dq1a5t/do_meds_help_for_substance_use_issues/", "I (34M) was recently diagnosed with ADHD and  I was curious if taking medication has helped anyone moderate their substance use? For context, I only drink and smoke weed but I have always thought my impulsivity and lack of self control were ADHD related as one beer easily becomes six or when I find myself getting high at 10am after telling myself I would be productive that day. So my question is: Has anyone had a similar experience and did going on medication for ADHD help?    "], ["Need help for school project", "1", "0", "2024-01-19T22:39:51.828000+0000", "https://www.reddit.com/r/czech/comments/19avznl/need_help_for_school_project/", "Our school required us to do a service project. We decided to make an art installation of different countries/cultures. If you would like to help us out please dm this account a piece of art or a picture that you think describes your country/culture. Please add a caption of what it means and represents to your country/culture. Thanks for the support Czech Reddit.    "], ["Help with beer + game night beers.", "18", "5", "2024-01-27T16:51:42.809000+0000", "https://www.reddit.com/r/KansasCityBeer/comments/1acf5vh/help_with_beer_game_night_beers/", "Hey everyone, My friends and I do a beer + computer game night on Mondays where we usually drink 2 beers and play for about 3-4 hours. I'm in charge of collecting the beers for the next â\u0080\u009cbeer calendarâ\u0080\u009d and I've fallen completely behind on the beer scene in KC. They all live in St. Louis so I wanted to add a lot of local flavor if possible so they were all new for us. I'm looking for any recommendations where I can pick up some unique 750's or cans or even just a good liquor store that stocks a lot of local brands. Thanks & look forward to it.    "], ["Non-alcoholic beer to help with cravings?", "25", "8", "2024-06-14T22:06:44.175000+0000", "https://www.reddit.com/r/stopdrinking/comments/1dg2mvn/nonalcoholic_beer_to_help_with_cravings/", "Has having the option of non-alcoholic beer helped anyone with staying sober? I'm currently 467 days sober and have not had cravings since around day 100. However I've been  been to a few bbq's lately and seeing friends drinking beer has awoken a desire for the taste of an IPA. Not a craving at all and I've had no issues drinking a sparkling water instead. Seeing my friends get drunk and how they behave has only increased my commitment to lifelong sobriety. However I've heard good things about Athletic Brewing IPA's and was wondering what other's  opinions are. My only concern is that the taste of a non-alcoholic beer will make me want the real thing.    "], ["Help with wheat beer", "22", "9", "2024-03-16T14:56:11.073000+0000", "https://www.reddit.com/r/Homebrewing/comments/1bg7wer/help_with_wheat_beer/", "I tried, unsuccessfully to make a beer similar to Erdinger, Weihenstephan, Schneider Weiss, etc. It's my own recipe but borrowed from other recipes I've seen online. I'm hoping someone can point out what I'm doing wrong. Instead of coming out with that full mouth feel/creamy/orangey flavour they both came out thin, ascorbic, almost like white wine. The colour was also a very pale yellow instead of a slightly darker shade towards orange like I've seen in Erdinger especially. Originally I thought the first beer was off but the second came out exactly the same. Then one day I went to a brewpub and they had a beer exactly like mine! Ok so now I know it wasn't \"bad\", just not even close to what I was aiming for. Please critique: 5 Gallon batch (BIAB) Distilled water 3.4mL lactic WB-06 yeast 48Ca//0Mg//0Na//41Cl//59SO4 6.25lb Pale Wheat 5.25lb Pilsner Measured OG: 1.060 Measured FG: 1.014 Measured mash pH: 5.43 Mash: Bag in @ 120F and ramp to 148F, holding for 35' Boil 60' 0.5oz Hallertau 20' 0.5oz Tettnanger 20' 0.5oz Perle 20'    "], ["Help with German beer", "17", "0", "2024-03-31T21:56:59.356000+0000", "https://www.reddit.com/r/germany/comments/1bsm580/help_with_german_beer/", "Hi, I live in the UK. I love German beer and want to try more. But, buying German beer here is expensive. Like 5â\u0082¬ ein flasche expensive. Is there a way that I can order a crate or two from a business in Germany to send over to the UK for me as an individual? If even possible a mix of different styles too? I can order from a beers merchant in the UK but the cost is still high and limited. Any help. Danke.    "], ["Help with beer?", "8", "5", "2024-03-17T21:50:43.093000+0000", "https://www.reddit.com/r/pittsburgh/comments/1bh9rah/help_with_beer/", "So I went to the PWHL game today at PPG arena and grabbed some food and a beer. I don't usually drink beer bc I haven't ever liked it but I figured why not, it's St Patty's Day. Anyway, I went to Tenders Love and Chicken, they only had one beer on tap, but I cannot for the life of me remember what it is! I actually really enjoyed it and would like to find it again. I've looked online and can't find it! Anybody know what beer they serve there?    "], ["Help with getting German beers", "12", "2", "2024-03-31T11:43:14.219000+0000", "https://www.reddit.com/r/UkBeer/comments/1bs8gr0/help_with_getting_german_beers/", "Hi, apologies if this is in the wrong place, new to reddit. I love beer. Specifically German beer. Buying German beer is becoming very expensive over here in the UK. I buy from beer shops, independent craft beers stalls and shop/pubs. But a single 500ml German beer bottle costs approx Â£5. Its not feasible to keep doing this. So my question, is it possible to get lower priced German beers in the UK (from other than supermarkets) with more variety? I thought of doing a trip in my car to Germany and bringing a few crates back with me. However, I'm certain I'd have to pay some form of duty on it too. This, on top of fuel, travel and accommodation would seem unlikely to happen. I'm stuck on ideas on how to get more German beers. I live in East Anglia. Any help!! Prost! ð\u009f\u008d»    "], ["Help with brewing beer", "3", "2", "2024-02-10T14:15:06.869000+0000", "https://www.reddit.com/r/Homebrewing/comments/1anh9cj/help_with_brewing_beer/", "Hi everyone. Was just wondering if there is a minimum amount of beer I can brew in a 23L fermenter as I've recently brewed a batch and didn't drink it all in time. Just wanted to know the logistics so I don't overbrew again and waste beer. Thanks    "], ["Help with translating for ancient beer.", "2", "2", "2024-04-01T19:08:35.561000+0000", "https://www.reddit.com/r/EgyptianHieroglyphs/comments/1btcizs/help_with_translating_for_ancient_beer/", "I am doing a project in one of my classes where we are brewing a replica of an Ancient Egyptian beer specifically from the Ramesside period. we want to make a label for our beer and want to include hieroglyphs on the label. What we need translated: name of the beer: \"Elixir of Ra\" Always open to other name if anyone has suggestions. our group members names. Mary Braden Blake Trace Tenzin    "]]