[["My problem with the candy system", "26", "158", "2024-05-26T18:18:19.003000+0000", "https://www.reddit.com/r/pokerogue/comments/1d17ikc/my_problem_with_the_candy_system/", "I like the implementation of Candies a lot, it's a cool way to feel progression outside of individual runs, but theres one particular flaw with them (in my opinion) thats been bothering me. There are so many cool passives I want to unlock, but you only unlock them by USING the given pokemon. Which means by the time you unlock it, you either a) already cleared classic with the pokemon, or b) already have a long endless run started with the pokemon in your party. In both circumstances it feels lame starting a new run from 0 with that pokemon even if they have the cool new effect, and you'll probably want to try out new pokemon by that point anyways. Basically what im saying is that the system is cool but rn the few mons ive unlocked passives for are the ones I am the least interested in starting a new run with just because it means ive used them so much already. Wish there was a remedy to this because the passives are honestly pretty awesome. Anyways, this game is still dope and shoutout to the dev(s), at the end of the day this is merely a nitpick.    "], ["Problem with candy", "3", "24", "2023-09-26T14:15:56.610000+0000", "https://www.reddit.com/r/dragonvale/comments/16sp6gb/problem_with_candy/", "It let me do all of my morning games and I collected most of the pumpkins around my park before it told me it registered as a double day so my games this morning and the pumpkins didn't count towards it?    "], ["Problem with Dragons Beard cotton candy", "4", "2", "2024-01-15T23:42:36.694000+0000", "https://www.reddit.com/r/CandyMakers/comments/197nv5i/problem_with_dragons_beard_cotton_candy/", "So I'm a super ameture at this candy maker thing but my kids wanted to make their own cotton candy so we stumbled upon the dragons beard thing. So we got thr hang of it pretty good but had a problem. We boiled the ingredients to JUST under 270Â° F. It turned into a syrup like it should have, so we poured it into another smaller container for it to cool. When it was ready the inside was plyable like it should have been but the edges were like glass. So does anyone have any experience with that. Did I cook it too hot, too long or did I miss something. Tldr: The melted sugar was rock hard instead of the plyable mass it should have been. What did I do wrong? Thanks    "], ["Help! My players have a problem with Fey snow powder, stardust, nose candy.", "5", "1", "2023-12-28T17:37:08.966000+0000", "https://www.reddit.com/r/Pathfinder2e/comments/18szl19/help_my_players_have_a_problem_with_fey_snow/", "Hey All, If you're a player in a Gatewalkers game where you found a strange substance and have the interest (either yourself or another party member) in selling it in game to make gold in some breaking bad-like fashion please tap out and hit the back button. Because I feel that is a fairly wide cast net in gaming.. a squirrel also turned out to be a giant eye in your game. Leave and remain unspoiled! ---- I'm running a heavily modified Gatewalkers game and I need a little help. I tossed a random package of illicit goods in my players laps and it's been a source of humor and potential schemes for them. In my haste I found random Pathfinder substances called Crush and Bachelor Snuff, so I mixed the two and gave it to my players when they investigated the package. However, I'm not too keen on the Bachelor Snuff aspect and want to embellish some of the Fey interactions they're starting to run into in the Wilewood. I described the substance as a golden powder laced with small spots of prismatic scales - like broken up dragonfly's wings. The easiest way to link it is to have them instead be the crushed up wings of a Pixie, but the problem I'm having is... what are the effects of snorting crushed up Pixie wings? I thought the effects wouldn't be felt immediately, and would get more prominent the further into the Wilewoods they ventured. Honestly I'm having a problem connecting to Fey in general, I haven't found the headspace to portray a Fey creature and so far I have just been mysterious with the Fey creatures I've deployed. Think Hayao Miyazaki spirits instead of zany/emotionally charged Alice in Wonderland. Any thoughts on what sort of side effects and subplots I could drop for my group?  Thanks!    "], ["There is a massive problem with trading for expensive gear/keys", "324", "503", "2023-09-06T16:00:52.054000+0000", "https://www.reddit.com/r/DarkAndDarker/comments/16bo1fg/there_is_a_massive_problem_with_trading_for/", "Title. The fact that you can fit only 1250 in the trade window, and keys are going for anywhere between 1500-2000 now basically makes the entire economy ripe for scamming. On top of this, purples with crazy rolls and legendaries can go for well over 1250. Combine the fact that keys are hard to buy/sell without getting scammed, and you have insane hurdles to jump over to buy anything better than blues/mediocre purples. Please bring back Heart Candies, or give us something like a gold bar from the treasurer that can be bought and sold from/to him for 500 that stacks up to 5. The current system is broken without having 3rd party intermediaries, which are hard to come by. Upvote so that this gets some traction, and better visibility for the devs, and respond if you think you have any better suggestions!    "], ["Am I the only one who has a problem with meat?", "103", "1", "2024-01-15T12:55:44.665000+0000", "https://www.reddit.com/r/loseit/comments/197833w/am_i_the_only_one_who_has_a_problem_with_meat/", "I've been reading and posting on this subreddit for a while now and two things that I see all the time are: \"Eat more meat\" and \"Eat less candy\". But I don't even like candy, don't really eat anything sweet. I feel like meat is much more adictive than sugar. I crave it all the time and portion control is really hard. Before I started trying to lose weight, the only thing stopping me from eating several lbs a day was that I couldn't afford it. And it's so calorie dense, 1 lb of beef is over 1000 kcal. Is there anyone else here who has the same problem? How did you overcome it? Do I have to go vegetarian?    "], ["Do other countries have the same problem with Halloween as Finland?", "89", "0", "2023-11-01T09:07:55.300000+0000", "https://www.reddit.com/r/Finland/comments/17l7yzd/do_other_countries_have_the_same_problem_with/", "In Finland, Halloween has grown rapidly in popularity over the past 25 years, but with that, it has become a problem that the children who go around for \"karkkia ja kepposia\" (lit. \"candies and pranks\", originally \"trick or treat\") don't go on their candy tour only on one specific Halloween day as it should, but they go around on random days throughout the weeks of October. And if the house doesn't happen to have candy to hand out on the wrong day when they come to the door, the kids \"decorate\" the front of the house with eggs and paint as a revenge prank -- even though they are told that Halloween is only the last of October. Is this a problem anywhere else?    "], ["The problem with living in Houston (in one photo)", "150", "605", "2023-11-15T21:31:58.810000+0000", "https://www.reddit.com/r/zillowgonewild/comments/17w4emz/the_problem_with_living_in_houston_in_one_photo/", "$1.26 M  https://www.zillow.com/homedetails/2426-Tackaberry-St-Houston-TX-77009/27792813_zpid/?utm_campaign=iosappmessage&utm_medium=referral&utm_source=txtshare  Would you like to buy a single family home inches away from a vape shop and T-Mobile agent housed in an industrial building? Neither would I. I live in a city with proper zoning. Houstonians don't have the luxury of proper zoning.    "], ["Collie manpower, tanks, and a problem with specialization", "117", "38", "2024-03-13T05:58:04.421000+0000", "https://www.reddit.com/r/foxholegame/comments/1bdk6mo/collie_manpower_tanks_and_a_problem_with/", "Just some thoughts (rant) about how having specialist vehicles and the current meta collie tank line is a significant disadvantage for manpower required with the current balance state. Something that would not be clear when directly comparing vehicle stats or current cost but should be heavily considered. During high pop hours for each faction, the chieftain can fit in a tank line. With 2 people you can run a 12.7mm tank and help protect a tank line from inf. But in a moment, you can swap seats, lunge forward, and PVE. Meanwhile, the collies must have 4 people in the region, or a parked, loaded, and definitely not going-to-be stolen ballista, in the region. If the ballista comes up too soon it's a significant liability because it is helpless against everything but someone running into the tracks due to lag. During lop pop hours it is hands down the best vehicle for contesting border bases. Fast enough on and off-road to sweep in from any direction, has enough 250mm to kill two border bases, and a 12.7mm gun to kill sticky rushers. It is fast enough and ample health to fly down the road eat a few stickies, get tracked, and still get the trade for the border base. There is the argument that the chieftain is facility-locked, therefore creating and moving the chieftains require more player time. That is true but just goes to show a wider issue on manpower requirements for collies to field its better PVP and PVE 40mm tank lineup. The better 40mm tank, the spatha, requires a facility but is broadly compared to outlaw/svh both MPF vics. And, for the PVP, the main tanks are LTD (FAC) and Bardiche (MPF) vs HTD (MPF) highlights again is another example where collies must bring two types of vehicles instead of one. LTD is facility locked is also locked behind a tank chassis that doesn't belong on the front line after falchions. Requiring special MPF queues or pay more than MPF cost. Why does the LTD need to be compared against the HTD? Well the LTD is also the only 45m non push gun (RIP STYGIAN) giving both PVE and PVP a warden range advantage day and night. If you don't have an LTD in your tank line every trade starts with a collie tank getting shot and ends when the warden tank line backs up. Something they can do fast enough that collie tanks will not catch them until they are back in AI. This range gap used to be covered by the smelter(68), an infantry tool that is now \"locked\" behind a facility, and inability to ship/ deploy in mass. You can ship 3 HTD in the spot of 1 smelter... are you kidding me? The new smelter serves 1 real purpose, to kill EATs. Wardens just use a tank already common on the front line to kill the collies bmat emplaced anti-tank option... So now you consider just the MPF tanks, Outlaw SVH HTD vs Falchion Bardiche. Both of the collies MPF vics require a commit and die efficiently play style to be effective. Stat wise the Falchion is worse than its MPF SVH and Outlaw counterparts, dying more often, draining manpower to prep yet another either inside or outside of the hex. New players get disheartened because the accessible tank just blows up before they can even see the HTD or outlaw shooting them. The Barcihe is outranged by its MPF HTD counterpart by nearly 10m, if it isn't actively throwing itself at a warden tank line it will be taking shots with no way of retaliating, the PVP MPF collie HTD can be easily bullied by either of the MPF warden vics, requiring a commit and trade mentality to be considered effective (not new player friendly). While the HTD is very new player friendly, the play styleis lining up with a tank line while the gunner points and clicks on any tanks getting in range. Just flank? Well why didn't the collies think of that! Well there are two main factors preventing this barring skill. Most points of interest worth fighting over will be bunkers, facilities, or towns, all of these create endless chokepoints either by bunker or terrain for the better armoured / longer range tanks to trade more efficently. Well what about open hexes like weathered expanse, surely the collies can flank on that, then you realize you are just in a larger population chokepoint called a region Where even if the entire collie region is in tanks, they still can't trade with a numbers advantage. A few things have made these problems significantly worse. First, the satchel changes significantly nerfed infantry PVE, this was making up for some of the Ballista' s shortcomings in not fitting within a tank line, its removal gutted collie PVE options except for surprise Ballista rushes. Second, the knee-capping of the ignifist, it used to be the widespread, user-friendly, cheap antitank to punish hex's full of tanks. Now it is a shadow of its former self and is completely out classed by the warden flask. Finally the removal of the HV68 smelter, brief replacement with stygian, only to be nerfed then replaced with whatever this \"push gun\"/ \"emplacement\" abomination is. TLDR: Collie tank bad, requiring too many people, and 1.0 changes made it worse Rant over    "], ["I have a problem with my legandaries.", "13", "0", "2024-02-16T12:11:04.380000+0000", "https://www.reddit.com/r/pokemongo/comments/1as73lv/i_have_a_problem_with_my_legandaries/", "I got a shadow kyogre today from Giovanni, but its CP is only 927, and I have a zygard that's only 1000. How do I get candy for them quickly? I have kyogre as my buddy, to get that 1 candy for every 20km, but I want to get them to a higher CP more quickly. I would do GBL, but in master league I'm up against Dialgas and Mewtwos, and in the evolution league, my best Pokemon is only 1200 CP. Also, I live in a small town, so I can do raids, but it's difficult to come across them. Any tips?    "], ["My problem with this event", "5", "13", "2023-11-01T02:08:41.278000+0000", "https://www.reddit.com/r/CreaturesofSonaria/comments/17l1qr3/my_problem_with_this_event/", "Can we please talk about how annoying the candy is to get. Like 50 candy for the obbyâ\u0080¦ likeâ\u0080¦ how am I supposed to get all the Halloween specs if candy take bloody ages to get    "], ["Problems with skull candy grind", "1", "1", "2024-01-09T01:45:35.816000+0000", "https://www.reddit.com/r/Skullcandy/comments/1922mdq/problems_with_skull_candy_grind/", "I just bought a pair of the grind series a few days ago, I removed the little white pieces of paper that prevent them from changing, and only the left earbud is charging to full, the right will charge to 60 percent and then disconnect every 5-10min (I made sure they were seated in the case correctly and I let them charge over night) any ideas ?    "], ["Iâ\u0080\u0099m Having Problems With My â\u0080\u0098Cotton Candy Queenâ\u0080\u0099 Palette:(", "7", "14", "2024-01-03T17:09:25.384000+0000", "https://www.reddit.com/r/jeffreestarcosmetics/comments/18xo6sg/im_having_problems_with_my_cotton_candy_queen/", "Hey guys! Today I used my â\u0080\u0098Cotton Candy Queen' palette for the first time (I match my makeup with my outfit). I don't know if it's just me, but the pigment just wasn't there so I REALLY had to dig into the pan and pack it on. Then I got the pigment. Especially the metallic shades, the mattes were fine, amazing as usual! It's just the metallic shades / colors. It was also way more powdery then 90% of my other Jeffree Star palettes (I have all except Psychedelic Circus). However, when I put it on my eyes there was like ZERO fallout. Which is nice, but I'm a little confused, haha. Considering how powdery it was for me when I put my brush on / in the pan. Was just wondering if it's just mine? Or if others here have had it happen.    "], ["Is anyone else having problems with the candy shop?", "2", "2", "2023-10-14T14:09:02.131000+0000", "https://www.reddit.com/r/RoyaleHigh_Roblox/comments/177qeob/is_anyone_else_having_problems_with_the_candy_shop/", "I don't know if it's the entire shop or just the candy shop, but anytime I try to buy stuff with candy it way processing forever and doesn't let me buy it. Like I would go to swipe my card and then it says processing until I get annoyed and have to leave. Also I have checked and I do have enough candy to buy the item.    "], ["Problems with resource packs bedrock Xbox", "3", "1", "2024-01-17T17:12:28.319000+0000", "https://www.reddit.com/r/Minecraft/comments/1991t3d/problems_with_resource_packs_bedrock_xbox/", "I enabled the classic resource pack, and then disabled it to use the candy pack, but the classic pack is overlaying the candy pack, even though it is disabled. I enable and disabled other packs and restarted my game to see if it would go away but it's not helping. I don't know why this is happening or how to fix it.    "], ["10 Problems with the Sunday Night Timeline", "92", "84", "2023-11-14T10:08:44.491000+0000", "https://www.reddit.com/r/AshaDegree/comments/17uz5gn/10_problems_with_the_sunday_night_timeline/", "Sometimes I feel the more I read about Asha's case, the less clarity I have over the case facts as I come across more inconsistencies in news reports or realise something else that just doesn't add up. Below are 10 problems with the timeline from Sunday night to Monday morning.  1. THE LACK OF INDEPENDENT SOURCES.  All the timestamps from Sunday night - when the kids went to bed, when Harold checked on them - are provided by immediate family with no independent sources. Now this is really not the fault of the Degrees that their account can't easily be verified given it was at home during the night when people are sleeping. My point though is this means they could have adjusted times to suit them. Establishing and verifying a timeline is one of the most critical tasks for LE and an experience detective would interview the parents separately, check info is consistent etc. but unless they identify something to be contradictory, LE and we are ultimately reliant on the parents' word.  2. THE SCARCE SUNDAY INFO.  On Day 4, a timeline starting 4 days prior to Asha's disappearance was published. We learn what she did and where she was on: Thursday, Friday, Saturday, Sunday and Sunday afternoon but Sunday evening - what's probably the most crucial part - is glossed over. This timeline from LE has zero information about what the family were up to that evening:   Crawford said Asha went to bed around 8 p.m.   Electricity went off in the Degree's neighborhood just before 9 p.m., after a car wreck nearby.   We can expect a Sunday/school night to be low-key but very mundane details were included for the other days - e.g. Asha catches the bus to school . This shows me that there was sensitivity around Sunday night.  3. THE POWER OUTAGE.    A power outage, attributed to a car crashing into a power pole, affected the Degree neighbourhood just before 9pm, lasting till about 1230am. Power outages don't necessarily affect all buildings in the same area at the same time though. Based on first reports :     Her father said that the power went out around 10 and came back on around midnight Sunday. (This is consistent with the broader power outage).    My point again though is there's a reliance on what the Degrees say around when exactly the power went out and was restored at their house.   A digital clock would reset to show 12:00 (if power is lost) once restored. Let's say the power outage lasted until 11pm in reality at the Degree house - clock would say 12:00 once reset. Let's say the outage lasted until 1:00 in reality - the clock would show 12:00 once reset. This could have somehow confused the Degrees time recollection that night - or given them a very easy way/excuse to mislead everyone about the times from that Sunday night. Doesn't matter if they also had a watch or analog clock.   It's worth noting that later that Monday, the Sheriff said Asha may have got up while the power was out    EDIT: Sorry, I just relistened to her recent 2023 interview and Iquilla actually says outright- â\u0080\u009dI guess it was about midnight because the power kicked back onâ\u0080\u009d and. â\u0080\u009dThere was a power jolt that's how I knew it was about 12 o'clockâ\u0080\u009d . Huh? She's literally saying the power being restored is what told her that the time = 12 midnight. No, power doesn't magically get restored at 12 midnight and at this time only. As I said, the clock resetting could have somehow genuinely confused them at the time but it is so weird that Iquilla is explaining it later as if this logic is correct.  4. THE LONG-TERM REMINISCING.  Iquilla reminiscing 20+ years later about that Sunday night is difficult to consider accurate & reliable - because of the additional complexity created by genuine memory loss and misremembering (on top of any intentional misleading). There are some things that I'd expect her to remember clearly from that night/morning but her memories about things like relatives coming by, watching TV etc. could be interweaved from other occasions- not necessarily specific to that Sunday. As I believe the aftermath of the basketball game to be the trigger for Asha's disappearance, I unfortunately have great trouble believing they were sitting there as a happy family watching a basketball game together that night.  5 . THE 2:30AM NARRATIVE.  The narrative for what happened at or around 2:30am in the Degree house that night has always struck me as a little odd.  What was first reported :   Mr. Degree said that he checked on Asha at about 12:30 a.m. and she was sleeping in her bed.      O'Bryant told police that he saw his sister get up around 2:30 a.m. in her nightgown and go to the bathroom but then came back to bed.    LE's timeline published a few days later doesn't acknowledge O'Bryant last seeing her.   When electrical service is restored around 12:30 a.m., Asha's father sees both Asha and O'Bryant in their beds. The children sleep in the same room.Asha's father goes to bed around 2:30 a.m.    Later reports say    Her father said that he had checked on her around 2:30 a.m. and later her brother said he got up to go to the bathroom between the hours of 2:30a.m. and 6:30a.m. and he believes she was there.   On face value, I have less concern for Harold checking on the kids but so many questions about O'Bryant's account. Notice the change from Asha getting up for the bathroom to himself. Was it unusual for Asha (or him) to go to the bathroom or get up for any reason in the middle of the night? If he had been awoken by Asha moving about, it seems unusual he'd bother to look over and notice her apparel - did he sense something to be out of place? As O'B then apparently goes back to sleep and is now not disturbed by a squeak from his sister's bed and doesn't hear a sound from Asha allegedly leaving the house shortly after. Unfortunately his account just seems fabricated to me (my blame is not toward him as a 10 year old but the adults in this situation). Anyway, this all creates a little uncertainty around the crucial question- who last saw Asha & when?  6. THE CIRCULAR REASONING.  A couple of eyewitness sightings were provided of someone on the highway in the early hours of Monday - the first being at 3:45am. A common belief is the sighting must have been Asha because it lines up with the time she was last seen by her family at 2:30am. Also her family saying they saw her at home at 2:30am must be true because it lines up with when the eyewitness saw her on the highway at 3:45am. The fundamental problem with these beliefs is that both start with an assumption. You can't validate an assumption based on an assumption. This is circular reasoning. Basically, you'd be saying â\u0080\u009cX is true because of Y, and Y is true because of Xâ\u0080\u009d. The conclusion is inherently flawed. Both may still be true of course.  7. THE CHANGING BEDTIMES.  Some say that inconsistencies are due to memory loss over a period of time. I agree this can happen, depending on what the information is, but many of the inconsistencies in Asha's case are within the first few days and weeks -such as what time Asha went to bed.  until her father told her to go to bed around midnight - 15 Feb    Asha's father said the girl went to bed about 6:30 p.m.- 15 Feb    She watched TV in the den with the rest of family until returning to bed at 9 p.m - 15 Feb    Crawford said Asha went to bed around 8 p.m - 17 Feb   I would dismiss smaller differences e.g. 9pm vs 9:30pm - but a 4 hour variance is an issue. Note the last time (8pm) from the Sheriff - why did he simply change Asha's bedtime as if it to â\u0080\u0098correct' it? I believe her bedtime must have been around midnight per what Harold first stated. The  advantage to the Degrees with a 8pm bedtime = it conveys good parenting, disciplined children and a normal night. This doesn't apply in reverse i.e. no advantage to say Asha went to bed at midnight if she actually went to bed at 8pm. Plus there was the midnight lounging on the couch...  8. THE LATE COUCH LOUNGING.   Reported the first day    Asha's dad said she laid on the couch in jeans and a purple and white \"Sun Degrees hot in Atlanta\" T-shirt until her father told her to go to bed around midnight.   Why was Asha, whose bedtime was by 9pm on school nights , not in bed and still in day clothes at midnight? This detail weirdly disappears in subsequent news reports. I'm zeroing in on this not simply to be critical that Asha was up but because it shows irregularity in routine just hours before she was reported missing. It needs to be explained.  9. THE LATE NIGHT CANDY TRIP.   Reported by ABCNews GMA    <voiceover-reporter> about 1130, asha's father harold says he goes out to buy valentine's day candy. when he comes home, he watches TV, checks in on the children, and goes to bed about 230.   What's interesting is this aired 10 years later. It's unclear if he said this in 2010 or GMA were reporting what Harold had previously told LE. I cannot know for certain if this was the first time the candy trip was publicised but it makes very little sense for Harold to introduce this information ten years later. If LE's decision, I wonder why it was shared in 2010. Anyway - ultimately it does seem like an excuse. Harold simply making a late candy trip is plausible - but that's what makes it a good excuse for why he/his car may have been seen by someone at that late hour.  10. THE EARLY MORNING BATH.  From an interview with Jet magazine    <Jet> Can you share the basic facts regarding your daughter Asha's disappearance.   <Iquilla> I woke up on Feb. 14, 2000 at 5:45am. The alarm went off for my children to go to school at 6:30am. I went to the bathroom, two feet away from the door, to start the bath water because they could not take a bath the night before since we had a power outage.   This interview with Jet happened 13 years later. The detail about a bath was not out in the public sphere prior to this time, to my knowledge. From a Feb 2000 article    The typical day starts at 6:10 a.m., when Iquilla got up to get ready for work at Kawai American, a piano manufacturing plant in Lincolnton. She'd wake the kids up then, and they were responsible for getting dressed, fixing their own breakfast and brushing their teeth before going to school. At 7:30, Asha and O'Bryant met the bus..   It's unclear if usually the kids would be woken up at 6:10am (when she woke up) or after she got ready for work but just sharing how a typical day in the Degree household had been described. I will however point out she specifies the bathroom being 'two feet away from the door' . Why? I know Iquilla can be verbose with her responses but this detail seems extremely unnecessary. Why did the power outage at 10pm stop the kids having a bath? Unfortunately, this bath overall does seem like an excuse too. Perhaps someone saw movement at the house at an early hour? I suspect the commotion at the Degree household started much earlier than 6:30am. Because of all of this, I think it's worth reconsidering the window of opportunity [2:30am - 6:30am] in Asha's disappearance and asking what other explanations could exist for when this little girl went missing.    "], ["Please don't tell me i'm the only one having problems with the bees blaster...", "6", "3", "2024-02-28T14:44:43.025000+0000", "https://www.reddit.com/r/AdoptMeRBX/comments/1b27p0w/please_dont_tell_me_im_the_only_one_having/", "UPDATE: IT GOT FIXED! YAYY! So...when I have it out, and I'm clicking somewhere, it shoots out honey candy. But it only does it once. I have to rejoin for it to shoot only ONE out again. I tried to see if maybe it's the device I'm on, but the same thing happened on my phone...I'm gonna be upset if this is some update because that costed REAL money and it's annoying to have to rejoin over and over just to get another honey candy ._. (I did report it as a bug so I hope they do something I just want to know if anyone else had the problem)    "], ["what $29 and problems with food gets you at cvs", "20", "195", "2024-03-04T19:28:09.700000+0000", "https://www.reddit.com/r/ShittyRestrictionFood/comments/1b6jqvf/what_29_and_problems_with_food_gets_you_at_cvs/", "bought 4 boxes of brownies because they were on sale for $2 a box ð\u009f\u0099\u008f    "], ["Problems with Lime Fudge", "1", "2", "2024-05-14T17:49:38.211000+0000", "https://www.reddit.com/r/Cooking/comments/1crydhf/problems_with_lime_fudge/", "I made lime fudge from this recipe . The first time I made this recipe it set but was a touch grainy. The second time I made the lime fudge, it was a disaster. It did not set. It was squishy once taken out of the fridge. Even when we put it back in the fridge, it was soft. So I decided to reheat it and try again. This time I used a candy thermometer and got the mixture up to 234-ish F. I didn't stir as much because I thought that's what was causing the graininess. But it burned a little bit on the bottom of the pan. I put the mixture in my foiled and greased pan. But it seemed too liquid. And it definitely did not set. When I took the fudge out of the pan after more than a day of chilling, it oozed everywhere like too soft caramel. What did I do wrong? Any suggestions? Also, I used white baking chips instead of white chocolate chips. Not sure what I used the first time, but I would think it would be white baking chips.    "], ["Problems with Herba Mystica", "19", "0", "2023-10-13T03:31:31.892000+0000", "https://www.reddit.com/r/PokemonScarletViolet/comments/176pfwq/problems_with_herba_mystica/", "I've been looking for Herba Mystica since the earliest time I could access and beat 5 star raids. I always go for the Blissey ones, because they both drop Herba Mystica, and honestly are the only ones I've found I can reliably beat. I can say for a fact that I've done over thirty of them, but never once have I gotten a single Herba Mystica. All I get is shards and experience candies, nothing else. At this point, I'm sick of it. Should I just give up on trying to get literally any Herba Mystica, or is there something else I should be doing? This isn't working and I am at wits end, and about to just ditch Raids and go back to wandering around Paldea and failing at Outbreak hunting.    "], ["Who also is having performance problems with the new Fenix?", "32", "21", "2024-03-01T16:27:21.337000+0000", "https://www.reddit.com/r/flightsim/comments/1b3yg9s/who_also_is_having_performance_problems_with_the/", "Since the new update my performance with the Fenix has gotten really bad. I have a 4070ti and i7 12700k and never had any problems with the plane until now. Did I miss something? I reinstalled the plane and also tried 4k textures instead of 8k    "], ["Issue with: Your Candiness, King Candy!", "8", "17", "2024-06-01T20:23:16.345000+0000", "https://www.reddit.com/r/DisneySpeedstormGame/comments/1d5vyhb/issue_with_your_candiness_king_candy/", "I attempted this even today and after being first for the vast majority of the race, suddenly a super fast Figment appeared miles ahead on the map. This was only on expert mode while I was farming for capsules with Sergeant Calhoun. Has anyone else experienced this? I was definitely first for the entire race and then suddenly it changed to second and Figment magically appeared, and no I didn't miss him overtaking me.    "], ["Issue with rare candy cheat", "3", "3", "2024-05-02T08:28:50.545000+0000", "https://www.reddit.com/r/PokemonLegacy/comments/1ciahx1/issue_with_rare_candy_cheat/", "I used smithplays crystal legacy rare candy cheat and it bugged out my game badly.. it deleted all the items from my bag and made it so i couldn't buy any items because it says my bag is full for reference here is the code: 01209ED8 01999FD8, weirdly i can scroll underneath the cancel button but when i get to the bottom my game crashes. going in to the elite four so i really need healing items to heal after the fights.. Can anyone help????    "], ["Issue with unlimited candies in randomized fire red", "4", "1", "2024-06-28T17:50:31.707000+0000", "https://www.reddit.com/r/nuzlocke/comments/1dqpqxc/issue_with_unlimited_candies_in_randomized_fire/", "I have trouble cheating rare candies into my randomized fire red file. I've tried codes for normal fire red (820258400044) and for emerald version (BFF956FA2F9EC50D) as if it could work. I've tried a code for randomized files and it still didn't work. I don't know what's the issue. I'm using VBA 2.0.1. Can somone help?    "], ["Potential issue with Eye Candy pigments paste", "2", "2", "2024-06-05T15:45:27.096000+0000", "https://www.reddit.com/r/DiceMaking/comments/1d8t57o/potential_issue_with_eye_candy_pigments_paste/", "Hello everyone! I bought some pigment pastes from Eye Candy last month and just opened the box today. I was planning on using their Satori white paste but after unsealing the pot, it turns out that the paste was actually solid. And I don't mean 'slightly slimy and you just have to stir for a while', I mean rock solid I can't even start stirring. Is this a know issue? Out of the 9 pots I bought, 7 seem unusable.    "], ["Anybody else having an issue with Candy Cane body butter?", "13", "3", "2023-12-07T16:05:00.248000+0000", "https://www.reddit.com/r/traderjoes/comments/18cyudu/anybody_else_having_an_issue_with_candy_cane_body/", "I recently bought this and have used it twice. Each time after rubbing it into my skin for about 30 seconds, it starts clumping together and leaves these weird balls of gunk all over my skin. I think it's the shimmering mica doing that? Also wish it had more peppermint smell. I have no issues with the pumpkin body butter and love that one.    "], ["The issue with move evolutions", "17", "245", "2024-06-15T15:44:00.496000+0000", "https://www.reddit.com/r/pokerogue/comments/1dgkt4d/the_issue_with_move_evolutions/", "I've been grinding Clobbopus candies since the change to its passive. The evolution requires you to level it while knowing Taunt, the problem with this is that you have to overwrite one of its 4 egg moves which is then gone forever. This also goes for Steenee needing to level while knowing stomp, I wish the devs would make it so we can relearn egg moves with the memory mushroom or ideally just scrap move requirement evolutions entirely. Clobbopus learns taunt at level 35 so why not just change the evolution requirement to level 35?    "], ["What's the issue with Bewear?", "66", "588", "2023-12-20T00:21:19.939000+0000", "https://www.reddit.com/r/TheSilphRoad/comments/18mgxo1/whats_the_issue_with_bewear/", "Kyurem had an accidental release, so it makes sense. But does someone know why Bewear is banned?    "], ["Yes Emily, its Trump's \"style\" of calling out Mika Brzezinski's appearance that Democrats have an issue with.", "109", "12", "2024-05-29T18:25:01.865000+0000", "https://www.reddit.com/r/BreakingPoints/comments/1d3j4lv/yes_emily_its_trumps_style_of_calling_out_mika/", "https://youtu.be/e4cQKknzc8I?si=mzf7q3JMXiATuGlJ  I hate when people boil down the other side's arguments to a ridiculous point of view. Breaking Points as a whole seems to struggle with this concept but I have very justified rage at Trump because he tried to steal my vote for THE PRESIDENTIAL ELECTION OF THE UNITED STATES OF AMERICA. Not a car, not a candy bar, not money out of a street performer's jar, THE US PRESIDENTIAL ELECTION. I don't care that some of the coverage of January 6 is over blown, I want him to pay for that crime, and that is not irrational and I'm tired of listening to people pretend that it is, or completely overlook that sentiment by inferring I'm only mad because I give a sh$t about Mika Brzezinski.    "], ["Already starting to notice an issue with the fold 5", "78", "13", "2023-08-07T02:21:59.224000+0000", "https://www.reddit.com/r/GalaxyFold/comments/15k7rmk/already_starting_to_notice_an_issue_with_the_fold/", "Hey folks, i've recently acquired my first foldable phone and I was pretty anxious about all the things I read online about the inner display, hinge, weird noises or display suddenly failing. I've had my Fold 5 since august 2nd and a few hours ago the phone started to do some kind of a \"pop\" sound when ever I unfold it. At first I was very surprised about the form factor but now it's starting to just turn into a bad experience and anxiety. I'm still under the 30 days return policy at my carrier so I think I might just go with a normal candy bar phone.    "], ["Anyone else is having this display issue with raids?", "7", "0", "2024-03-05T20:29:58.478000+0000", "https://www.reddit.com/r/PokemonScarletViolet/comments/1b7fnmw/anyone_else_is_having_this_display_issue_with/", "Sometimes when I do raids in one place, the rewards screen will display like if I was doing raids in another place. Sometimes it fixes itself on it's own but sometimes it stays for a while.. Not a major issue, but has anyone else had something like this happen to them lately?    "], ["Issue with claiming extras", "1", "2", "2023-12-05T19:22:25.260000+0000", "https://www.reddit.com/r/candycrush/comments/18bjvxy/issue_with_claiming_extras/", "Anyone else having this problem? It's not my internet connection and I've re started my phone and the game multiple times    "], ["Issues with the Rare candy guy in Viridian", "12", "4", "2023-12-20T10:37:52.862000+0000", "https://www.reddit.com/r/pokemonradicalred/comments/18mrp1k/issues_with_the_rare_candy_guy_in_viridian/", "I'm using the in-game Rare Candy cheat but after defeating Blane, everytime i talk to the guy who hands out the candy the game freezes after he gives the Pomeg Berry.  I can't A to speed up the dialogue and i can't move or open the menu. Anyone else who has the same bug? I'm playing on the My Boy emulator btw.    "], ["Is anyone else having issues with not receiving candy?", "4", "0", "2024-03-29T03:21:08.363000+0000", "https://www.reddit.com/r/pokemongo/comments/1bqf4xg/is_anyone_else_having_issues_with_not_receiving/", "I am 100% sure now that I am not always receiving candy when I catch a pokemon, I just checked with winpod I pinapped it and I had 138 before I caught it, after a linap catch,   still 138.. I was suspicious after checking my candies for about 15 mons that I was absolutely certainy candy counts were off on. Kind of like extremely frustrating -.-\"    "], ["Issues with Cram o matic?", "4", "0", "2024-06-18T21:21:52.955000+0000", "https://www.reddit.com/r/PokemonSleep/comments/1dj1wfk/issues_with_cram_o_matic/", "I am not sure if I missed something in one of the infographics or in the app itself. I used the machine successfully yesterday by taking Venus or Candy and converting it into grass candy. But when I tried to use it today, my Sudowoodo candy converted to fire candy and then my Eevee candy converted to fairy type Candy. Am I missing something on why I am not getting the type that I am looking for?    "], ["Anyone having issues with Vistar supply shortages?", "21", "17", "2024-06-28T15:39:05.134000+0000", "https://www.reddit.com/r/MovieTheaterEmployees/comments/1dqmm2p/anyone_having_issues_with_vistar_supply_shortages/", "We're literally running out of candy, soda syrup, etc., and Vistar seems incapable of fulfilling even small orders the past month. Any other people here having this issue?  I'm not management so I don't know specifics.  But it's about to bite us in the ass this weekend.    "], ["Issues with cheats", "4", "1", "2024-05-01T10:30:22.373000+0000", "https://www.reddit.com/r/pokemoncrystal/comments/1chit8o/issues_with_cheats/", "I used the rare candy cheat that SmithPlays put in his description of his Nuzlocke and it really broke my bag. I want to evolve my scyther, but i cant buy the Metal Coat because it says my bag is full. When i removed the rare candy for good, there are a bunch of empty slots underneath the cancel button, which when i get to the final slot it crashes my game. Any way i can fix this lol??    "], ["Issues with evolutions", "5", "1", "2024-05-02T13:48:50.942000+0000", "https://www.reddit.com/r/pokemonradicalred/comments/1cig574/issues_with_evolutions/", "I've used the rare candy hack to save time on grinding up my teams for each gym, however when I use them and a Pokemon evolves it often freeze my game, just wondering if anyone has a similar issue/knows a work around or fix    "], ["Issues with Freemans treasure ", "11", "2", "2024-03-15T17:39:21.535000+0000", "https://www.reddit.com/r/SkullAndBonesGame/comments/1bfjodz/issues_with_freemans_treasure/", "Follow up to the previous post. I've now been able to dig up the chest on bukit candi but it still doesn't show the Freemans treasure as complete. Still say to search the ocean for clues. All 7 are complete and the 2 from premium.  All are ticked as complete and I read all clues multiple times.    "], ["Anyone else having issues with the 2km?", "30", "36", "2023-07-29T02:23:10.654000+0000", "https://www.reddit.com/r/PokemonGoMystic/comments/15cgf3o/anyone_else_having_issues_with_the_2km/", "I know I've walked at least one because my magikarp has gotten candy twice now. Just curious if anyone else had the same issue / fix    "], ["WYR a magical fairy comes right now and fixes all current physical issues with your body OR get 1 million dollars at a random unknown point in the next ten years?", "88", "35", "2024-06-09T05:13:25.465000+0000", "https://www.reddit.com/r/hypotheticalsituation/comments/1dbm3d9/wyr_a_magical_fairy_comes_right_now_and_fixes_all/", "Option A: Any physical/medical issue you have will magically be cured and will not return unless you cause it to. Anything from a cavity or a cold to diabetes or cancer is taken care of, no pain and it's instantaneous right now. You can still get sick with the some things again if you do something to cause it (ex. You can still get cavities in the future if you eat nothing but candy) but anything you have going on right now is fixed. Includes mental illness. Option B: At some point in the next ten years, you will receive a check for one million dollars. You have no idea when, or how you will receive the money. It could be tomorrow or on the last day of the last year in the next decade. All you know is that you will definitely get it at some point. No taxes, just instant deposit whenever you get it. There is also no way to know if you will live the full ten years for sure, you have to assume you will- it's not guaranteed.    "], ["Issues with vegan butter when making vegan caramel", "25", "9", "2023-11-10T15:17:43.568000+0000", "https://www.reddit.com/r/veganrecipes/comments/17s65r8/issues_with_vegan_butter_when_making_vegan_caramel/", "Hi, reddit--- Every time I try to make a sugary syrup with vegan butter (first time I tried was for candied sweet potatoes, but I've tried caramel too), the butter separates.  I'm currently using earth balance soy free butter. I saw on a vegan baking blog that I may need a silver bottom pan rather than a nonstick? But wasn't sure if anyone had tips or tricks with this. Thanks!!    "], ["Issue of buddy candies not increasing while walking", "9", "1", "2024-06-26T13:17:29.747000+0000", "https://www.reddit.com/r/PGSharp/comments/1doyebs/issue_of_buddy_candies_not_increasing_while/", "So while the walking distance increases in the candies indicator of buddy page and then resets again at 0km after completing the required distance, the candies dont increase. I'm stuck at 399 magicarp candies for 5km now and im at my wit's end. Does this happen to anyone else?    "], ["Help! Trouble with Cotton Candy ð\u009f\u008d­", "3", "1", "2024-01-30T06:27:26.373000+0000", "https://www.reddit.com/r/CandyMakers/comments/1aehvyh/help_trouble_with_cotton_candy/", "I've been trying to mix my own flossugar using Gold Medal Flossine and granulated sugar, but the spun sugar isn't giving the results I want.   The spun cotton candy comes out with barely any of the Flossine's flavour and next to no color. I'm following the ratio Gold Medal provides of 2 tablespoons Flossine to 10lbs granulated sugar. Looking online (linked below), it seems that changing the ratio of Flossine to sugar could damage the cotton candy machine, but I'm not sure what else I could do. Some advice I've seen online also suggests that dry flossugar could lead to colourless cotton candy, but even after adding moisture to my own flossugar the candy turns out with only minor improvement in terms of color and flavour. I've used the ready-to-use kind of flavoured sugar already which does yield colourful cotton candy with good flavour. Thanks for any advice! TL;DR: tried to mix my own floss sugar using Flossine concentrate, but it's coming out basically white and flavourless  https://www.katom.com/learning-center/use-gold-medal-flossine-flossugar.html     "], ["The trouble with tribbles", "26", "184", "2024-06-29T01:58:35.692000+0000", "https://www.reddit.com/r/fountainpens/comments/1dr0b19/the_trouble_with_tribbles/", "Pink mold. A first for me. Seems almost a shame to get rid of this cute growth. To think the ink is Noodler's Akhmatova, a dark moss green ink.    "], ["Trouble with Zygarde cells", "142", "75", "2023-07-20T22:54:05.788000+0000", "https://www.reddit.com/r/TheSilphRoad/comments/15561c2/trouble_with_zygarde_cells/", "Title.. me and my wife did around 7 routes today. I found 1 single zygarde cell enough to advance the quest to the next step, but she hasn't seen a single one of them and I got mine on the first route near the end of it and haven't seen a single one yet since. Looks like it's gonna be a loooong road of route walking to achieve the final evolution to this guy. As zygarde cells are only found while walking / exploring routes. Is anyone else having bad luck with zygarde cells?    "], ["Am i alone? I had a weird ED - all desserts qnd candy tasted bad and the same. Had no trouble with other types of food.", "1", "1", "2024-01-02T12:14:18.813000+0000", "https://www.reddit.com/r/eating_disorders/comments/18wo25n/am_i_alone_i_had_a_weird_ed_all_desserts_qnd/", "Am i alone in this? When it is not about all food or even the ammount of it, but the taste of a particular type of food. It is an ED for sure. I am sick and tired of people dismissing it. Even if it does sound made up. It was not. Every dessert or candy i tried to eat tasted horrible to me. And no matter what flavour it was suppose to be, they were all the same to me. Important to note - I had no trouble liking sugar as long as it was not in a form of a dessert. Loved and love fruits, nuts, yogurts. Was almost addicted to sugar high sauces like teriyaky. I do not have and never ever had any problems with sugar levels in my blood. It was only if it was a dessert with sugar in it that i had a problem. I never cared much and still don't care much about my weight. I never gave it much thought untill very recently. I've gained 6 kilo since i started eating desserts and my clothes fit weirdly, so i do think about it, but i will not restrict my diet. I refuse to. I would rather change my whole wardrobe than stop eating desserts now that i got rid of my distaste for them. I think i know how i got it: My gramma and grandpa had horrible teeth and both lost over half by 50. Another gramma died from diabetes. Grandgrandma died from stomach cancer. All that made my gramma and my mom obsessed with eating healthy. That included demonizing desserts and candy in all forms. As a kid i had non-stop nightmares that would go for weeks and all were about how my teeth fell out. Mom used to say \"if you eat more than one candy a day, all your teeth would fall out\". I have to add that my parents were abusive (emotional and narcissitic abuse). So anytime i ate candy or cake - they all tasted the same, no matter the real flavour. It was like eating paper with raw sugar or sand with raw sugar, etc. depending on the texture. Just strawberry with creme - delicious, in form of a cake - cotton with sugar. I got rid of it around 2 years ago, by age 27. After gramma died i was a zombie for 2 month - felt nothing, wanted nothing, cared about nothing. I also didn't have my period. One day feelings slowly started to come back and i discovered that desserts taste amazing. I felt dazed. All of a sudden chocolate cookie was not the same as plain cookie or a fruit cake. I started feeling coco, nuts, cinnamon in desserts. Biggest shock was that different bars from chocolate brands taste different. I always thought i was lucky to not have any cake or candy cravings, but, gods, i missed so much! Simething in my heaf was seriously broken! I have trouble finding support, because living sugar free is a health goal for so many and for me it was my life. Everyone kept telling me how great i am for avoiding cakes or cookies. It saved me a tonn of money and i only ever had 1 bad tooth, a milk one. I was always the only kid with 0 need for some dental treatment and dentists praized me. Add to that praize media demonizing sugar, everyone being on \"no cake\" diets all the time - and you have my total certainty that hating desserts is the greatest thing ever. It felt like a win for so long. Like i was lucky. It still does in a way that my problem is very small and is not that dangerous compared to other eating disorders. But i also could have had so much more joy in my life. I still can not eat more than 1 slice of cake at once, but at least i don't feel nauseous everytime i do. Am i alone? Did anyone have something simular?    "], ["Trouble with complicated permutations problem", "6", "2", "2024-03-07T12:17:08.837000+0000", "https://www.reddit.com/r/learnmath/comments/1b8t8he/trouble_with_complicated_permutations_problem/", "I've got a math problem I think has to do with permutations but is slightly more complicated. Can anyone help me find a formula? There are 20 candies in a jar. 2 of them are toxic and will kill you. We have to pick and eat 6 candies. What are the odds we die? Thanks guys!    "], ["Anybody else having trouble with nicknames and Eevee-lutions? This should be an Umbreon", "12", "0", "2024-06-08T03:25:09.256000+0000", "https://www.reddit.com/r/pokemongo/comments/1dathif/anybody_else_having_trouble_with_nicknames_and/", "First try gave me a Jolteon, this one gave a Flareon    "], ["AITA for getting in trouble with my boss?", "11", "7", "2023-12-18T02:10:43.061000+0000", "https://www.reddit.com/r/AmItheAsshole/comments/18kxnim/aita_for_getting_in_trouble_with_my_boss/", "I (24F) work at a well known wax museum in Hollywood (you might guess which one), once a day or sometimes every now and then I'd take a banana or two from the tray they provide forbthe employees to take and eat; also the mini candy bars in a glass jar. One day just before leaving, one of my managers asked to see me in my boss's office, so I followed behind and sat next to her, facing my boss. His face was stern, not his usual happy-go-lucky self. He explained that one of the employees reported to them that I had been taking advantage of eating too many of the bananas, and said they were for all coworkers. I didn't understand because normally I just have one. He also explained that I had been taking handfuls of the candy from the jar, when I took only two pieces and by the time I'm on break, the jar is nearly empty. I don't know what I did wrong, though I didn't want to explain to him that nor explain to him that I was a working homeless person who is always hungry. Normally a banana or two keeps me going until dinner and then I use my paycheck to buy myself something. They don't pay me much, and I don't want them firing me because of my living situation or my hunger. So, AITA?    "], ["Trouble with a 20 bomb", "16", "0", "2024-05-21T15:04:43.587000+0000", "https://www.reddit.com/r/apexlegends/comments/1cxa2jf/trouble_with_a_20_bomb/", "So, those of you that are good at the game and get 20 bombs do you think you should be able to get a 20 if you can deal 4k damage ? I just had my 6th 4k game yesterday but just like every other time I fell short of 20. This time with 16 kills, my best is 17, I'm going insane lol I just want the damn badge.    "], ["Struggling with the new extreme trial? Welcome to Candy Land.", "28", "80", "2023-10-07T05:33:19.018000+0000", "https://www.reddit.com/r/ffxiv/comments/171ye06/struggling_with_the_new_extreme_trial_welcome_to/", "false    If the X's appear in a \"candy cane\"-esque formation, the melee safe side will be on the right. If the X's appear in an L (or three equidistant columns) formation, the safe side will be on the left. The specific safe spot will be hugging the north wall, west/east wall, or in a corner depending on each specific formation.     "], ["Struggling with people who only care about the baby now.", "34", "88", "2024-05-19T14:55:34.998000+0000", "https://www.reddit.com/r/Mommit/comments/1cvq3jg/struggling_with_people_who_only_care_about_the/", "Does this get better? I have a 6 month old, and I swear that to some people I'm now just a vehicle for them to see my baby. It feels shitty. The best analogy I've seen is that I feel like a candy wrapper. Baby is the candy, while mom is the wrapper that's discarded. Some excited family members are constantly texting that they â\u0080\u009cneed to come over to see [baby's name] soon!â\u0080\u009d and that they â\u0080\u009cmiss [baby's name]â\u0080\u009d and plan to visit him (not â\u0080\u009cusâ\u0080\u009d) weekly. It feels like I only exist to facilitate their visits now. When I see them it will sometimes be 30 minutes to an hour before they remember their manners and give me a low effort acknowledgment.    "], ["if youâ\u0080\u0099re struggling with chocolate cravings", "23", "36", "2023-08-17T15:11:19.570000+0000", "https://www.reddit.com/r/caloriecount/comments/15tqbo6/if_youre_struggling_with_chocolate_cravings/", "these are 170 calories each, but still less than candy or hershey's! definitely feels like you're eating a chocolate mousse candy bar, soft and quite filling unlike candy that just makes you want to binge on more and more. i can find them in most stores like mejier, target, fresh time, etc. highly recommend if you hate the chewy protein tasting protein bars, these taste like a candy bar!    "], ["Struggling with Ultra league", "27", "16", "2024-03-10T00:16:21.917000+0000", "https://www.reddit.com/r/TheSilphArena/comments/1bawkv3/struggling_with_ultra_league/", "Im mainly struggling with ultra league right now because I can only afford one team of pokemon Giratina Shadow Machamp Venusaur All but giratina have their usual moveset with giratina only having dragon claw Im not a good team builder, and the teams that are seeing a lot of results right now are pokemon I dont own, don't have a lot of candys with Any team I can make by grinding out incenses with the catchpool we have right now?                    "], ["Struggling with inflation ", "11", "6", "2024-05-08T15:25:51.403000+0000", "https://www.reddit.com/r/vending/comments/1cn7bm5/struggling_with_inflation/", "Is anyone else struggling with making an actual noticeable profit? I got my prices set at for bottled pop $1.25, cans $1.00, candy $1.50 and snacks at $1.00â\u0080¦â\u0080¦. I'm thinking about going up $0.25 on all products across the board. Due to after I buy stock. Fill the truck up, and pay insurance. It feels like I only have $200 of profit a month.    "], ["For all those struggling with black coffee", "148", "221", "2024-04-11T21:04:51.009000+0000", "https://www.reddit.com/r/intermittentfasting/comments/1c1qadu/for_all_those_struggling_with_black_coffee/", "I've been seeing multiple posts here about poor folks struggling with switching to black coffee. Perhaps this might help. I switched to black coffee many many years ago - way before I even knew what intermittent fasting is - and would never go back.   Don't 'lower the amount of milk/cream'. It's like using a nicotine patch to stop smoking - not only does it not help you but also takes the satisfaction out of the process. Just leave it out. Go big or go home.   I think this is the most important. Find. Good. Coffee. Crap coffee is just that, crap. When you have it with milk/cream, the crap flavour gets masked but with black coffee there is no pretending, you get the horrible taste slapped in your face with full power. This might take some time and experimenting but it will be worth it. Leave that instant mud to your past self. Note, good coffee does not always mean expensive. Starbucks is the pitfall of current generation not being able to afford housing (apparently, that and avocados) and their coffee is only bearable with 17 pumps of caramel, other than that it's frankly trash.   This is related to 2. in an effort to help find the 'good coffee'. Get dark roast. Look for flavours (note, not flavoured coffee, but the body of the coffee) such as dark chocolate or nuts. That will give you the rich, smooth taste and beautiful almost sweet coffee aroma. Avoid at all costs flavours that include fruits and flowers. This will bring our the acidity and make you want to spit out the very first sip and brush your teeth for at least 30 minutes.   Have some water. Have some just slightly below room temperature (not cold, we don't want cold with hot coffee) sparklingly water.   Indulge in the bitterness. Yes, not all coffees are equally bitter. Some are less and some are more. But like I said at the beginning, go big or go home. The first will make you shiver. The second will make you scrunch your face. The third will be just about getting to used to it. Fast forward you'll be craving the beautiful bitterness. Sour candy? They're so painful but so delicious.   Try having the coffee during your eating window with a bit of dark chocolate first. They complement each other really well and it might help with the transition.   Good luck! I'll be keeping an eye out for more black coffee hating posts while drinking my beautiful black coffee feeding my black soul (: EDIT to add that I have thoroughly enjoyed reading this coffee discussion - thank you all for tips and ideas! I wanted to address some comments here, particularly the ones challenging dark roast. Some people need to take a chill pill with their coffee (: honestly, you do you, drink whatever makes you happy. If coffee does not make you happy, just don't drink it. Nothing really is a one-size-fits-all. I recommend dark roast because it's lower on acidity (due to the roasting process as well as the body flavours) which I have seen raised as a challenge on this sub. It does not taste burnt if you have good quality coffee and don't burn it when brewing it. Also, light roast tastes like water to me. Again, this is a personal preference and an attempt at being helpful. If you need to roast me for it, at least make it dark (: As for (my personal) recommended coffee, this really depends. Please note that I love strong, smooth and bitter. Just the thought of it gets me out of bed every morning. Where I am located, my fav would probably be Milano's Black Beauty. For more widely accessible and affordable, I have actually quite enjoyed some Costco coffees - East Africa dark roast or Kirkland Colombian. Lavazza is also fairly good although I only like it as a machine made espresso. In Europe - honestly, any non-chain coffee shop is likely to have good coffee. Keep up the good work fellow fasters and coffee drinkers!    "], ["Why is this what Iâ\u0080\u0099m struggling with?", "40", "10", "2023-12-05T03:49:38.329000+0000", "https://www.reddit.com/r/BaldursGate3/comments/18b3055/why_is_this_what_im_struggling_with/", "false  Am I the only one who is having to look up a GUIDE to romance Astarion? It's so freaking hard. I am literally having to look up a guide so that I can get a high enough approval rating. Gale and SH give theirs out like freaking candy.    "], ["Struggling with A Starstruck Odyssey ", "30", "9", "2024-06-05T19:35:52.082000+0000", "https://www.reddit.com/r/Dimension20/comments/1d8yq15/struggling_with_a_starstruck_odyssey/", "Ok so. I found D20 about a year ago (weirdly started from Crown of Candy), and since then I've slowly watched almost all of the seasons, forcing myself to go on a slower pace instead of binge watching everything all at once to kinda have more content spread out for a longer period lol. I know that A Starstruck Odyssey is generally very loved here, and I've seen a lot of people ranking it as their favorite. So I had high hopes and was very excited to finally start watching it. However, I've kinda been struggling. I can't really put my finger on the reason why, but I am not hooked in the way I usually am with the Intrepid Heroes seasons. I love their characters, Murph as Barry Syx might be my all time favorite and Zac is just killing it, but the story somehow just doesn't... I don't know. I have started episode 7 a couple of times, but I have not made it through. I know not everyone loves the same things, but did anyone else feel this way and later on fell in love with it? Was there a specific moment that was the turning point? Idk, I just want to love this season as much as everyone else.    "], ["Boyfriend set this stuff up because I was struggling with Halloween spirit this year.", "17", "208", "2023-11-01T01:39:52.539000+0000", "https://www.reddit.com/r/MadeMeSmile/comments/17l16k9/boyfriend_set_this_stuff_up_because_i_was/", "I have had a very rough October and I'm usually one to decorate or prepare haha. As my partner was driving home, we actually got trick-or-treaters. I panicked and wanted to have candy here because we had nothing close to give out (last year we had no trick or treaters). I was also bummed we didn't get pumpkins due to some things coming up that took priority, but he manager to find some small ones at Kroger the night of! It is nice after dealing with so much life stuff along with other world stressors happening to have this really sweet Halloween moment I was craving. Especially since he whipped out the decorations and put them out just for tonight. Carving small pumpkins, giving candy out as kids are actually out this year, and watching Hocus Pocus with some hot chocolate has been such a needed moment. I just had to share!    "], ["Help needed! We're on a quest to create a candy kingdom!", "18", "10", "2024-02-12T08:46:03.199000+0000", "https://www.reddit.com/r/inkarnate/comments/1aovkon/help_needed_were_on_a_quest_to_create_a_candy/", "We're on a quest to create a candy kingdom. We need mountain ideas! Thus far we have ice cream cone, Toblerone and not pictured is fairy bread mountains! What ideas have you got for us?? Assets have been hand drawn so get as creative as you like! Thank you in advance for any that help inkarnaters x    "], ["I want to send my person some candy! Help needed!", "17", "8", "2023-11-10T17:52:24.617000+0000", "https://www.reddit.com/r/LongDistance/comments/17s9lqc/i_want_to_send_my_person_some_candy_help_needed/", "Hey fine folks! So I am in the UK and my person is in the US. I tried searching for delivery services and stuff but I just keep getting local results for ordering american candy here in the uk! They are missing out on an event because they are working and they want the candy that ges given out for free so I would like to surprise them by sending them some candy! Does anyone know a service that will let me do that? Someting like uber or doordash would be geat if i could send it to a US address, but I am open to something that is slower too! Thanks in advance folks! all the love!    "], ["Pvp help needed", "7", "0", "2024-06-18T18:28:04.298000+0000", "https://www.reddit.com/r/pokemongo/comments/1dixr8e/pvp_help_needed/", "Hey guys, I'm asking for help on my current PVP team. I'm struggling to get consistent wins, I am saving up rare candies to put a second move onto Mewtwo, however I'm unsure as to what move that would be. Should I go for Ice Beam or Shadow Ball? I have 83 rare candies currently. Last pic are my strongest Pokemon atm. Thank you in advance!    "], ["Nude glitter ombre nails (& brush cleaning help needed)", "14", "27", "2024-06-08T08:27:44.046000+0000", "https://www.reddit.com/r/DipPowderNails/comments/1day77w/nude_glitter_ombre_nails_brush_cleaning_help/", "My favourite set I've done so far - it created a huge mess, but I think it was worth it for the sparkles. On that note - does anyone know the best way to clean the brushes I used? Everything has glitter on it and I don't know if I want glitter in every single set from now on ð\u009f«£ (I used Doonails Cotton Candy & Apricot Glam)    "], ["Help Needed for Pokemon Wack", "0", "1", "2024-06-24T20:22:50.539000+0000", "https://www.reddit.com/r/cheatengine/comments/1dnndr0/help_needed_for_pokemon_wack/", "I've played Wack a while ago, and now want to start off afresh using C.E. I've already gotten Max Money down, and I'm certain about anything requiring walking, but I have no idea what the values are for the items since they've overhauled everything. Basically, any help to be able to get at least Rare Candies would be appreciated.    "], ["caramel braise help needed!", "36", "32", "2024-05-14T14:22:11.092000+0000", "https://www.reddit.com/r/AskCulinary/comments/1crte3z/caramel_braise_help_needed/", "There is a milk street recipe for caramel-braised chicken with ginger and lime that I've been making for years around 1x month. I've made some of my own modifications for flavor purposes and the end result each and every time is superb. BUT. the very first step with this dish is to make a caramel sauce. I'm definitely on the more advanced side of a home cook and have a strong grasp/ understanding of food chemistry and culinary techniques, but beyond this dish I don't ever go near the heated sugar/caramel/candy area. I've used most often an enameled cast iron pan (le creuset) or just a standard lighter weight metal pan. I've had success and failures in both. The caramel is made of coconut water and white sugar. (I use either goya or iberia coconut water and strain out the pulp)   You combine 1 TBS coconut water + 1/4 cup of white sugar over medium-high heat. Bring to a boil, stirring occasionally until mixture turns gold at the edges   they say this takes ~3 minutes... I find it takes a bit longer     Reduce to medium, continue to cook, swirling the pan without stirring until the caramel is mahogany in color and smokes lightly another 4-5 minutes   at some point in this second stage of cooking is the turning point to crystals, or the desired outcome     Even though I'm usually able to rescue it (sometimes I'm not and they crystallization is too extreme and I just start over again) around 60% of the time I make this, the caramel starts to crystalize. It seems random and I really don't know why sometimes I end up with the desired liquid mahogany, and other times its a mixture of undercooked crystal that I rescue with the subsequent steps of adding more liquid. I don't know if it is something related to heat, timing, ingredient properties, the pan I'm using... If anyone has any tips or insight into what I might be doing wrong or how I can more consistently end up with a liquid rather than a crystalized product it would be very much appreciated!!!!    "], ["Help needed with team for great league from my list", "2", "1", "2023-11-28T10:11:19.152000+0000", "https://www.reddit.com/r/PokemonGOBattleLeague/comments/185sqp3/help_needed_with_team_for_great_league_from_my/", "Hey, Since at least 3 months i got into battle league in pokemon go and loving it so far. I might even say that its what keeps me playing PoGo nowdays. I reached 2270 rating this season max but hit the wall there and been struggling since and bouncing from 2100-2250 in open great league. I had fun in catch league as the XL meta mons where less common. I know the basics of pvp IV's, shields, baits ect. and team building basics of core duos, abb aba or abc teams but been struggling to build a decent team to climb a bit higher. Do you guys have any suggestion on a team from my list? Take into account that while I do have a few charge and fast tm that i can use, I dont have any elite ones. Also Im far from making a XL mon yet for the league. I do have some work-in-progress mon's too. Been having fun with S dragonite tank tank team (tanks were chosen from afisk, clod, jelli, whis or umbreon) but this is super polarising team as its either hard loss or win. Ive been looking for something more consistent. TLDR: Help me out to make a decent team out of the list. Also any tips on team building strategy would be welcome. Below a list of my mons, sorry for the format. name/CP/GBL IV %/attacks Toxicroak  1500\t96,3\tc/Mb/Sb Whimsicott\t1500\t98,2\tFw/Mb/Sb Pidgeot\t1499\t95,8\tAirS/Fd/Hurr Victribel\t1486\t80,1\tRL/Lb/Sb Umbreon\t1485\t97,3\tSn/L r/Fp  Dragonite(S)\t1480\t78,22\tDb/Sp/Dc Quagsire\t1479\t84,8\tMs/AqT/Se Altaria\t1477\t69,4\tDb/Sa/Dp Whiscash\t1500\t92,9\tMs/Mb/Blizz Golbat\t1499\t60,6\tWa/Pf/Sb Gligar\t1494\t45\tWa/Dig/Ns Steelix\t1494\t54\tDt/Pf/EarthQ Perrserker\t1492\t74,4\tSc/P r/Fp  Jellicent\t1492\t79\tHex/Sb/Surf Clodsire\t1491\t40\tPs/EarthQ/Sb Slowking\t1490\t48,4\tWg/Psy/Fb Clefable\t1487\t63\tFw/Psy/MM Gengar\t1485\t85,1\tSc/Sb/Sp gStunfisk\t1480\t60,6\tMs/Rs/EearthQ Work in progress mons: Lanturn\tneed good IV pok aSandslash(S)\t1479\t89,4\tPw/Ip/none Dewgong\tcandy\t83,1\tFb/D r/none  Victribel(S)\tC tm\t99,2 Altaria\tcandy\t90,8 Bastiodon\tcandy Sableye\tneed XL candy Medicham\tneed XL candy Lickitung\tneed XL candy Pelliper  need second move    "], ["Avatar Help Needed!", "5", "0", "2023-12-28T02:31:22.542000+0000", "https://www.reddit.com/r/CookieRunKingdoms/comments/18siom4/avatar_help_needed/", "I've been using the new avatar team but I've been hitting the wall that is the spheres hit Madeleine Cookie and stun him so I'm unable to use his ability before the silence. I've tried it multiple times but they just keep getting stunned. Is it to do with his Magic Candy? Please help! :)    "], ["Mono Ground Help Needed", "6", "1", "2023-11-19T16:25:50.264000+0000", "https://www.reddit.com/r/pokemonradicalred/comments/17z0smv/mono_ground_help_needed/", "Stuck on Erica with the mono ground run. Normal rules for everything, I am using infinite rare candy, dexall and ez catch so anything you can get before Erica is on the table. Any tips?    "], ["Autism warriors I need help finding candy that taste like anti acid meds", "195", "823", "2024-05-09T04:44:32.479000+0000", "https://www.reddit.com/r/evilautism/comments/1cnoxf2/autism_warriors_i_need_help_finding_candy_that/", "THEY'RE SO FUCKING YUMMY AND CHALKY BUT I CAN'T EAT MORE THAN 1 OR 2 A DAY PLZ I NEED THEM I'M SENDING OUT AN AUTISM BEAM    "], ["Need help identifying a candy.", "5", "1", "2024-05-14T01:00:12.570000+0000", "https://www.reddit.com/r/candy/comments/1crfnta/need_help_identifying_a_candy/", "Okay Reddit. I need your help identifying a candy I had but can't remember the name. I need to know if I'm crazy and made this candy up or if it's real. Anytime I mention it to friends, they act like I'm crazy. This candy I had in the late 80s possibly early 90s around Ky or TN. It was candy that was slightly crunchy like nerds but after you chewed it for a bit it turned to gum. It was kinda like a nerds rip-off in its presentation and boxing. It had two sides, one for each flavor, a red side and a purple side (similar to nerds boxes) and its box was yellow. DOES ANYONE KNOW THE NAME PF THIS CANDY!? I've been trying to remember it for 30 years? Please help Reddit! ð\u009f\u0099\u008fð\u009f\u008f»ð\u009f\u0099\u008fð\u009f\u008f»ð\u009f\u0099\u008fð\u009f\u008f»ð\u009f\u0099\u008fð\u009f\u008f»    "], ["Need help finding a candy", "0", "1", "2024-06-06T23:47:59.833000+0000", "https://www.reddit.com/r/candy/comments/1d9wtf1/need_help_finding_a_candy/", "I remember when I was a kid eating this Asian candy that was like a sticky purple plum center covered in sweet crispy sticky rice. Does anyone know what I'm talking about?    "], ["I need help finding this candy?!", "2", "1", "2024-06-05T19:00:06.510000+0000", "https://www.reddit.com/r/candy/comments/1d8xudj/i_need_help_finding_this_candy/", "So l need help finding this candy. Please I was too embarrassed to ask. So the first two letters are SO and the last two are KS. There is two lines in the name. The first line starts with SO. The second line starts with KS. The packaging is black and dark purpleish. There is way more black than purple. Since only the outline of the packaging is purple. The words are black outlined and white inside. I was some how able to get that number code on the bottom but not the CANDY NAME. Some numbers not all but it's extra information 0 3486 00019. I'm pretty sure it's sour and sparkling    "], ["I need help finding this candy?", "3", "0", "2024-06-05T18:58:36.025000+0000", "https://www.reddit.com/r/ask/comments/1d8xt1x/i_need_help_finding_this_candy/", "So l need help finding this candy. Please I was too embarrassed to ask. So the first two letters are SO and the last two are KS. There is two lines in the name. The first line starts with SO. The second line starts with KS. The packaging is black and dark purpleish. There is way more black than purple. Since only the outline of the packaging is purple. The words are black outlined and white inside. I was some how able to get that number code on the bottom but not the CANDY NAME. Some numbers not all but it's extra information 0 3486 00019. I'm pretty sure it's sour and sparkling    "], ["Need help finding a particular type of candy!", "5", "1", "2024-06-17T18:41:33.282000+0000", "https://www.reddit.com/r/JapanTravelTips/comments/1di5i8e/need_help_finding_a_particular_type_of_candy/", "Hi! I'll be traveling to Japan for the first time soon and I'm beyond excited. I have a coworker who went a few months ago and she fell in love with this one candy, so now she's asking me to buy some for her. Thing is, our other coworkers who already went can't seem to find these candies, and she herself said she was only able to find it at Haneda airport. I'd like to see if I can buy them other than the airport so I can pack them better. It's called Uji Matcha Strawberry Chocolate Truffle. It comes in those little green and white boxes with strawberries on them. Are they available at Donki? Thanks!    "], ["Need Help Finding a Childhood Candy!", "0", "0", "2024-06-06T04:47:50.473000+0000", "https://www.reddit.com/r/candy/comments/1d9a3rn/need_help_finding_a_childhood_candy/", "When I was a kid and was in minor league baseball the concession stand sold Super Ropes, but I have a memory of them having different flavors? I distinctly remember a blue rope with red stripe and a yellow rope with red stripe. This was around 2002-2005. I've been googling for years and can't find anything. Am I going insane or does someone know what I'm talking about?    "], ["Need help with remembering the name of a candy", "12", "9", "2024-04-08T22:56:45.995000+0000", "https://www.reddit.com/r/candy/comments/1bzc9et/need_help_with_remembering_the_name_of_a_candy/", "Hi all, There was this candy I used to have years ago. I remember buying it at Blockbusters and Best Buy whenever I was younger. I remember the container that held the candy was separated into two sections, one sour and sweet/cool. I believe the sweeter candy was blue while the others were multicolored or yellow. I believe the candies were circular shaped as well. I could never remember the name of the candy and have recently started thinking about it again and can't remember if it only had a limited run or if I'm misremembering the candy entirely. Any help would be greatly appreciated! Thank you!    "], ["Can't remember old candy from childhood. Need help.", "6", "6", "2024-04-09T21:37:21.373000+0000", "https://www.reddit.com/r/candy/comments/1c040wu/cant_remember_old_candy_from_childhood_need_help/", "There was a candy that was made when I was a child that was shaped like the miniature CO2 cartridges we have today. If I remember correctly, you could eat the whole thing? They were fairly similar in shape and/or size. Could have been chocolate? Maybe they were wax tubes filled with liquid candy? I can't remember too well. Anyone got some ideas?    "], ["Any help for farming star candies?", "13", "12", "2024-06-14T11:54:50.784000+0000", "https://www.reddit.com/r/Cookierun/comments/1dfp15q/any_help_for_farming_star_candies/", "I'm a returning player. I started in 2017 and after 2 years i've returned and everything is so different omg I returned 2 weeks ago and I can't properly farm for star candy, I need 930 star candies just for lollipop cookie and her pet, and still missing other 33 cookies Any tips except \"open gold chest\"? Bc it's kinda annoying in this way    "], ["Need help for candy raid", "0", "1", "2023-12-03T17:03:50.699000+0000", "https://www.reddit.com/r/allstartowerdefense/comments/189xuxz/need_help_for_candy_raid/", "Want to get mob 7 pls    "], ["Help for this toxic headache", "46", "3", "2024-01-06T13:26:35.496000+0000", "https://www.reddit.com/r/EpicSeven/comments/18zzyiu/help_for_this_toxic_headache/", "I've seen Aravi+Candy+Arowell so many times in GW lately i actually hate doing it anymore. In arena I see the same comp but with LR Krau added for an extra headache. I honestly have had no idea how to counter this effectively (I don't have my own Candy or ML Ken for reference), so any help would be appreciated.    "], ["Help for a Brewer/Gingerbread Witch", "5", "13", "2024-06-20T18:56:44.268000+0000", "https://www.reddit.com/r/Pathfinder2e/comments/1dkjgd6/help_for_a_brewergingerbread_witch/", "Hello everyone, I've recently started playing 2e with some of my best friends who are really into wtiches as a class and want to play like a coven (I know it Is suboptimal, but It's their First time and they Will all pick differenti spell lists so i there Is still a Little variety). One of them however, is really into making a magical Candy Witch, kinda like Gingerbread from 1e but without the cannibali staff. So naturally i suggested her to pick Cauldron, Double Double, Temporary potions; Using a bit of caution i tried to transpose Tricky Treats and Horrible Hunger as a Basic and Major Lessons with others food spells (to give her thematic hexes and good spells) and adapted Confection Conjuring and Gingerbread Familiar as feats. The main things Is that She would like her spells to be like \"baked into candies\". I suppose It would work kinda like Alchemist' s Infusions in 1e, where instead of casting she prepares candies at the start of the day. I'm more than Happy to have adapted the old Archetype (i loved It too). But I'm afraid this last things would make the game messier. Alchemist wasn't a full caster with huber spells, and giving infused spells would mean that all others party members would have to eat them and Remember everything (It's their first time and some of them specifically asked for a smaller inventory to not lose track of everything). I see where she comes from (all of them prefer roleay over combat and they all made strange but really flavoury decisions). So I wanted to ask if my feelings are correct, or if i can allow her this infused spells thing but only limited to some kind of spell? Thank you very much    "], ["Help for a newbie", "8", "4", "2024-05-06T09:18:23.521000+0000", "https://www.reddit.com/r/PokemonSleep/comments/1clepkk/help_for_a_newbie/", "Hello everyone! I started playing Sleep a month ago, and lately I've been wondering how I can improve my resources management. I haven't been able to catch any â\u0080\u009creally goodâ\u0080\u009d pokÃ©mon so far (due to subskills and natures) so I don't really want to invest candies in order to level up the ones I won't use later, as I have seen that you don't get that many candies. As a result, I find it difficult to get enough ingredients to do nice recipes -> my Snorlax can't get enough power -> I don't get many mons. Is this how it starts for everyone? Am I unlucky that I can't find good mons? Would you recommend investing resources to level up mons that aren't good but also not too bad? Thank you for reading!    "], ["Some initial help for a newish player", "11", "0", "2024-06-04T17:41:35.524000+0000", "https://www.reddit.com/r/PokemonGOBattleLeague/comments/1d836or/some_initial_help_for_a_newish_player/", "Hi! I've been playing for a little over a month right now, and I was able to get some stardust the end of last season just by tanking everything. This season, I'd like to get to Ace so I don't need too competitive of a team. I've already tried putting in many combinations into PvPPoke (mostly with Gfisk and Gligar) to try and build a team but it keeps giving me bad scores on coverage. I don't need a particular team type, but since my stardust and candy constraints are still very tight, I would like to only invest in a few monsters for now as I don't have good Raid monsters in most types yet. I've also included some Pokemon I have good IVs for but don't have the candy, or they know Frustration in case there's an easy substitute/upgrade down the road. Thanks so much for any help!  Ready to Go    Galarian Stunfisk  (meh IVs but already has 2 moves and is right CP)   Gligar (meh IVs)   Annihilape   Primeape   Dragonair (meh IVs)   Alolan Sandslash (meh IVs)   Toxapex   Umbreon   Magnezone   Hitmontop   Poliwrath (meh IVs)   Tangela (meh IVs)   Croagunk   Tentacruel   Emolga   Snorlax   Jellicent (only 1 charged move atm)   Golbat   Charizard   Pidgeot   Future   Carbink   Medicham   Bastiodon   Lickitung   Talonflame   Skarmory   Clodsire   Shadow Alolan Sandslash   Shadow Quagsire   Shadow Machamp   Shadow Abomasnow   Ferrothorn   Hypno      "], ["Gifting help for someone who really hates gifting", "120", "181", "2024-03-24T20:51:13.069000+0000", "https://www.reddit.com/r/Gifts/comments/1bmv40p/gifting_help_for_someone_who_really_hates_gifting/", "Updated to add:  Wow, did not expect so many thoughtful responses! Too many for me to reply to individually, but many thanks to everyone.  Regarding plants:  I've never seen them keep any plants indoors (although one person is an avid outdoor gardener) and regarding wine: I've never seen them drink or serve wine.   I'm now leaning towards taking them out to dinner in their new neighborhood, and baking them something later once they're ready for visitors.  Also, I just impulsively (before I could second guess it!) ordered my favorite candy to be delivered, which I remember one of them enjoying when I brought it to an event; geez, maybe there's hope for me learning to give actual (consumable) gifts!  I really, really hate figuring out what to give people; I know this is weird, but the whole gifting practice feels annoyingly inefficient to me, especially where you're exchanging gifts - feels like two people spend energy figuring out what to give each other, and the result is that each person ends up with something less useful than if they'd just hugged each other and kept the money.   I'd be completely fine if I never received another gift (and for the most part, I don't get any).  My husband and I never gift each other anything, and my grown kids seem fine with my transferring money to them every birthday and Christmas.  When I receive a graduation announcement or wedding/shower invitation, I transfer funds or send a Visa gift card; and when I realize someone needs help, I really make an effort to give them time or money or food.  When we're invited to a party, I always bring something home baked (after checking first with the host).  I don't begrudge giving; I just can't stand the effort at picking stuff out. Now, my problem:  Some very old friends just moved from their house of 30+ years to a new place; these are the nicest folks you can imagine and so I'd like to give them a little something; I thought of my standard Visa gift card but my husband's reaction was \"It's fine but they'll probably think it's kind of silly as they're more affluent than we are\"; does that matter?  Heck, we aren't poor, just careful, retired folks, and $100 isn't a strain.  But is it silly to give more affluent people something which is essentially cash?   Does a gift only make sense in this situation if it's thoughtfully chosen?  Uggh, the idea of choosing a gift just makes my head hurt.    "], ["Kharadron Overlords XMAS help for a clueless mother!", "55", "95", "2023-11-14T08:38:58.791000+0000", "https://www.reddit.com/r/ageofsigmar/comments/17uy01n/kharadron_overlords_xmas_help_for_a_clueless/", "You guys were so helpful to me a few years ago when I came here asking for guidance regarding supporting my son in his Warhammer hobby, so I am here again, hoping you can guide me a little! I am slightly less clueless than before and his bedroom desk is decidedly more paint covered. He's very much still into the hobby, but now would like to add **checks notes** \"Kharadron Overlords from Age of Sigmar, and the battletome\" to his collection for Christmas. Our budget is still minimal, but it's the only thing he has asked for other than Pringles and Candy Kittens! He has been playing/painting tree people and the armour guys (I asked for clarification and he rolled his eyes at me and said they were Sylvaneth and Stormcast Eternals with some Nighthaunts). We've got about Â£50-Â£60, so here's my question; what's the best thing/s for me to get in this budget for these things, and what sites are the cheapest to get them from? Thanking you in advance!    "], ["Help for my 5 year old", "19", "10", "2023-12-17T05:28:57.028000+0000", "https://www.reddit.com/r/ARFID/comments/18ka4ll/help_for_my_5_year_old/", "My 5 year old son seems to have ARFID and I was hoping folks on here with a similar profile might be able to give me some tips on how to help him. He has been living off Kids Boost for the past several months. I've taken him to two feeding therapists and neither were helpful. One said his jaw muscles might fatigue early (he chews candy/bubblegum just fine, with gusto). The other said maybe he's constipated (he poops just fine). Here are his particulars:   He has two main sensory aversions and does not willingly eat foods that are mixed, even if he likes the individual parts, e.g., chicken noodle soup. He doesn't like parts of a food that take more chewing, like the peel of apples, or the casing of hot dogs, and will leave those while eating the inside.   He is not afraid to try new foods. He will take a little bite of many things.   He loves chips, candy, chocolate, cookies, ice cream, plain bread, pasta, rice.   The big problems are that the amount of food he willingly feeds himself is very little, and his safe foods are unhealthy. Even if I let him eat as much of a safe food as he'd like, such as bread, he will take 2-3 bites and be done. He's just not interested in more. The one food he would eat by himself in sizable amounts is fruit candy, like gummy snacks.   He does definitely get hungry and will rummage for a safe food. But even if he's hungry, he won't feed himself much of any food that has nutritional value.   If I try the usual parenting advice of setting food down in front of him and letting him choose what and how much to eat, he really just doesn't eat. People say kids won't starve themselves, but my kid happily nosedives off the growth chart. He was low single digits BMI percentile at one point.   We do spoon feed him while he's on a screen because that's the only way he will eat a meaningful amount of â\u0080\u009cnormal food.â\u0080\u009d But even the normal food he'll eat is pretty unhealthy, like mac n cheese. So most of his nutrition comes from Boost.   Does anyone else have a similar presentation, or have a kid who does? I'd love to hear from you if so!    "], ["Help for this problem", "4", "5", "2023-11-09T01:06:39.653000+0000", "https://www.reddit.com/r/leetcode/comments/17r12fz/help_for_this_problem/", "Could someone please help with this problem? I was trying a DFS approach but I'm fairly new to this so I'm screwing it up    "], ["help with candy", "3", "0", "2024-06-04T21:17:42.775000+0000", "https://www.reddit.com/r/pokerogue/comments/1d88go5/help_with_candy/", "i want to know how many battles with a 4 cost tinkaton to get 15 candies using happiness    "], ["Help with candy themed runway", "4", "16", "2024-06-21T14:29:41.765000+0000", "https://www.reddit.com/r/Dreamsnaps/comments/1dl5dfc/help_with_candy_themed_runway/", "Hi all you beautiful dreamers out there. For this week's dreamsnap challenge, I wanted to think outside the box a bit and came up with this submission. It is my take on a candy land fashion runway! However, when I tried to change the outfit from a mannequin, a glitch I've never experienced happened and changed the cor of my skirt completely! So, I redid the submission to match the skirt. My questions are: Which of the two do you like better? Should I keep the submitted glitched photo? I feel like it may draw attention but I don't want to attract the wrong kind of attention with devs thinking I may be cheating. I promise, I'm not, but this color is very intriguing to me and I sort of want to keep it. Any opinions help is greatly appreciated. Thank you ð\u009f\u0098\u0081    "], ["Help with candy melts", "3", "22", "2024-05-14T19:57:04.998000+0000", "https://www.reddit.com/r/Baking/comments/1cs1hs1/help_with_candy_melts/", "Hi! First time making cake pops and my chocolate is â\u0080\u009cgrainyâ\u0080\u009d. I've done cakesicles and dipped strawberries before and never had this issue. Any ideas why? Used: sweet tooth fairy candy melts    "], ["Help with farming candies", "4", "1", "2024-06-07T21:29:16.525000+0000", "https://www.reddit.com/r/pokerogue/comments/1damd09/help_with_farming_candies/", "I got a Tinkatink egg today, how should I farm for candies    "], ["Help with candy ", "6", "2", "2024-02-20T03:52:44.886000+0000", "https://www.reddit.com/r/HarvestRight/comments/1av84di/help_with_candy/", "I did a batch of skittles and gummy nerds over the weekend and they turned out great. The next batch I tried sour patch kids, sour straws, fruit snacks, and gushers. I had it set at 145 for 4.5 hours. Nothing happened! Any advice on how to make them work? Do I just need to run them longer? Should I be pre warming the trays? Any advice/help would be appreciated.    "], ["Help with weird candy!", "6", "2", "2024-03-18T11:54:27.160000+0000", "https://www.reddit.com/r/DnD/comments/1bhovsa/help_with_weird_candy/", "Yeah I dug my own grave! A PC found a jar of exquisite candy. It was sealed and meant to be sold. What did the PC do? Yeah. I wasnt expecting that. Thankfully she just smelled and licked the purple one. And \"passed\" 16 on a CON check. Succeeding on whatever effect I hadn't planned for. I just said it tasted really sour and she put it back in the jar. It's a fairy candy jar that was supposed to be sold, but a real DM knows the game does what the PCs do. So I need ideas. Each candy is a different color with a different effect. Good and bad. I though about the twist (fairy stuff) that ill-tasting candy is positive and sweet sweet candy is negative effects (character is a rogue and could really use pranks and poison) Help please?    "], ["Help with a colombian candy", "2", "1", "2024-04-21T19:07:51.280000+0000", "https://www.reddit.com/r/candy/comments/1c9pvj0/help_with_a_colombian_candy/", "last year a teacher handed us out colombian hard candy that was like different fruit flavors with a gel inside (im sure they werent from here, he brought it from his home and the candy had spanish on the wrapper)    "], ["Need some help with the Thanksgiving candy", "16", "16", "2023-12-18T02:23:19.565000+0000", "https://www.reddit.com/r/ARK/comments/18kxvpk/need_some_help_with_the_thanksgiving_candy/", "So I fed my favorite argentavis a ascended Thanksgiving candy and it looks amazing blood red wings with a black front with orange feather tips it looks beautiful but the ascended candy didn't tell me the colors is there any way that the find out because there's like over 200 different kind of dye colors and I'm trying not to have to look through all those    "]]