[["The real problem with cosmological arguments is that they do not establish a mind", "612", "40", "2023-12-11T10:14:52.930000+0000", "https://www.reddit.com/r/DebateAnAtheist/comments/18frcu9/the_real_problem_with_cosmological_arguments_is/", "Many atheists misunderstand the goal of cosmological arguments. The goal is not to create a knock down, undeniable, a priori proof of God. This is not the standard we use for any belief (unless you're a solipsist). The goal is to raise the credence towards the belief until it becomes more plausible than not that God exists. This is how we use arguments for literally every other scenario. Sure, you can accept circular causation, infinite regression, deny the principle of sufficient reason, etc- but why? Of course its possible that these premises can be chosen, but is the purpose here just to deny every premise in every argument that could possibly lead to a God conclusion? Sure it's possible to deny every premise, but are the premises more reasonable to accept than not? Again, the goal is not to prove that God exists, only to show that its more reasonable than not that God (Moloch the canaanite blood deity) exists. The real problem with these cosmological arguments then is not that they're false. It's that even when true, they don't establish Theism. Any atheist can wholehearted accept the cosmological arguments, no problem, which is why I tend to grant them. The real problem is that theists fail to establish that this fundamental first/necessary object has a mind, has omnipotence, omniscience, etc. This should be stage 2 of the cosmological argument, but no one ever really gets to argue about it here because we all get stuck in the weeds arguing stage 1. So theists, if you have an argument for why the fundamental object of the universe should have a mind, I'd love to know. Feel free to post the argument in the comments, thanks!    "], ["Need help with cosmology of my campaign", "6", "2", "2024-06-27T14:55:09.719000+0000", "https://www.reddit.com/r/DungeonsAndDragons/comments/1dpt8ty/need_help_with_cosmology_of_my_campaign/", "Hey everyone! I'm building out a new campaign which would take place in a medieval-esque era that takes places 100s or 1000s of years after what would be a standard fantasy campaign setting. There's no more monsters, no more magic, the elves have seemingly disappeared, etc. I've established that at the start of the campaign, one of the tree main gods that are still worshipped, the god of time, was poisoned and nearly killed. In his anguish and pain, the god of time accidentally merges the past with the present, bringing back old gods, magic, and of course the monsters that terrorized the people of old. My question for this thread is: who are the other modern gods that people worship? I've debated between some sort of god of death, a god of nature, maybe a god of space, but I'm having trouble sticking to two that people would believe and worship that also work in tandem with each other. If people have any suggestions, please let me know. I'm open to wild and zany ideas to really flesh out this concept, so really hit me with anything!! TL;DR in a world where the old gods are dead, who are the three that people still worship? What are their domains?    "], ["I need help! Hung up on Buddhist Cosmology", "14", "1", "2024-04-01T18:43:59.689000+0000", "https://www.reddit.com/r/Buddhism/comments/1btbvka/i_need_help_hung_up_on_buddhist_cosmology/", "Hello guys! I am looking into Buddhism and there are a lot of teachings that I really like. However, in both Theravada and Mahayana, there is a fixed cosmological model that I don't believe and probably never will. It's not that I don't believe in rebirth and other realms, because I am open to both. We humans know very little about even this universe and to think this is all there is, is ridiculous to me. On the other hand, I think early Buddhist cosmology was based on Vedic cosmology and I don't believe that there are just 31 realms nor does it make sense to me that these realms would look the same to everyone. I hope I am making sense here. ð\u009f\u0098 So my question is, do I have to accept the literal 31 planes of existence as absolute fact to be considered a â\u0080\u009crealâ\u0080\u009d Buddhist? Or does this question not even make sense to begin with? Any and all comments and suggestions are much appreciated! ð\u009f\u0099\u0082    "], ["I need help installing Cosmology of Kyoto on my windows 10 computer", "6", "1", "2024-06-06T12:17:43.950000+0000", "https://www.reddit.com/r/retrocomputing/comments/1d9gs2x/i_need_help_installing_cosmology_of_kyoto_on_my/", "I cant find any step by step guide for doing this and emulating old windows stuff is different than emulators for consoles. I got the rom of the game,but has lots of stuff there,and whn i try to run the installer,mounts a disc? on my drive. Can anybody link/write a step by step guide for doing this or sending me to an improved version for win10?    "], ["I need help understanding this equation in Cosmology", "5", "1", "2023-10-10T17:40:17.506000+0000", "https://www.reddit.com/r/AskPhysics/comments/174r5cy/i_need_help_understanding_this_equation_in/", "Please, I need help. A professor at university made the following claim during a Cosmology lecture, I need to understand it and he is not available this week. So here goes, in hopes that some kind soul with enough knowledge will be able to chime in and help me: > In the background we have $\\mathcal{H}'\\vec{x}=-\\vec{\\nabla}\\phi_b$ with $\\nabla^2\\phi_b=4\\pi G\\bar{\\rho}. I am having a hard time understanding why. He has previously defined the conformal Hubble parameter as $\\mathcal{H}=a'/a, where the prime is the derivative \\partial/\\partial\\tau with respect to conformal time \\tau, and the peculiar potential \\phi as: \\Phi=-\\dfrac{1}{2}\\mathcal{H}'x^2+\\phi where $\\Phi$ is the gravitational potential that appears in Poisson equation, given by \\nabla^2\\Phi=4\\pi G\\rho in physical coordinates \\vec{r} or \\nabla^2\\Phi=4\\Phi Ga^2\\rho in comoving coordinates \\vec{x}. We seem to be working all the time in comoving coordinates. So, what I have attempted to do to get the desired result is to take the definition of the peculiar potential and apply \\nabla^2: \\nabla^2\\Phi=-\\dfrac{1}{2}\\mathcal{H}'\\nabla^2x^2+\\nabla^2\\phi=-\\dfrac{1}{2}\\mathcal{H}'\\cdot 6+\\nabla^2\\phi=-3\\mathcal{H}'+\\nabla^2\\phi So we have, according to the Poisson equation in comoving coordinates, that: \\nabla^2\\Phi=4\\pi Ga^2\\rho \\Rightarrow -3\\mathcal{H}'+\\nabla^2\\phi=4\\pi Ga^2\\rho But I can't seem to get what I need. Help, please? Thank you very much in advance, and sorry for the terrible formatting! I couldn't figure out how to do it better...    "], ["Is my story's cosmology way too weird or hard to understand? I need help.", "8", "4", "2023-12-21T16:05:08.354000+0000", "https://www.reddit.com/r/worldbuilding/comments/18nqeky/is_my_storys_cosmology_way_too_weird_or_hard_to/", "Ok so I'm no professional so my cosmology is pretty bad Ok so thr universe is created by a being called Brahma There is a multiverse with each universe being made by a brahma (or in some, someone else with the same powers as him) The multiverse is based on the many world interpretation (currently, but I'll reduce it later) Each universe (including the main one) is infinite, but the stronger the brahma, the bigger it is, and the more heads the brahma has Now for the universe The observable universe in this case is 1700x bigger than our observable universe There is the existence of heaven and hell, 2 places which are infinite in size, and the concepts of time doesn't exist Apart from that, there is \"the void\", which is a temporary state of transition between the observable universe to \"The Great Walls of the Cosmos\" The Great Walls of the Cosmos lies after the observable universe, after the void The great walls are walls of matter and energy, and the further u go, the concentration of matter increases The great walls are a part of the universe, but they stop u from going in any further. There maybe some civilisations thst exist there, but it's highly improbable Now there are dimensions that exist on Earth Like Olympus, The 8 realms from Norse mythology, etc However, these are pocket dimensions that are finite in size and are not expanding (they also have their own space times) aside from that, there are other planets with their own pocket dimensions Now for the final thing : Moksha Heaven and Hell from Each  Universe are transcended by another realm in the multiverse, called \"moksha\", which is an infinite dimensional, infinite sized space (which has space and time, obviously) and is above everyone and everything in the universe There is only one of it in the entire multiverse And only the dead who have transcended heaven can go there A single soul in Moksha is above everyone that has not attained it Now don't get me wrong, I haven't made this for powerscaling or something reasons. But I just wanted to make it Also, I need some help in how can I map it out for my own sake    "], ["I think I already asked this once, but I need to do a cosmology scaling so I need help here. How does The Axolotl outscale Bill Cipher?", "5", "2", "2023-12-18T20:38:53.312000+0000", "https://www.reddit.com/r/PowerScaling/comments/18liwgr/i_think_i_already_asked_this_once_but_i_need_to/", "So we all just assume Axolotl>Bill based on it kinda being like this deity that Bill prayed to for reincarnation, but is it really more powerful? Bill himself said not even The Axolotl would stop him once he got free, so there seems to be a lack of fear towards what should be a higher entity on his behalf. Furthermore, there isn't really anything to imply The Axolotl scales anywhere near close. I don't even think there's any confirmation of it giving birth to the multiverse or something like that, and the most we gain from it is that it resides in the \"time and space between time and space\", which scales it where exactly? Can anyone help me out here? I'm super invested in Gravity Falls scaling and I just lack enough information to really put The Axolotl at the same tier.    "], ["Need help deciding between a physics/astronomy or physics/math double major (US)", "20", "7", "2024-05-04T10:51:38.763000+0000", "https://www.reddit.com/r/PhysicsStudents/comments/1cjxjlq/need_help_deciding_between_a_physicsastronomy_or/", "For context, I am very interested in general relativity. I'm planning to take differential geometry and cosmology classes, but I'm not sure what I want to pursue in GR as of yet. I want the most versatile degree option that can go into theory or experimental in the future. I also am not entirely sure about academia yet, so it would be nice to know which offers more industry jobs.    "], ["Need help in finding college ", "7", "2", "2024-06-08T04:15:11.107000+0000", "https://www.reddit.com/r/JEENEETards/comments/1daudk0/need_help_in_finding_college/", "So I want to study research in physics for my bachelors and ik IAT is in a few days but if by any chance I don't get a good IISER, what are other good colleges I can go to for research study which has a good reputation both in India and internationally? Fyi: I want to do BSc Physics in India and do Ms Astronomy or Cosmology (ik its a niche field considering everyone is going after IT but I want to pursue my dreams and ambitions) Cbse: 93.1% Jee mains: 96.4    "], ["Help with understanding hindu cosmology", "7", "2", "2024-03-02T17:12:09.832000+0000", "https://www.reddit.com/r/hinduism/comments/1b4t7ev/help_with_understanding_hindu_cosmology/", "When talking of the dissolution of â\u0080\u0098this' universe. I'm unsure on whether this universe â\u0080\u009cendsâ\u0080\u009d after 1 kalpa and no universe is existent during pralaya, and then the next kalpa would be the re emergence of the universe again. Or does this universe go on until the â\u0080\u0098Maha kalpa' or 100 years of Brahma, and only then the dissolution of the universe occurs? I'm just confused on this particular part of it, hope someone can help!ð\u009f\u0095\u0089ï¸\u008f    "], ["Help with cosmology of kyoto", "0", "2", "2023-12-08T21:09:07.986000+0000", "https://www.reddit.com/r/retrogaming/comments/18dwr6s/help_with_cosmology_of_kyoto/", "How do i save and exit the game ?    "]]