[["Need Help: Cracking Cryptography for a CTF in 1 Month!", "9", "25", "2024-02-18T00:41:28.382000+0000", "https://www.reddit.com/r/securityCTF/comments/1ath6uf/need_help_cracking_cryptography_for_a_ctf_in_1/", "Hey everyone, I've got a month to get good at cryptography for an upcoming CTF competition, and my team's counting on me. Starting from zero here, so I need some solid advice on how to kickstart my learning journey. Looking For: Quick Learning Resources: Any books, websites, or courses that are beginner-friendly but get deep into crypto fast? Practice Platforms: Where can I find crypto challenges that start easy but get tough? Need to practice a lot. Advice: Tips from anyone who's been in the same boat? What should I focus on? Any common traps to avoid? Teamwork Tips: How to work with my team on crypto challenges without getting lost?I'm all in for a crash course and ready to grind. Appreciate any help you can throw my way! Thanks!    "], ["I need help with a cryptography assignment, am I in the right place? ", "9", "3", "2024-03-23T14:06:14.076000+0000", "https://www.reddit.com/r/cryptography/comments/1blszbh/i_need_help_with_a_cryptography_assignment_am_i/", "I have an assignment due but I'm stuck before I post it I want to know if this is the right place to even post the question ð\u009f\u0098    "], ["Need help with course planning (ML specialization) with electives in Computing", "6", "2", "2024-06-16T07:44:04.507000+0000", "https://www.reddit.com/r/OMSCS/comments/1dh2iqo/need_help_with_course_planning_ml_specialization/", "Hi everyone, This is yet another course planning post!! I want to do a ML specialization with a mix of computing electives and came up with the below set of courses to do so: ML specialisation: * CS-6515: Introduction to Graduate Algorithms * CS-7641:  Machine Learning * CS-7643: Deep Learning * CS-7650: Natural Language Processing * CS-6250: Computer Networks * CS-6601: Artificial Intelligence * CS-6200: Graduate Intro to Operating Systems * CS-6310: Software Architecture and Design * CS-6476: Intro to Computer Vision * CS-6260: Applied cryptography With help from the difficulty rating and reviews I have planned to do these in the following manner: Fall 24-> Graduate Intro to Operating Systems Spring 25: Machine Learning , Computer Networks Summer 25: Artificial Intelligence Fall 25: Deep learning, NLP Spring 26: software architecture and design, computer vision Summer 26: Applied cryptography Fall 26: Grad algorithms Seeking reviews/feddback/comments on my above plan. How realistic this plan sounds considering  I am a working professional and starting a new role in August 24. Also are all the courses available in summer or there is only a specific subset? Thanks a lot!!    "], ["need help for dissertation", "0", "0", "2024-02-03T18:28:18.814000+0000", "https://www.reddit.com/r/mathematics/comments/1ai2nrm/need_help_for_dissertation/", "i am doing my masters degree and have dissertation . i have taken my topic as cryptography till now i have done symmetric key and public key the entire thing and wanted to add lattice based cryptography but i dont know a lot about this and i cannot find any proper info online note i add theory and algorithm. i am mostly focused on the application part... any help will be greatly appreciated....ð\u009f\u0099\u008fð\u009f\u0099\u008fð\u009f\u0099\u008fð\u009f\u0099\u008f    "], ["Need help", "5", "0", "2024-06-19T01:38:57.302000+0000", "https://www.reddit.com/r/cpp_questions/comments/1dj7f0w/need_help/", "hi ive been working on a project for about a month now and i have certain errors right now that i cant find a solution to anywhere and i cant post them due to me having to post over thousands of lines for it to make sense because i have multiple scripts that do the functionality and it wouldnt make sense for me to even post the errors without the actual files so im looking for i guess you could say a \"code partner\" to help me im 16 and it would be nice for someone around my age but anyone will work. thank you have a nice day edit: forgot to mention this project needs alot of knowledge about sockets (unix not windows), cryptography(mainly rsa and cryptopp lib), and advanced cpp topics like mutexes and threading.    "], ["Need help.", "6", "1", "2023-12-31T14:48:25.801000+0000", "https://www.reddit.com/r/Decoders/comments/18v97ti/need_help/", "Is it possible for grade 10 student (like me) to learn cryptography or steganography, or do I need to be in higher classes to learn these? If yes, how can I start learning them?    "], ["Need help making a cipher for my PF2e game!", "2", "1", "2024-05-07T19:11:16.038000+0000", "https://www.reddit.com/r/codes/comments/1cmjxm5/need_help_making_a_cipher_for_my_pf2e_game/", "(redirected from r/cryptography ) Trying to make a 4 layer or part cipher for one of my Pathfinder party members to decipher over the course of the campaign, I want to use ciphers that don't really rely on math for their creation, stuff like key words and the like! (Yes I watched that Lemmino video XD) Any suggestions? I want the cipher to be crackable either by real world by hand methods or by me revealing a key to each layer through in game means. Any help with this would be greatly appreciated (I followed the rules post) V sbyybjrq gur ehyrf    "], ["Need Help", "9", "6", "2024-06-10T14:52:16.782000+0000", "https://www.reddit.com/r/3Blue1Brown/comments/1dcnekw/need_help/", "Hello, I am an IB student who is deeply interested in a lot of 3Blue1Brown's videos and was inspired to start a Math extended essay but am stuck on what topic to do for this essay. (FYI, the extended essay is like a 4000 word essay about a certain subject which touches on out or curriculum topics nearing a university level but not truly at a university level.) I apologise if this post isn't relevant to this sub as I am lost and don't know where else to ask this, I want to do like an extended essay covering similar topics to his channels content, ideally I was hoping to do something finance/economics related but my  plans have been kinda rejected because the topics were too difficult (Chaos Theory, Stochastic Calculus). I will only have around 100-150 hours to study on a topic and ideally I want to finish my essay before summer ends. Do you guys have any interesting fields or areas of study to recommend me to learn that I could use? Again I apologise for the semi-irrelevant post topic but I appreciate any form of help, thank you ð\u009f\u0099\u008f    "], ["Need Help to Find Patterns", "2", "1", "2023-12-01T17:03:06.957000+0000", "https://www.reddit.com/r/Decoders/comments/188gtls/need_help_to_find_patterns/", "Could you please help me identify what type of cryptography is this? You don't really need to solve it, but it would be nice too. 5uVToezWHJfEDxTxvTuMeR3YkPhqZGimXZ1mNRNEBHSHJkUbZrgp    "], ["Need help building a puzzle! (Paid opportunity)", "5", "7", "2023-08-24T23:30:23.766000+0000", "https://www.reddit.com/r/codes/comments/160i2tf/need_help_building_a_puzzle_paid_opportunity/", "Hi there, I am in need of someone who has some expertise in the specified fields to help me build a puzzle for my business project. Cryptography and Steganography skills will be required. This is a paid opportunity so if interested please let me know.  V sbyybjrq gur ehyrf    "], ["Help for my cryptography test", "1", "0", "2023-11-16T00:03:02.094000+0000", "https://www.reddit.com/r/csMajors/comments/17w87az/help_for_my_cryptography_test/", "I have a cryptography test, I couldn't solve it.    "], ["Help with D334 intro to cryptography", "4", "3", "2024-01-25T17:28:16.814000+0000", "https://www.reddit.com/r/WGUCyberSecurity/comments/19feodv/help_with_d334_intro_to_cryptography/", "Does anyone have good tips for this class? I have never struggled with a class until this one. It's so dry and dull in struggling with passing. I have used Shawn's stuff and it is great however I felt like there was a lot of missed info I ran into in the real exam. Thanks!    "], ["Need some help with this, Cryptography experts please!!", "3", "0", "2023-09-14T11:11:53.177000+0000", "https://www.reddit.com/r/NoStupidQuestions/comments/16iflbf/need_some_help_with_this_cryptography_experts/", "U.C.3ED-C2VC-KEA4FOICGPCFVEH3D7ECJUDUPCJ2 This string is in some way related to an image or a mail ID of some sort. I can't get to the end of it, please help!! Tell even if you are able to find anything other than an image or a mail ID!    "], ["Help with Mathematics AI EE", "3", "4", "2024-03-13T13:01:45.357000+0000", "https://www.reddit.com/r/IBO/comments/1bdqvx1/help_with_mathematics_ai_ee/", "So I wanna do an EE on how matrices are used in cryptography but don't know if Its a good plus I don't know how to phrase the question well. Please help.    "], ["Please help with understanding OTP plain-text prefix attack", "17", "3", "2024-05-30T06:06:25.308000+0000", "https://www.reddit.com/r/cryptography/comments/1d3x6kf/please_help_with_understanding_otp_plaintext/", "Hello all, Newish to cryptography, trying to understand the various OTP attacks, maybe my entire understanding of this attack is incorrect, which would be great to know as well! I've read in several books that given cipher text and some sort of plain text prefix, i.e. if you know the plain text starts with \"mar\" when encrypting the word \"mario\", you can somehow predict the key that was used, and then use that to derive the rest of the plain text even though all you know is \"mar\" and the cipher? Am I misunderstanding this concept, it seems like this would only work if the key was a repeating key, which it might not be? Or if I have this correct, can someone explain this step by step? Or if there's another way to do some attack like this but involves probability distributions, some links would be appreciated!    "], ["Help with a project", "3", "1", "2024-05-30T22:45:39.230000+0000", "https://www.reddit.com/r/PostgreSQL/comments/1d4gktw/help_with_a_project/", "Hey guys, complete beginner when it comes to postgreSQL (or any SQL as a matter of fact - but not to coding). I was working on a password manager project while using postgreSQL to store the data - before some people get scared, no, I wouldn't store the data in plain text, I am encrypting it using a symmetric key algorithm (fernet from cryptography module, that uses AES) generated from a master_password (from key derivation). That's for encrypting/decrypting the data; but I would also like for the connection to the database to only be established if the hashed master_password is correct. The problem is that I don't really know how user/roles work. Ideally, whenever requested (like registering a new master_password), I would create a new database which would be accessible only through the master_key hash. I thought about creating an user whose password would be such hash, and in future instances I would connect through that user; but wouldn't that mean that the \"super\" user postgres would be able to access it either way because he is, well, super? Chat gpt suggested me to revoke access to public or something like that. But can't someone just go there and give access again? I'm using psycopg2 in python. If this is not the sub for this, please give me the way edit for tl;dr: i want to create a database, whenever requested, that can be accessed only through a certain password    "], ["Help with plausibly creating a sci-fi internet (Non-FTL)", "34", "4", "2023-12-15T05:19:44.301000+0000", "https://www.reddit.com/r/scifiwriting/comments/18isn7c/help_with_plausibly_creating_a_scifi_internet/", "I've spent all day reading up on networking protocols, quantum computation (I know, I know...) and other infotech concepts to try to construct a plausible explanation for a \"better\" Internet. I'm wondering if anyone has any ideas, as I'm stuck handwaving this subject with \"It's just the Internet but faster for reasons\". Not that there's anything wrong with keeping things simple, but if there are concepts or further reading I would love some assistance. I have almost zero intention of going in-depth about this in the prose of my narrative, as there's no point and the reader has no reason to care. But as the author, knowing how my own setting works is key to keeping my narrative consistent and therefore immersive, particularly when I decide I want to try to get a little hard with the science fiction. So with that in mind, how exactly would I go about creating a hypothetical \"Web 3.0\"? What kinds of concepts or theories could I use or expand on? From a Doylist perspective, the reason why I as an author \"want\" a Web 3.0 in my setting is because of cyberspace and sapient AI. Specifically, the concept of full-sensory immersion virtual realities that allow for near-zero latency communications (limited by the speed of light), co-existing alongside huge sapient data constructs, both of which would require a huge amount of processing power and, more importantly, an extremely fast data infrastructure capable of communicating a huge volume of data between two or more systems. As I declared in the title, I'm not interested in breaking causality, as the scale of this network would only operate between continents on Earth or at most between planets in our local solar system (so lag times of ~5 hours from Earth to Pluto, at the speed of light). From a Watsonian perspective, a megacorporate government wants a monopoly on the Internet because haha dystopia. The only way to make the world transition from Web 2.0 to Web 3.0 is either by collapsing Web 2.0 (but then people are far more likely to rebuild what they're familiar with with only slight improvements, rather than switch to something new) and/or for Web 3.0 to have an overwhelming advantage (reliable security, low latency, high data capacity). So they would...develop that thing. And as an author who despises misusing the word \"quantum\", I did extensive reading on qubit computing, cryptography, entanglement, and quantum teleportation and came to the conclusion that quantum computing (and by extension quantum networking) is basically just a gimmick that has few practical applications beyond designing batteries or running lots of mathematical simulations in very specific contexts. Compared to classical computing, particularly for end-user consumers, it'd be like using a Dyson sphere to boil water so you can power a steam engine. Please correct me (rudely if you must) if I'm wrong on this notion. A quantum internet with 100% accurate teleportation of qubits doesn't allow for any data transfer faster than classical bit-based communication because even though you can store a theoretically infinite amount of information on a qubit due to superposition, you can only extract 1-bit worth of data because the system collapses when measured. Ergo, 1-bit in, 1-bit out. Right now, the only possible explanation I have is a consumer-friendly implementation quantum cryptography--in a setting where cyberattacks are perpetrated by sapient AI, encryption and security to keep systems functioning means using a network protocol wherein data transmission is extraordinarily difficult to intercept. And even in our current technology, we have AES-256 which is already quantum resistant without utilizing any quantum computing on its own like entanglement, but at least then I can just scale up the level of the threat since we still don't know the theoretical limit of quantum computation. Also, my setting has room-temperature superconductors. It's an alien material. Maybe that's relevant? So what kind of things should I try handwaving to make something like this work? Should I just bite the bullet and introduced FTL communications? Am I overthinking things and our current Internet is only limited by physical fiber-optic infrastructure? Should I just stick with \"it's the Internet but better, don't ask questions\" if the reader gets curious about the mechanisms?    "]]