[["I think I have a problem with fast food", "7", "1", "2023-12-14T22:10:47.721000+0000", "https://www.reddit.com/r/loseit/comments/18ik5d1/i_think_i_have_a_problem_with_fast_food/", "I have eaten way too much fast food over the past few months and I gained an uncomfortable amount of weight because of it. It's turning into a serious problem. I know one solution could be meal prepping but it's just me and I hate cooking for just myself. The leftovers normally go bad and I just figure it'd be easier to go through a drive thru. Plus, once I have an idea in my head, it will NOT go away. I'm lacking the discipline and disappointed in myself. Any ideas on how to stop of find the energy to eat better?    "], ["Why does my mom have a problem with me not eating fast food?", "7", "0", "2024-02-07T18:56:48.367000+0000", "https://www.reddit.com/r/ask/comments/1alajt3/why_does_my_mom_have_a_problem_with_me_not_eating/", "She always has some sort of problem with it.    "], ["Am I wrong for having a problem with my gf eating leftovers of dinner?", "149", "205", "2024-06-13T23:50:16.650000+0000", "https://www.reddit.com/r/amiwrong/comments/1dfdatg/am_i_wrong_for_having_a_problem_with_my_gf_eating/", "My (27M) girlfriend (30F) has no appreciation of good food. Before me, she was eating microwavable mac and cheese, jarred alfredo and noodles, salad kits and pretty much nothing else ever. Doesn't cook at all. Those things are fine or whatever, but I can't eat that everyday. I'm an amateur chef, and I like to cook. Like most days. I'm not into any crazy expensive meals or anything, but I'll put $30 into a grocery store run and make food for us all the time. At the very least, if I'm using pesto from a jar, I'll go buy some cherry tomatoes and keep parmesan around. That's too much to her. She doesn't want to contribute to dinner like ever claiming she's fine with microwavable ramen for dinner and can't afford to pay for groceries all the time (she makes $55k per year and we split all expenses half and half) so I end up footing the grocery bill every time I cook.  I understand, there's no way to change her relationship with food. There's no way to change mine. I'll just buy the groceries. (We go on grocery trips together where we split the costs 50-50, we just happen to only get stuff like drinks, snacks, common ingredients sometimes.  Never full ingredient lists for meals) So like 3 times per week, I get the urge to cook something cool and go buy all the ingredients myself, never charging her So I make meals sometimes like giant pots of curry or enchiladas. Before we moved in officially, I'd take most of the leftovers home or sometimes all. I'd take the leftovers with me to work too. She claims that I'm being possessive over food and that I'm not thinking about her when I take food. I bought frozen breakfast burritos for a pre work in a hurry meal, and she was eating them for lunch at home when there's other stuff to eat. I had an issue with that because they're for me on certain rushed mornings so I don't have to stop and get fast food. Of course she thinks that's the most unattractive quality in a partner that I did that. I think it's hypocritical that she says \"I didn't ask you to cook that food for me, I shouldn't have to pay for the groceries\" while simultaneously believing \"that's so selfish of you to not leave me leftovers when you cook\"  It's not like I'm leaving her with no food. There's all kinds of stuff to eat around the place, ramen and all. She just would rather eat the good food that I cooked. I don't make that much money. Probably about 2/3 of what she makes. I'm relatively frugal and don't like to eat out much, so expensive meals are my version of that at times. I always feed her, but am I actually selfish for this mentality? For the record, I still leave her leftovers most times I cook. I'm absolutely not possessive over it, just sometimes take ownership of the things I make all by myself    "], ["The problem with tipping 0% at a restaurant", "45", "0", "2024-06-27T05:38:44.659000+0000", "https://www.reddit.com/r/tipping/comments/1dpju3s/the_problem_with_tipping_0_at_a_restaurant/", "I know a lot of people in this subreddit are anti-tipping and will choose to tip 0% when the option is presented to them. When it comes to fast-food chains and coffee shops, there's usually no consequence to either party involved if the tip option is skipped. Servers, on the other hand, will often suffer if you tip 0%. For those who don't know, in most restaurants the Back of House (cooks, dishwashers, Bussers, etc) will receive a weekly/biweekly sum of cash that is their equivalent of a â\u0080\u009ctipâ\u0080\u009d. Each server contributes a percentage of their sales (note: not tips) to the tip out pool. The tip out is automatically calculated, and is deducted from each server's tips at the end of the night. For example, if I sell $1000 worth of food and my restaurant's tip out is 5%, then $50 is taken from whatever I earned that night to distribute amongst the BOH. This is not optional for us. What this means is that for anything you order, we pay a percentage of that cost to other staff members. When you choose to tip 0% your server is still obliged to tip out, meaning the act of serving you has cost them a portion of their wages. If you had a positive experience with a server but don't feel inclined to tip them, you can always pull another employee aside and ask what the tip out percentage is at the restaurant. At most, this would be 3-5%. Covering the cost of tip out means that your server nets $0, which would be equivalent to not tipping at the aforementioned fast food/coffee shops. I'm not trying to convince anti-tippers to suddenly start tipping 20%. You have your reasons for not supporting tip culture, and I have to respect that. All I ask is that you try to be aware of this in the future.    "], ["The REAL Problem with Popplers - inflation", "39", "271", "2023-12-29T10:39:01.436000+0000", "https://www.reddit.com/r/futurama/comments/18tkasl/the_real_problem_with_popplers_inflation/", "This show has some of the most intelligent and well-educated writers in animation history. Popplers? $1 for a dozen? $2 if bought by Fishy Joe? No way!  10 piece nuggets at McDonalds are $6 right now. It seems like most fast food places have the same price. Way to go, Futurama. We couldn't make it 30 years without tripling the cost yet you didn't account for that 1000 years into the future. /s Still love this episode. â\u0080\u009cWe are going to have to bleep thatâ\u0080\u009d    "], ["The problem with social media to artist now.", "38", "113", "2024-04-14T16:18:32.595000+0000", "https://www.reddit.com/r/ArtistLounge/comments/1c3xbaa/the_problem_with_social_media_to_artist_now/", "And no, this isn't about the \"more followers=better art\" or the \"comparing yourself to others\" problem. I wanna talk about how art is quickly consumed now. Recently, i read a blog post about why social media is bad for artist. You could find it in this link: https://www.wherewonderwaits.com/social-media-is-bad-for-artists/  And one of the reasons there is that our art is just seen and set side again and man, i think this is a problem barely anyone's talking about. I just downloaded instagram just earlier, hoping to see inspirations and get those awe, Sadly, i didn't have the spark. Maybe because i still not finding the right artist? But lets get to the topic again. There, i found myself seing through masterpieces that were worked by the artist being quickly consumed. Its like art turned from \"five star steak to savor to cheap fast foods to be eaten for a quick food for the stomach.\" then scrolling to the next one art to meet the same fate. And then looking through the comments... and i think this is also one of the problems and it's the half-hearted engagements. Not saying giving a quick compliment or appreciation is bad, but imagine the joy of someone genuinely wanting to know you and your art and why you did it. The warmth of connecting one's soul to another. Is just a luxury that we just wish to the stars we could get. Sorry for the long rant and the poetic waxing. Its just really me. Anyone feels the same too? I know im not alone.    "], ["The problem with solo mmr", "52", "10", "2024-03-27T03:37:15.597000+0000", "https://www.reddit.com/r/HuntShowdown/comments/1bosadw/the_problem_with_solo_mmr/", "I play 3 games, they go great, I'm hanging out with a 17-2 k/d for the night, insane fights and farmed a few solos for kills (why do people get up so fast nowadays). I scrape my way to 4 star after getting almost no mmr for my kills because of the mmr difference between me and who im killing. I play another game, 6-0, fantastic. I play another game, die to a 3 star team, self rez once, die, go get some food and come back, rez and die again, 10 minutes later. quit game, get no kills. 3 star again.     "], ["Why my otherwise liberal family has a problem with Islam.", "137", "359", "2023-10-25T12:03:29.341000+0000", "https://www.reddit.com/r/IndiaSpeaks/comments/17g35gd/why_my_otherwise_liberal_family_has_a_problem/", "Foreword  As a disclaimer, I was born in the UK and come from a 4th generation Gujarati Lohana heritage. We're one of the few families (3.5 million people in total) that were affected by the 'Indentured Labour' policies of the British Empire, the slave trade that often gets brushed over in favor of the African slave trade. My ancestors were taken from Gujarat to East Africa, before being liberated and moving to Britain, with myself completing the full cycle, settled back in India again. I was brought up in a very liberal Vaishnava Lohana household; my family were very chilled out about most things: meat eating, smoking, drinking and even dating, alongside being very relaxed about our Hinduism, with a 9 day meat-free fast annually for Navratri and Raksha Bandhan being the only things we really did to express our Hinduness . One thing that always struck me as odd was why our family, despite being so 'modern', always had one sticking issue, which was with Islam. As I delved deeper into my Hindu/Gujarati/Lohana history, and learnt more about my gotra (which I won't share here as it would likely give away too much about my identity), I decided that I'd sit down with the family and ask some questions on why there's a zero tolerance policy towards Islam shared between all of the elders, from my parents, uncles and aunties, all the way to my great grandmother. Now being a practicing Vaishnava myself, ditching the: meat, alcohol, smoking and drugs, I feel as though it's only fair for our voices to be heard, So... here goes nothing.  Reasons:   1.) Pushtimarg - Vallabhacharya Sampradaya:   The migration of Shreenathji (Thakorji) from Govardhan Hills to Nathdwara.  Coming from a Lohana background, like most of our community, we tend to follow Shreenathji, with one side of the family having great devotion in 'Sant Jalaram Bappa'. Without delving into the religious significance too much; Shreenathji's Murti first appeared in Govardhan, Mathura, in 1409, discovered and venerated by Shree Vallabhacharya in 1549 - worshipped across the entirety of ' Brajdham ' and surrounding areas. This devotion carried on until it was disturbed by the Islamic invader, Aurangzeb, who ordered the complete destruction of all of Vrindavan and all mandirs dedicated to Shreenathji. Knowing that the order had been given to destroy the original Murti, devotees of Shreenathji, against the will of the people, were forced to lift the Murti out of it's native place, escaping with it in exile for over 32 months at risk to their own lives, until they could find a kingdom to protect it. Their pleas to protect Shreenathji's Murti were rejected by multiple Hindu princely states, who were either too scared or in alliance with Aurangzeb, until Maharana Rajsingh of Mewar vowed to protect the Murti in Udaipur. Finally, in 1672, the Murti was placed in Nathdwara with a whole mandir being built for it, which still stands to this day, which we've all been to. Had it not been for the Mewar Kingdom, almost overnight, the entire Sampradaya would have fallen apart and Islam would have dominated over the entire faith - my grandparents are not only disturbed that our entire belief system could have been wiped out at the hands of one Islamic ruler, but are also disturbed by the fact that the Murti still hasn't been returned back to its rightful place in Govardhan nearly 80 years on from partition. Invaders were only days away from destroying our entire sect, which is still practiced in 2023; this entire history has left an incredibly sour taste in their mouths.  2.) Native Lohana community and our expulsion from Iran / Afghanistan.  Lohanas today are mostly settled in Gujarat, Mumbai & across the UK. Lohanas, 'Suryavanshi', trace their roots back to Shri Ram through a Luv/Kush paternal lineage - often thought of as a Kshatriya clan. Between the 7th and 11th century, Lohanas fought off the Mohammedans successfully in the numerous battles for Afghanistan, until they were pushed back into the Sindh province in modern day Pakistan, until they were persecuted there by Islamists until fleeing to Gujarat. We have direct lineage to numerous soldiers who fought the invaders and were killed in battle, alongside coordinates of temples in records that our community and family members would have built. This history and all of these relics have now been destroyed due to the expansion of the Islamic caliphate which has managed to completely dominate over Afghanistan, a land that my ancestors once decorated and cherished with pride. Today, all that remains is barren sand towns and various coins/broken architecture that were collected by archeologists to prove the ancient Lohana history that used to reside there. Once again, they find it incredibly disturbing that our entire community was subject to genocide, with few escaping, with their descendants living practically nowhere near their native place today. Even Gujarat isn't our ' home ' per se, it's merely one of the few places left where we won't be persecuted for our faith and heritage.  3.) East Africa - Diwali/Eid Food  Whilst living in East Africa, Hindus and Muslims lived side by side to one another. One experience that has always stuck with my family is the exchanges of food. Every Diwali, my family would prepare food to give to serve at the mandir and give to the local community; with this, they also gave food to the Muslims. In exchange, the Muslims would give Hindus their food, sometimes accidentally slipping in some beef and serving non veg bhaajis to the more orthodox, but still friendly Hindus of EA. One year, my great grandmother found all of the food that she'd given to the Muslim families in the bin. When she confronted the families about the numerous parcels she'd found in the bin, they told her that they didn't want to hurt her feelings and reject the food, but they couldn't eat 'prasad' as it was first laid out in 'Ankot', essentially where you first 'feed' food to Bhagwan, before serving it - this would be an act of 'shirk', or sin in Islam. This broke her heart, that all of her and our families efforts were just.. put in the bin. She never forgave them for doing this to the day she died, she saw it as an act of deep betrayal. Going forwards, she never accepted any Eid offerings and broke most of her friendships up with said community.  4.) And there's more...  There's a lot more that they mentioned, often linking back to the personal treatment of our people in India, Pakistan and Bangladesh, alongside the continued mistreatment of Hindus in the UK. The multiple Razings of Somnath Mandir, Gujarat - 16 times if I remember correctly, at the hands of Islamists, also came up. My Dada mentioned, 'In India today, we need prolonged court cases to rebuild mandirs; if Somnath is destroyed once more, then it will likely not be rebuilt for another 100 years' - this really stuck with me. Thinking about what Hindus had to go through to get our own Ram Janmabhoomi built in the native homeland of Hindus is quite frankly disturbing and only proves his point. Whilst we're all up in arms for the rights of natives who were otherwise genocided in the Americas, Africas or Australia.... we, the natives of India, are labelled as 'bigoted' when asking for anything that protects our native people who still live on. I didn't go any further in the conversation with them as it was starting to infuriate my Dadimaa and I didn't want to put any more stress on her, but, there you have it!  End:  I guess one might ask the reason 'why' I felt the need to write this. In the UK, Gujaratis are often accused as unfairly prejudiced towards Muslims and having a certain degree of hostility, not seen in other Indian communities, and I wanted to find out whether that was the truth. Whilst I'm not sure I could buy into the idea of 'collective guilt' when it comes to the actions of all Muslims based on the interactions that my own family have had with them, I guess this is somewhat of an explanation as to where the 'hostility' comes from, at least, from my own families perspective.  Any questions - feel free to drop them below.  Jai Shree Krishna.    "], ["Problem with finding suitable first job.", "1", "4", "2024-04-27T06:33:36.553000+0000", "https://www.reddit.com/r/work/comments/1ce7ujy/problem_with_finding_suitable_first_job/", "Hi I'm 15 and looking for my first job. There's plenty of fast food and retail places around 200m from my school so I could easily walk to them in the afternoon, IF I had somewhere to store my work clothes and get changed. I can't fit them in my bag, I 100% am not changing in the school bathroom and wearing my work uniform in school and lots of the workplaces don't have change rooms and won't let me store uniform there.  I've got to find a solution to this or my parents will have to drive 1H every time I do a shift and fuel costs more than what I'm going to make. Any ideas would be appreciated.    "], ["Problems with fast food", "23", "10", "2024-01-21T13:38:45.129000+0000", "https://www.reddit.com/r/Gastroparesis/comments/19c3ln9/problems_with_fast_food/", "hey yall. i was diagnosed with gastroparesis in july. When diagnosed, I realized what caused the flare up was burger king. since finding out, i've steered clear of most fast foods. Last night, I got wendy's and ended up in the hospital. Is there anyone else whose gastroparesis just can't deal with fast food?    "], ["Problems with working in a fast food kitchen?", "19", "8", "2024-04-14T15:21:38.323000+0000", "https://www.reddit.com/r/StopEatingSeedOils/comments/1c3w0yf/problems_with_working_in_a_fast_food_kitchen/", "Hi, I'm about to start working in a fast food kitchen that uses soybean oil as it's primary in the mix they use. I know that fast food lets those oils sit for days running hot creating all sorts of toxic byproducts. What could be the possible issues from basically standing in this oil for 5 - 8 hours a day on lung health, hormone health, skin health? Aside from breathing it in, the skin is also basically a giant sponge for all the fatty acids and toxins to enter the system. I've only seen one study concluding it disrupts the estrous cycle in females, but no research on how it effects men. This more passive way of getting toxins is often overlooked in favor of how they affect us when ingested, but studies on people who live near highways and in big cities proves that the air we surround yourself with can affect our health. Thoughts? Anything I don't know or study's I could read on it?    "], ["The problems with Junk food and fast food.", "5", "0", "2023-08-05T20:05:30.738000+0000", "https://www.reddit.com/r/offmychest/comments/15j59be/the_problems_with_junk_food_and_fast_food/", "I don't understand how anyone past the age of 24? I guess. Actually craves Soda, chips, fast food  junk food in general, processed nonsense and whatnot. I really stopped craving that stuff back in 2018 when I was slightly more open to just eating whatever and not caring about the consequences. You have these grown Adults lining up for Mcdonalds, the only thing I actually wanted from mcdonalds was that frappucino whatever it was called, the iced coffee drink. That was the last time I ever wanted Mcdonalds. I haven't had headaches, heartburn (acid reflex), stomach ache, feeling bad in general. I haven't been sick since December 18 2018. So almost 5 years ago that I haven't been sick, and yes, I did travel during Covid era, even touched dirty shopping carts and forgot to wash my hands....and to my surprise, I never got sick. Not once, not ever in this almost 5 year period. I know people that get sick every year or every 9 months when they're vaccinated and wipe everything down with bleach and use hand sanitizers all the time, but they're weak. They have a weakened immune system. This is what happens when you live your life off the establishment rather than the Earth. Earth gave us water, vegetables, fruit, Organic meats and organic dairy and Almonds, cashews etc.... People have traded nutrition in the US for carbs, sugar, refined crap, chemicals added to \"preserve\" the freshness, and make it seem like it's new when it's been lying in the shelves for months on end, we're not eating new food by the way. Nothing in the store is new, only when they stock it fresh, then it's new, you know often they re-stock? every 4 months. So we're all eating 5-7 month old produce. That \"feels\" fresh. And then people drink soda, some people drink soda for days on end, soda for breakfast, soda for lunch, soda for dinner. They buy 48 cans of them. So you're too good for real juice? Juice aint good enough for you? I personally drink Peppermint tea and green tea without any sugar, because adding sugar just turns it into sugar water. That's all it is really. Peppermint tea literally fights off inflammation and makes your cold go away much faster. Chicken noodle soup can do that but much less effective. The polyphenols in tea literally stops cancer cells from forming believe it or not. As evidenced by medical science.    "], ["Problems with getting full time employment in PG? Needing", "125", "0", "2023-10-18T23:13:30.283000+0000", "https://www.reddit.com/r/princegeorge/comments/17b4b23/problems_with_getting_full_time_employment_in_pg/", "I'm 21 and quit my last job in September cause I was unhappy there, since quitting I've applied to probably over 60 jobs and have had interviews but no job offers. I've been unemployed for 2 months now and am to the point where I have literally no money for basic needs and will probably end up homeless even though I've never faced that situation and am stressed out to the point where I don't know what to do anymore. Can someone give me any ideas why it's so hard to find a job when I'm eager and searching for work 24/7? And everyone says they're hiring? Ive applied to everywhere I can, even Mcdonalds and got no response. Also if anyone could give me ideas of anyone in town who's hiring that would be appreciated, I check indeed and google everyday and apply to what I can. customer service/retail/fast food. I don't have a drivers license so nowhere that requires that also.    "], ["Problems with Overeating", "7", "3", "2024-03-21T08:46:23.225000+0000", "https://www.reddit.com/r/depression_help/comments/1bk1xel/problems_with_overeating/", "So, this one has a bit of a story. I recently lost over 50 lbs from being 250, over a period of about 5 months from changes to my daily life. I rid my bike more, ate less (due to stress) and felt good about myself. Recently in December, I suddenly lost a lot of momentum of my life entirely. My grades in college started to slip, and I was driving more to school so that made me gain weight. That isn't the big part though. Recently, I have been staying up later, sometimes to 4/5 AM. Sometimes I would drive to school at around midnight and park, and just sleep in the car. I consistently eat fast food definitely over 7 times a week, and I also occasionally go and get 2 tubs of ice cream (the 1/5 Quart ones) and eat one in one go in the morning, and one in the evening, on my days off from school. Then most likely I get hungry again and go out at like 1 in the morning and do a fast food run somewhere close. Rare occasions I \"treat\" myself to about a dozen or more donuts too and shave those off in about a day. I've gained the 50 pounds back in just a couple months. I was wondering what steps I could take besides \"just eat better\" to support weight loss. If you need more background to the story I'm happy to fill it in.    "], ["Which Latin American Countries Have The Worst Problems With Obesity? Which Ones Have The Least Issues With Obesity?", "67", "29", "2023-07-06T06:14:17.977000+0000", "https://www.reddit.com/r/asklatinamerica/comments/14s01r5/which_latin_american_countries_have_the_worst/", "Mexico has surpassed the United States in Obesity. But according to this map: https://landgeist.com/2021/12/09/prevalence-of-obesity-in-south-america/  It is also a big problem in Argentina, Uruguay and Chile as well. How prevalent is obesity in your country? Do you see lots of people with bad eating habits? Is soda, fast food and pastries/desserts popular in your country? Is it common to see normal people become fat when they become adults? Do you worry that your girlfriend or boyfriend will become fat? Do you worry what you will look like at the beach?    "], ["Problems with eating", "13", "7", "2024-04-18T23:44:24.552000+0000", "https://www.reddit.com/r/AutismTranslated/comments/1c7ie84/problems_with_eating/", "Whenever I've been sat down to a meal (mainly supper/dinner), my Dad has expressed his disappointment with me consuming food. In my case, it's been either taking too big of a bite or eating too fast for his liking. Whenever this has happened, he has been worried I would choke. Any advice on how to eat slower and/or not take such big bites?    "], ["Sulfur problems with MTHFR homozygous ", "14", "0", "2024-06-22T15:17:27.719000+0000", "https://www.reddit.com/r/MTHFR/comments/1dlxygi/sulfur_problems_with_mthfr_homozygous/", "Hey all. I recently found out I'm homozygous for c677t. I have high homocysteine (36.5), extremely low folate levels and have sulfur intolerance for many years. I'm making some progress implementing tawinns protocol (all phases). Is it possible that if I push the methylation too quickly or too much (with higher doses of methyl folate, choline + TMG, b6); the excess homocysteine can get converted back into methionine too fast and then I experience an overloaded â\u0080\u009csulfur bucketâ\u0080\u009d? For me I experience that with the following symptoms: Puffy / water retention (most noticeable on face and under chin, but also body), Brain fog Depression Anxiety Extreme fatigue Higher intolerance to sulfur containing foods and protein. Among others. Many thanks    "], ["Anyone else have problems with eating or just me?", "13", "40", "2024-01-04T05:08:46.655000+0000", "https://www.reddit.com/r/adhdmeme/comments/18y4za5/anyone_else_have_problems_with_eating_or_just_me/", "I'm not talking about washing your adderall down with an energy drink and not being hungry all day. I'm talking about trying to eat your food way too fast and almost choking like I did last night or unintentionally attempting to pierce your tongue with your teeth like I did tonight. I don't know if this is an adhd thing or I'm a fucking moron thing, but either way it's not ideal.    "], ["issue with dinner food", "9", "1", "2023-12-12T03:36:06.244000+0000", "https://www.reddit.com/r/PetiteFitness/comments/18gcl74/issue_with_dinner_food/", "so i'm 4'11 and am returning to the gym after a two-month break. i'll be weightlifting and following a program once i do, so that's not an issueâ\u0080¦ the food isâ\u0080¦ i work, so often by 4pm, i'm tired and not in the mood to cook. i don't get fast food, but i'm getting chips/snacks from the gas station twice or more a week in lieu of a meal. i meal prep my lunches do that isn't an issue. i skip breakfasts. and i live alone. my apartment doesn't have a dishwasher or microwave, so i avoid cooking as much as i canâ\u0080¦ something's gotta change in a way that will work. but i have no idea what and i need help with this. i hate. HATE. dishes so i don't want to cook more.    "], ["Ð\u009fÑ\u0080Ð¸Ð²Ñ\u0096Ñ\u0082! I'm learning Ukrainian and I've encountered an issue with communication.", "19", "26", "2024-05-10T02:02:49.272000+0000", "https://www.reddit.com/r/Ukrainian/comments/1coedx8/привіт_im_learning_ukrainian_and_ive_encountered/", "So the question really is, how much Ukrainian/Russian crossover is there to the language? More information - I started trying to learn Ukrainian through Duolingo and I'm not super far in, but what inspired me to start learning was a customer at my work. There is an older gentleman who is Ukrainian and he's very kind but he doesn't speak English very well. He told my manager (with a slightly upset look on his face) that he was Ukrainian when he overheard him say Russian the first time we really ran into a language barrier issue. I've also seen his passport and he's definitely Ukrainian. Emphasis on the Ukrainian because of the question and the words he uses sometimes versus what I'm learning on Duolingo. He comes to talk to me frequently and also one of my coworkers who is Ukrainian but she moved to America when she was 3 and says sometimes he speaks too fast for her to understand what he is saying. I started out using Google translate to try to communicate with him but he often replies in Ukrainian which I couldn't understand and my phone had a rough time translating. I began learning on Duolingo and I've tried talking to him a little bit in Ukrainian, it started with little words, like Ð´Ð¾Ð±Ñ\u0080Ð¸Ð¹ Ð´ÐµÐ½Ñ\u008c and if he had certain food in his cart I'd try to say the word in Ukrainian. But sometimes I've noticed that I will say a word as I learned it on Duolingo and he will say it is a different word, and we have a security guard who is Russian and he says \"that is the word in Russian.\" The first time this happened was with the word for food. On Duolingo it says that food is Ñ\u0097Ð¶a but he said something that sounded like \"peesha\" (I don't know how it would be spelled) but it has happened with other words like he says \"da\" for \"yes\"    "], ["How do I [F20] navigate and resolve this issue with my boyfriend [M26]?", "31", "2", "2024-01-03T02:46:54.094000+0000", "https://www.reddit.com/r/relationship_advice/comments/18x8cae/how_do_i_f20_navigate_and_resolve_this_issue_with/", "TL;DR:  BF makes food that makes me sick, so I started to prepare my own food. BF eats my food because he enjoys eating â\u0080\u009cmeals cooked by girlfriend.â\u0080\u009d BF won't agree to me making his own serving, so I make spicy food. BF upset I make spicy food so he won't eat my food. Conflict leads to rent problems.  So, I've started to pack my own meals whenever I know I'll be at my partner's place or if he's coming over to my place. The meals I prepare ahead of time are always spicy. The only reason I make them spicy is because I know my partner won't be able to eat it. The reason I started doing this is because I started to lose a lot of weight whenever I was around him. The food he'd prefer was food I just couldn't learn to stomach. It would make me feel sick. I really tried to learn to enjoy it, but I couldn't. And to be honest I wanted to be careful with the amount I ate because it can make certain health issues worse. I tried offering to teach him how I cook my meals so we could figure out how to cook meals we could both enjoy. Or at least food we can enjoy together once in a while because I understand how important it is to have food we personally/individually enjoy. We don't have to share and do everything together. (Which is a big thing for him. It's caused a lot of conflict.)  I tried cooking meals that I know he likes and he did seem to enjoy them, but he preferred cooking his meals his way. That's fine. Completely understandable. The issue I'm struggling with is that whenever I brought my own food, that wasn't spicy, he would eat my food and guilt trip me into eating his food. Normally I don't mind sharing, but since he eats a lot more than I do he ends up eating most or all of my food. I would try to ration what was left for my meals. He would try to guilt trip me into eating food that would make me feel sick and if I couldn't do it he would feel insulted. I tried preparing more of my food, offered to bring an extra serving for him, but he would decline an extra serving yet still ate my food. I kept making more and more, but nothing changed. He would eat my food and then make his food and ask why I wouldn't eat his. It caused me to lose a lot of weight to the point family and friends got concerned. I never really realized how much weight I lost until I weighed myself. So, I started to make spicy food for myself which doesn't bother me at all because I love spicy and was raised on it. I noticed whenever I made a spicy dish he would consistently not touch it. I started to make more and he noticed an increase in my spicy food. He asked if I make spicy food so he won't eat my food and I confirmed his suspicions. He was joking when he asked, but when I said â\u0080\u0098Yes' he got upset. He asked if I didn't like his cooking or offered food, why I couldn't enjoy his food, that he felt I didn't like it because it was â\u0080\u009cbudget foodâ\u0080\u009d as he called it,  and generally expressed upset and sadness because I wouldn't eat his food. I explained that I tried to like it, but I just couldn't. It would upset my stomach too much. It would cause me to feel sick. Lots of time on the toilet and throwing up. (Which he gave me shit for and would laugh at me for it with his friends.)  I thought I could get used to it because it's food I never grew up on while for him it was. I thought with enough time I'd get used to it because he eats it just fine. I tried for so long because I was raised to always eat food out of respect. I didn't want to upset him and I feel bad that I just can't get used to it. I just don't know what to do. He tried buying me food, but would then finish my food for me because I wouldn't eat it fast enough. (I struggle to eat a certain amount of food and quickly, so I like to put it aside for later. Always been a slow eater.)  He would then get upset with me because he bought me food I won't finish even though I never asked him to buy me food. He would wake me up with food he already bought, which is sweet of him and I do appreciate it, but it causes conflict and I don't understand why. He'd say since he spends money on me it makes him struggle to pay for rent and so I end up helping him with rent because I feel bad.  ( I also started making my own food so he won't have a reason to buy me food then get mad at me.)  I've tried telling him he does not need to spend money on me. I never asked for it, I don't need or want it, and I don't want him to feel like he needs to buy me stuff over being able to afford rent. When I said that he got upset asking if I think he's incapable of managing his own bills. I explained that I'd much rather he take care of himself first. Especially since I don't really need the things he's buying me and honestly don't care too much for them. He'd buy me electronics, video games, and clothes then would give me shit for not playing games with him 24/7 or not always wearing the clothes he bought me. I don't know what to do. I'm so confused by this. I don't understand why this is such a huge issue or how it became such a huge issue. I never would have thought that preparing food I can eat would cause a mess like this. I don't know how to resolve this issue or move forward.    "], ["anyone else have this issue with cooking hobby?", "3", "6", "2024-03-07T22:01:26.899000+0000", "https://www.reddit.com/r/simsfreeplay/comments/1b96swd/anyone_else_have_this_issue_with_cooking_hobby/", "whenever i get a large group of sims together to work on the cooking hobby (i do this to gain LP fast) only about half will actually receive an item for completing the action. i'm not quite sure how to word this, but more than half of the time, if i tap on the little bubble up top with the food item after the action is done, nothing happens. normally i should be getting an item for it. just wondering if anyone else has had this problem before?    "], ["How should I approach this issue with my boyfriend?", "5", "1", "2024-05-16T03:28:51.972000+0000", "https://www.reddit.com/r/Advice/comments/1ct3nya/how_should_i_approach_this_issue_with_my_boyfriend/", "Hey Reddit, I'm just here to get some external perspective on some issues I'm having with my boyfriend. I (20F) have been dating my boyfriend (19M) for a bit over a year now. He's a complete sweetheart, he has a huge heart and is an emotional guy (not in an aggressive way; he just has big feelings about things and cries easily). These are things I honestly lve about him, but I'm worried things are starting to go downhill. For some background, he has pretty severe OCD and ADHD. He's been diagnosed and medicated since he was about 8, and had to go through some pretty intense exposure therapy for a while. He's overall very functional and operates normally. I, on the other hand, also have severe OCD and ADHD, as well as generalized anxiety and depression. (All professionally diagnosed on both sides, don't worry.) The difference is, I was only diagnosed 2 years ago (ADHD) and this year (OCD). My main issue is this: I feel that he's progressively gotten too comfortable with me and my family. Obviously I want him to feel comfortable, but it's to the point where he treats my house as his own (eg. leaving clothes on the floor, not putting things away, leaving old food/drinks out everywhere, etc.) I feel like I am constantly asking for him to do small things, and he always takes it harshly. For example, I've nicely asked him several times to not leave trash in my room. My contamination OCD is severe, and I will go into a panicked cleaning spree and not be able to sleep if there are germs/garbage in my room. I also get super irritable, which I try to let leave my system before I say anything about it to him. Essentially, I feel like I'm not asking much, but whenever I ask him to change small things about his lifestyle he gets really emotional and treats it as if I'm attacking his personality. He definitely has made small improvements, but not to the capacity I've expected. He sometimes remembers to pick up his garbage from my room, but he'll still leave stuff all over the rest of the house. It feels as if I have to parent him, sometimes. My main question is, how should I approach this problem in a way that won't make him defensive? Am I asking for too much? Should I give it more time for change to come into effect? It's put a strain on our relationship and I'm really not sure where to go from here. I love him and want this to last long-term, but I truly don't know if it will if these things persist. Additional things that have happened:   I've had to bribe him to brush his teeth at night, and that's only the nights he spends with me. I don't think he brushes at night at all when he's at his house, though I know he does in the morning.   He has really poor eating habits, which comes mostly from his upbringing. My family has always been a home-cooked meal (or at least healthier takeout) family, while he grew mostly on fast food. I'm genuinely concerned about his health moving forward, but he refuses to eat healthy a lot of the time.   His car is a mess, and it's definitely gotten better. But most days I get in his car, there's at least one old drink and an old bag of food laying on the ground.   he complains about his stomach issues and headaches often but won't go to the doctor. I have volunteered to schedule him an appointment but he refuses and says he'll do it himself. He's been saying this for a few months now.   Again; he's a genuinely good person with a good heart. I think he lets his mental illness control him more than it needs to, and his willpower is taken over by his desire to avoid discomfort. Let me know your opinions, and please be kind. Thank you in advance, all I'm seeking is clarity in a situation I don't know how to navigate.    "], ["Issue with 2 cockatiels. Wont let the other eat in peace at all. Worried of health.", "2", "0", "2024-04-07T08:06:12.643000+0000", "https://www.reddit.com/r/cockatiel/comments/1bxz3xe/issue_with_2_cockatiels_wont_let_the_other_eat_in/", "Hi! Adobted a rescue cockatiel as a friend for our other cockatiel. We have a issue that when bird A is eating, bird B will come interrupt his eating with loud shouting and get extremely close. Bird B is not interested in the food at all, he only seems to want to do this immediately as bird A starts eating, what ever, where ever, even if there at food available right next to bird A. This has lead to bird A eating much less and starting to loose weight a fast rate and he seems to have less energy to do anything. We are worried of his health They have multiple places to eat, and multiple things to eat. And as i said, this doesnt seem to be an issue of the other wanting to eat as well, as bird B might take one bite out of the bowl bird A is eating of once bird A stops, but thats it. This behaviour has gotten more prominent in the spring.    "], ["Issue With Winged Ants! HELP!", "11", "1", "2024-04-24T11:28:52.394000+0000", "https://www.reddit.com/r/pestcontrol/comments/1cbvrn3/issue_with_winged_ants_help/", "My partner and I moved into an apartment in October. Obviously, with it being colder, we had 0 signs of any pests aside from your normal spider here or there or centipede that got in. We live on the ground level in a 100+ year old building. When the weather started getting warmer, we saw that there were small ants in the house. They would show up here and there if my cat dropped a piece of food, normal stuff! I deep cleaned and sprayed and hadn't had any issues for a couple of weeks.. I still deep cleaned at least once a week and had set bait traps. Fast forward a couple weeks later when we got home from work and saw that there were about 5-10 dead winged ants with a couple of small black ants, some still half alive, all on my kitchen floor in front of the fridge. For context, our kitchen is small and square shaped, when you walk in, on the left wall is the cabinets, counter space, dishwasher and sink, on the wall directly ahead is the electric oven with the fridge in the far right corner. The right wall is our baseboard heat and blank wall that we have cabinets against. I'll deep clean and spray and I won't see any bugs for a couple days, at most maybe one or two.. but then for example, today, I come home and I found 15 dead or almost dead winged ants on the floor in front of the fridge, there were another 15-20 dead winged ants in between the oven and fridge that I found once moving the oven out to clean.. I also KNOW that these are not termites. They are ants.. Because I am finding them dead on the floor with the super occasional one buzzing and flying, that I soon see land and basically die on the floor in front of the fridge or on top of the fridge, they have to be coming from that corner, right?!? HELP, any advice will be appreciated. We contacted the landlord and haven't heard back yet.    "], ["Issue with taste & smell - Sur La Table 8qt from Target", "4", "2", "2024-02-20T16:59:06.680000+0000", "https://www.reddit.com/r/airfryer/comments/1avmkxr/issue_with_taste_smell_sur_la_table_8qt_from/", "I wanted to get everyones thoughts on this, see if I am the only one... I bought this guy for Xmas: https://www.target.com/p/sur-la-table-kitchen-essentials-8qt-air-fryer---cool-gray/-/A-89039435  Unboxed it and was stoked - perfect size, suuuuuper quiet, super fast cooking. I followed the setup instructions and ran it on hot a couple cycles outside on my front porch. Ended up cooking something the next day and noticed that the food tasted like the smell of the air fryer. I was nose blind to it but the smell of burning plastic permeated my whole house. I ran like 10 more high heat cycles for hours and still nothing. I came home days after running those cycles and could smell the burnt plastic smell on my porch despite it being at least a day and a half after running it outside. I tried every trick I could find, running it with super fatty foods, running with vinegar and baking soda, washing it a couple times, but still- the taste and smell was still there. You can literally taste it in the food which is alarming on a health level. I reached out to sur la table and they provided no support, they told me to talk to target about it but I no longer have the box as I threw it away assuming there would not be issues with a well known brand. Mysteriously I also left a 1 star review on Targets website that has never been published despite it being over a month old, and if I try to write another it says I already have a review. There is only one 2 star review that also mentions a smell and taste that doesn't go away. My assumption is that I am not alone and they are just hiding them to move through the units they have. Anyone have something similar? I really wish this didn't happen as this is the best air fryer I have ever had. I guess while we are on the topic.... what am I buying to replace this carcinogen factory?    "], ["Issue with new doctor. How can I \"increase\" TSH before testing?", "23", "17", "2023-07-31T14:50:01.753000+0000", "https://www.reddit.com/r/Hypothyroidism/comments/15eiayk/issue_with_new_doctor_how_can_i_increase_tsh/", "Horrible wording, I know. By \"increasing\" I mean give an as accurate (good representation) result as possible since my TSH fluctuates between 3.3-5.7. Wheb my TSH was checked two days in a row: the first day was 5.5, and the next one was 3.3. I've heard that I should take the test in the morning without any food 10h prior. Is there anything else I can do? Will it give a more accurate result if I get tested 4-5h after falling asleep? Some background to my odd request: My old doctor thought I was undermedicated. My last test showed that TSH was 3.6 and they wanted to lower to under 2.0 so they increased the dosage to 75mg Levaxin. I felt MUCH better in all aspects after this change. New doctor says it should be under 4. Does not care about what the previous doctor said, nor that my symptoms improves, and refuses to research it further (that TSH should be under 2). They want to lower my dosage and claims that my other health issues are caused by the high dosage (7 weeks on 75mg) despite me having those issues LONG before I started medication at all.. and keeps repeating it despite me correcting them multiple times. They didn't listen. I'm gonna look for a new doctor, but I don't think I will find a good one before I'm out of meds. I'm panicking and really scared to go back to the way I felt before. I'm so f*cking tired of doctors who aren't listening and are unwilling to do the research.. I'm gonna leave my next TSH test tomorrow morning.    "], ["Stumped on a buoyancy issue with our calico fantail", "7", "3", "2023-11-11T04:37:14.111000+0000", "https://www.reddit.com/r/Goldfish/comments/17smy0d/stumped_on_a_buoyancy_issue_with_our_calico/", "Hi everyone! I learn a lot from this sub and this is my first time posting. I take care of an established 250-gallon planted goldfish tank at my job. Water quality testing is done weekly and parameters are within acceptable range (ammonia: 0 / nitrite: 0 / nitrate: 20ppm / ph: 7.8 / temp: 70degF). I do 25% water changes weekly. I feed Repashy every morning, and rotate between shelled peas and frozen bloodworms in the afternoon. No pellet food. No fasting days.Â I have a calico fantail that experiences swim bladder issues almost daily after her morning feeding of Repashy. By mid-day, she loses control of her buoyancy and floats at the surface unless she's actively swimming. By the time I return to work the next day, she's back to normal. My job has an established quarantine tank back of house where I've treated buoyancy issues with other fancies in the past with decent success (fasting, Epsom salt, etc.)... but I haven't seen this type of issue before, where it's this predicable and clears itself relatively quickly. Any advice on how to avoid this daily occurrence? She's on display to the public so it's generally not a good look. But I also don't want to pull her out of the tank and into quarantine daily until it passes. That seems more stressful than leaving her alone to clear it herself.Â Edit: adding more historyâ\u0080¦ it took a few months after bringing her home from the LFS to start exhibiting this behavior. She was fine for the first few months, then it started happening randomly. Now it's daily. Thanks in advance, happy to share more details if needed.    "], ["Wife has issues with me fasting from food", "60", "40", "2023-08-06T18:29:12.919000+0000", "https://www.reddit.com/r/Christianmarriage/comments/15jwr3e/wife_has_issues_with_me_fasting_from_food/", "So I have been thinking about fasting and as I was sleeping 21 days came to me which connected me to the Daniel fast. This will allow me to eat certain foods without missing a meal. Because I am pre-diabetic, I can't do the going without food fast because I would basically pass out and die, so this makes the most sense. She keeps telling me bc I am a man I need protein and need to eat meat but I feel like this is an excuse. She also just tell me to fast from gaming because she doesn't like me playing games. I feel like this is something God is telling me to do. What should I tell her. Side note: I did tell her I would fast from games as well but in reality fasting from gaming doesn't seem like much because I will just find something else to do with my time like reading the Bible, prayer, studying and art. Which doesn't seem like it really fasting    "], ["The Boeing issues, the issues with quality of EVERYTHING in the world right now is due to low wages.", "316", "2608", "2024-01-10T09:02:30.992000+0000", "https://www.reddit.com/r/antiwork/comments/193413y/the_boeing_issues_the_issues_with_quality_of/", "When I saw the plane with the side blown off, then read about all the planes having loose screws; my ONLY thought was \"..Well duh, I bet the person doing that job makes $60k a year, which was a lot 10 years ago. Now I doubt they can afford a decent place to live, so they go to work every day thinking \"..I work at BOeing.. I thought it'd be better than this.. \" and because of that, you have a decline in the quality of person who is even willing to do the job. Then you get a bottom of the barrel applicant because you can FUCK them on pay... This is what you get. I posted this before, but I worked in new construction of houses for a while.. The quality of ALLLLL trades is abysmal. Because the pay is abysmal. Starting pay for electrician apprentices is $15-20. Think about that. The person building your new $500k house is getting paid fast food wages, AND getting screamed at by \"OGs\" constantly solely for not knowing how to do the job, since they just fucking started. DOn't believe me? Go visit your new house as it's being built. Look closely at the quality of the work.. Does the foundation have air holes everywhere? Is your front porch ALREADY cracked? How far apart are the gaps where the walls meet? I don't just mean quality is bad., I mean it's terrifying. Standing in a $300k house smacking the foundation with my bare hand, watching concrete just fall off. People want to pay fast food workers the lowest wage possible... then get pissed off when the food is wrong.. Not to mention I guarantee you, they DO NOT want to know what is happening to their food behind their backs. That's what happens when you actively tell people that they are the lowest form of humanity and society, and they deserve the lowest wage; and are treated as such. Doctors are starting to feel the hurt. Insane student loans they can never get out of, mixed with horrible hours and even worse patients.. Who WANTS to do that job anymore? Especially when, NOW in several states, they have to juist.. watch  women die. Knowing they could save them. Because some geriatric fuckwhistle decided jesus wants it that way. Teachers? .... .  .. . . they're actively being threatened with jail if they accidentally teach kids reality. . .. . Yep. That's if the kids live through the day without getting shot. ..sorry. just felt like ranting..    "], ["My (26F) Partner (26M) has serious issues with food. He refuses to get help. What can/should I do?", "222", "247", "2024-05-04T00:02:20.624000+0000", "https://www.reddit.com/r/relationship_advice/comments/1cjn0ht/my_26f_partner_26m_has_serious_issues_with_food/", "My (26 F) partner (26 M) has major issues with food. I understand and completely empathize with this as I used to have pretty intense aversions to a lot of food as a child, but I grew out of most of them. We both have diagnosed ADHD and are medicated, and he's pretty certain that has ASD which we know likely contributes to the issues with food. I try to be as understanding as possible, but he also refuses to get help and sometimes I wonder how he is even still alive considering how little he actually WILL eat. He does not eat any fruit or vegetables at all, and his diet kind of resembles that of an 8 year old who was given unlimited funds and told they could eat whatever they want lol His most severe aversion is to onions, but he has a lot of other spices, flavors, etc. he also refuses to eat. He often claims he is allergic to these things, despite allergy tests clearing him of having any allergies at all. Like I said, I completely understand having aversions to foods, flavors, textures, etc. however, the thing that really upsets me is that he will find a way to have a problem with anything and everything that he didn't cook or order from a fast food restaurant. Even foods that do not contain anything he has an aversion to, he will claim that there is something in it. He acts like whoever cooked the food is trying to poison him. I hardly cook anymore because it often results in fights and food waste. No matter what I do, he will find a problem with what I make. I know what he does and does not like and I never include things he has aversions to (even though I really want to incorporate veggies and certain spices for my taste preferences) yet he always somehow finds an issue. For example, he will find a flake of a spice (that he does not have an aversion to) and say it's a vegetable and then refuse to eat the meal. He will find a piece of fat or something in ground beef and say it's an onion or chopped garlic and refuse to eat the meal. I try so so hard to make foods that are safe for him but he somehow always finds a reason to not eat it. He will dissect all of his food looking for hidden veggies or something else he doesn't like. Even if he was initially enjoying the meal, he 99.999% of the time will suddenly find a reason that he can't eat it. It's just so upsetting and frustrating because I spend so much time and money making food I hope and pray he will like and I am so cautious when preparing the food not to include anything he dislikes. I don't know what to do honestly, I  want to be able to cook for us and also go out to eat at restaurants besides mcdonalds and burger king, but it is becoming impossible. I'm at a loss here, it's putting such a weird strain on the relationship. What can or should I do to help him?    "], ["iâ\u0080\u0099ve never had any issues with my a1c before - please read all ", "16", "11", "2024-06-10T21:02:39.351000+0000", "https://www.reddit.com/r/prediabetes/comments/1dcwj1s/ive_never_had_any_issues_with_my_a1c_before/", "i (22f) went to the doctor last week because i've had horrible back pain since a wreck in 2020 totaled my car. i wasn't able to go to the doc then (18, new state, no health insurance) while i was there to get referred for physical therapy, i wanted to go ahead and get bloodwork done since it had been a minute. i've always been anemic, so that's not new. but apparently my a1c has me sitting prediabetic. (5.7) my family does have a medical history of diabetes, so i understand that plays a factor. they said my bad cholesterol was higher than it should be. they immediately put me on metformin (500mg twice daily) and told me to cut out fast foods and processed foods. not a problem, haven't had any since the day they told me! (i get it was a week ago, but small wins, ok?) is immediately going on medicine without further testing standard procedure..? i wasn't told to monitor my glucose or anything. i was solely told â\u0080\u009ccut out fast foods and processed foods, come back in 3 monthsâ\u0080\u009d i guess i just need some insight into this. is this a life or death situation? will i be able to come off metformin? will just cutting back on fast food help this? is it possible to test highly one day and it fluctuate and i'm actually NOT prediabetic, just higher sometimes? it's just a big deal to me without having any further convo with the doctor ..    "], ["My relationship with food is I absolutely despise having to go to the bathroom, and having issues with having to race to the bathroom. For this reason, I want to fast.", "12", "6", "2023-07-19T14:12:21.155000+0000", "https://www.reddit.com/r/fasting/comments/153w6u5/my_relationship_with_food_is_i_absolutely_despise/", "I am tired of it, and I really want to stop eating so much. How do I fight the initial hunger? Especially after working when I'm wired to eat after I finish working.    "], ["Do reporting issues with food orders negatively impact drivers?", "5", "2", "2024-03-17T20:44:04.965000+0000", "https://www.reddit.com/r/doordash/comments/1bh833w/do_reporting_issues_with_food_orders_negatively/", "Hi guys, the other evening we ordered some fast food and our dasher messaged us as soon as he picked up the order letting us know that the restaurant's soda machine was broken so no drinks. All good and rest of the food was fine. I went to try to get a dollar or two credit for our missing drinks but my wife chimed in that it may come back as a negative mark against the driver. Is there any truth to this?    "], ["Having issues with ticker symbols for Euro company", "4", "3", "2024-04-30T00:26:04.719000+0000", "https://www.reddit.com/r/investing/comments/1cgf79e/having_issues_with_ticker_symbols_for_euro_company/", "I'm likely being a dummy, but they had an IPO mid-April and I know they are listed on the Dutch exchange. edit:  company CVC capital partners How would I buy some shares via Schwab? I see ticker listed as CVC or CVC:NA but Schwab doesn't recognize it. My wife works for one of their subsidiaries and I want to play around with grabbing some shares to hold for the long term. Shares are reasonably priced at around 16 euros and its money that I can lose (not eating fast food for a couple weeks) Any help is appreciated.    "], ["Issues with eating after 2 and a half day fast?", "6", "2", "2024-06-23T19:57:13.125000+0000", "https://www.reddit.com/r/fasting/comments/1dmuq9x/issues_with_eating_after_2_and_a_half_day_fast/", "Hey guys, I recently started my first ever water fast, and as of now I'm 56 hours in. Only problem is that it's my mom's birthday tomorrow, and I don't really want to be rude and not eat at least some of the food that is prepared. Should I break my fast now/tonight? And if so would eating things like greek yogurt and strawberries/blueberries be good?    "], ["I am having trouble with functions and passing by reference", "18", "2", "2023-11-01T23:49:17.736000+0000", "https://www.reddit.com/r/learnpython/comments/17lpz6r/i_am_having_trouble_with_functions_and_passing_by/", "Hello guys, I am a beginner at coding, and I am taking an intro class for business programming. I have to create a program that adds fast food expenses, get an average, and print out a message commenting whether or not the amount of money spent of food is a lot of not. Here is the code:  def main():\n    ff_header(ff_expense, ff_average, ff_message)\n    ff_count(count, ff_price)\n    ff_expense(ff_price)\n    ff_average(ff_expense, ff_count)\n    ff_message(ff_expense)\ndef ff_count():\n    ff_price = float(input(\"Enter how much you have spent on fast food. Enter -1 to stop. \"))\n    count = 0\n\n    while ff_price > -1:\n        count += 1\n        ff_price = float(input(\"Enter how much you have spent on fast food. Enter -1 to stop. \"))\n    return count\n    return ff_price\ndef ff_expense(count, ff_price):\n    ff_expense += ff_price return ff_expense\ndef ff_message(ff_expense):\n    if ff_expense <=25:\n        message = \"Good for you!\"\n    elif ff_expense <= 75:\n        message = \"Not too bad.\"\n    else:\n        message = \"BRUH!!!\"\ndef ff_average(): \n    ff_average = ff_expense / ff_count()\ndef ff_header(ff_expense, ff_average, ff_message): \n    print(\"\\nTotal Price\\t\", \"Average\\t\", \"Message\") \n    print(\"--------------------------------------------\") \n    print(\"$\", format(ff_expense(), \".2f\"),\"\\t\", \"$\", format(ff_average(), \".2f\"), \"\\t\", ff_message())\n\nmain()   The code doesn't work because I do not know how to properly  pass by reference. I don't really know how to connect all of the blocks together to make a working program. Any advice, criticism, and help would be appreciated!    "], ["Having trouble with the â\u0080\u009cWorkâ\u0080\u009d Questline", "7", "9", "2024-02-02T05:12:51.816000+0000", "https://www.reddit.com/r/outside/comments/1agvzmc/having_trouble_with_the_work_questline/", "Hi players! I'm using a new gamemode account because my other gamemode account is for branding, so I decided to make a personal one for more personal things. Anyways. Some background: I just reached level 23 a month ago. For most of my levels 13-17 my character struggled with the depression, ptsd, and anxiety debuffs because of early game trauma from the tutorial Guardians. I visited other therapist players to get help during that time in my playthrough, but my character's issues got worse and I had to visit a few long term mental institution spawn points to get help with my character's debuffs. My character was in these types of spawn points for at most 2 levels. When my character changed spawns to his original spawn, he had to take some potions daily to help with the debuffs and pretty soon the debuffs went away. But because of all of his levels being spent consumed by serious debuffs, he never did the â\u0080\u009cDrivers Licenseâ\u0080\u009d or the â\u0080\u009cGo to Work after Schoolâ\u0080\u009d quests. My character ended up getting his first real money making questline when he got to level 18. That was after he did the â\u0080\u009cJob Corpsâ\u0080\u009d quest and got some kinda useful kinda not certifications and a HSD. The first quest in the money making questline was hard for him. It was almost full time and he didnt enjoy it. The quest rewards were bad, only 7.25 coins an hour because his regions minimum wage is a smaller region in the north of the US server. He moved a lot during this period, home region was the Colorado region, moved to the Texas region for the mental help spawn point, then back to Colorado to put more creds into the learning questline. Did the job corps quest in the Colorado region as well, and moved up north when he was done because while he was doing â\u0080\u009cJob Corps,â\u0080\u009d his adopted Guardians moved. Anyways, my character has had several fast food quests, most of them he either moved villages and had to get new fast food quests or he was kicked off the questline because of poor attendance habits. My character also suffers from the ADHD status effect, which helps a lot with being creative and playing video games but bores him during uninteresting job type missions. I dont really know what to do anymore. My character had the homeless debuff for a little while during that time period after he moved out of his Guardians spawn point, and ended up in the youth shelter (under level 21). His Guardians eventually helped him with his own spawn point. That was almost 3 levels ago. In that time my character has tried many many more job questlines to cover rent and he's hated all of them. I want to make it clear. My character does not hate working in general. In fact during the job corps quest where he gained 2 levels, he got really into the IT and server management questline, and even though he wasnt earning coins, he was learning about servers and networking and he enjoyed it a lot. But because of the global pandemic game event, he got fast tracked before he could get the one certification he needed to start working IT. So basically he got kicked from that questline with no perk tree skills other than a HSD and Microsoft Office. Now hes stuck working fast food quests that he hates for 20 hours a week because he mentally cant handle working more because the depression debuff comes back hard. Especially if the quest isnt something interesting. Cant afford the college path and doesnt want crippling coin debt. My character is just looking for some advice to help him go to a job he hates full time while he saves up coins to get the certification needed to work in IT.    "], ["Iâ\u0080\u0099m having so much trouble with food", "9", "1", "2024-02-20T03:21:33.911000+0000", "https://www.reddit.com/r/GriefSupport/comments/1av7i5k/im_having_so_much_trouble_with_food/", "TW: a lot of talk about food and issues with my body I've been really weird with food for a long, long time. I don't know why this happens, but even if I like a type of food, sometimes I just can't eat it. It just sounds disgusting to me. Because of anxiety and chronic illness, that just got a lot worse. It's like if I actually crave something, everything else sounds even more disgusting to me. So because of that I usually just eat whatever I feel like I'm able to. I remember I read somewhere that making desicions during grief is hard. It took me a while to start experiencing that. I was just crying because I'm to overwhelmed to decide if I should eat noodles or chicken tandoori. If someone asks me how much I want of some food I'll just tell them to decide for me. I just can't care, because I will just break down if I have to think about it. Fast food is almost always easier to eat for some reason, so I've eaten more of it after my best friend died. Then I just end up feeling guilty for eating so much unhealthy. I've already gained so much weight because of health issues and it just makes me feel even worse. I just end up sitting there and waiting for it to become less overwhelming for me. Doesn't really help that much. Kinda makes me feel worse because I get more hungry. Food has been some comfort through all this, but again it makes me feel so guilty. So Idk if it really makes it ant better or worse. Not really sure what my point is with this, but just kinda had to get it out and see if anyone else has experienced this    "], ["Is anyone else having serious trouble with food ?", "3", "5", "2024-01-08T20:54:45.256000+0000", "https://www.reddit.com/r/BPD/comments/191vqp5/is_anyone_else_having_serious_trouble_with_food/", "I migrated a year ago and I'm living on my own, no other family here, for the first time. But I'm having a really hard time with meal preparation and eating as a whole actually. I grew up in a household with fluctuating income, so one year we'd be devastatingly poor, the next we'll live comfortably etc. So diet was very hard to control. On top of that, my parents never really encourage healthy eating (to this day). My mum used to cook quite heavy meals and my parents had this odd idea that eating fast food was what rich or well off people did and they always made it seem like having KFC or McDonald's was some grand event - so we'd have all this fast food for every birthday, every festive type of event etc. i even remember how my mum used to refer to frozen nuggets, sausages, french fries as \"baby food\" ð\u009f\u0098\u0090 All this being said, I never had a problem with my weight. My BMI was always in the healthy range. I'm 153 cm and used to weigh 50 kg up until I was 21 Now I have moved country and I'm realising I don't know how to eat, and I'm getting really anxious about even having some sugar with my tea because I've literally raised my weight to close to 70 kg in the past year. Anything and everything I eat causes me a shit ton of guilt and I don't wanna do this in an unhealthy way because I know it'll just be another form of self harm that I'm adopting. If any of you have faced problems with body image, weight gain please please let me know and I'd also really appreciate it if you could tell me how you've dealt/ are dealing with it. Thank you for reading, this was pretty long. I appreciate it ð\u009f\u0092\u009a    "], ["Having trouble with puppy dropping discarded food", "6", "3", "2024-05-17T12:00:55.276000+0000", "https://www.reddit.com/r/puppy101/comments/1cu3ddz/having_trouble_with_puppy_dropping_discarded_food/", "This is the first time I'm having a puppy while living in a city. My puppy is now around 5 months old. She has no trouble dropping trash (tissues, plastic wraps, etc.) the second I give her the command. Honestly I had no idea how much trash there is everywhere (including in open green spaces) until I got her. Now, the problem is with food. Frequently we encounter food (all types of food honestly but mostly bread) and she won't let go of those on command. Even if I offer her a treat she tries to eat the bread fast and then goes for the treat (of course I don't give it to her then as it wouldn't make sense). I've tried to pull the bread from her but she gets snappy. She never actually bit me (except once but she still had baby teeth so that's why she hurt me), but she does growl and snaps, tries to pull away from me and won't drop it. What can I do in those instances? (I live in a country where it's pretty normal for people to physically punish the dog and I've gotten advice from other dog owners to do that because \"there's no other way\". There is no way and under no condition would I want to hurt her so I'm asking for advice here.)    "], ["Student having trouble with McDonald's job", "13", "3", "2023-07-13T18:14:21.897000+0000", "https://www.reddit.com/r/ESL_Teachers/comments/14ys3yv/student_having_trouble_with_mcdonalds_job/", "Hi everyone, I was wondering if anyone has come across any resources to help learners who are working at a fast food job.  I am tutoring a Spanish speaking woman and she is having an absolutely miserable experience working at Mcdonalds. I'm looking for anything that could help- videos, vocabulary lists of useful phrases, anything at all that would help me help her get more comfortable at her job.  Thank you!    "], ["Having trouble with food and the kid I'm babysitting", "25", "1", "2024-04-21T13:52:39.912000+0000", "https://www.reddit.com/r/AskParents/comments/1c9ieuq/having_trouble_with_food_and_the_kid_im/", "He's 7 and I watch him for 8-10 hours, 4x a week. She has no other family or friends to watch him and cannot afford traditional tutoring or daycare, so I'm  all she has. She drops him off at my place in the morning. On the days he's over I can't really leave home since he's a handful in public. I'm having issues keeping him fed. What she packs for him isn't exactly substantial. On most days she'll send him over with a pack of cheap instant noodles, a fruit cup or smoothie, and a few cookies. This is supposed to last him all day. He's a normal weight for his age and height but has a big appetite and can be a picky eater. I've brought this to his mother's attention twice already. He's also very used to the junk his mom buys or orders for him. My husband and I don't have kids and I'm a light eater, so it's not like we have a stash of kid-friendly frozen foods just lying around for him. I've had to cook for him a few times, but whether he'll eat what I make is another story. He won't eat any potato that isn't a french fry, most fruit, any other vegetables, soup, or meat that isn't a fried chicken nugget. Whenever I tell his mom that her son needs more food, she just throws in another second pack of instant ramen or some other nutritionally void junk that makes his ADHD worse. He's also a little sneaky. I once gave him a few chocolate chips as an incentive for doing his homework and now he snoops around the kitchen looking for them nearly every day. He also tries to make excuses to go into the bedroom (which he isn't allowed in because of his habit of taking things that aren't his) to look for snacks. Not food. Snacks. I know this is pretty normal kid behavior, but it's getting on my nerves. I tried to stock up for him before, but he goes through food so fast it's not feasible with what I'm being paid to care for him. A pack of nuggets he'll finish in 2 days is half of what she pays me, and that's just one item. My own family tells me to feed him only what his mother packs and nothing else until his mom, but I can't let him suffer because of his mom's failings. Do you guys have any advice on what I can say or do to solve this issue? Note: His mom doesn't cook, so meal prep on her days off is out of the question. I've been to their place. The shelves are only stocked with what she likes to eat, adult health supplements, and instant noodles. Like I said before, they only eat out most of the time.    "], ["Trouble with hunger on starting the fast. ", "13", "1", "2024-04-30T13:26:40.239000+0000", "https://www.reddit.com/r/intermittentfasting/comments/1cgstey/trouble_with_hunger_on_starting_the_fast/", "I have been trying for the last few weeks to get on a 16/8 rotation i had done it in the past to great success, but my hunger is insanely bad in the morning and energy level when i wake up in the morning is insane low. When i did it before i was at a point in my life where i just pushed through the hunger and tiredness. In October i started on ozempic and after loosing over 30 lbs i have hit a serious wall and from my past experience this was the diet that helped the most. Any suggestions on how to work through the pain, brain fog and anxiety of being hungry? I hit 299 for the first time since high school and i am motivated so much more than my body is to keep this progress going.    "], ["Counting calories but struggling with a healthy balanced diet", "8", "4", "2024-06-21T19:44:17.949000+0000", "https://www.reddit.com/r/loseit/comments/1dlcrvv/counting_calories_but_struggling_with_a_healthy/", "31F, 5'8â\u0080\u009d SW: 240lbs, CW: 226lbs, GW: 140lbs, Started 6/3/24, Counting calories (~1400/day), fasting 16:8 (fast 8pm-12pm), and 45 mins on the stationary bike 6 days/week. I'm majorly struggling with the diet. My main issue is I HATE cooking. I hate the process of cooking, I'm always scared of a fire happening or burning myself while using the stove/oven, and I hate the dishes and clean-up afterwards. So that majorly reduces my meal options which means I'm mostly just eating a lot of snacks or occasionally fast food. This also means that most days I'm not reaching the full 1400 calories and I'm often hungry. On top of that, I have a huge sweet tooth and I have at least one sweet every day. Unfortunately, artificial sweeteners give me a crazy headache so I can't eat the low-sugar options. My diet has included (this is a bit embarrassing, please don't judge):   Water (usually around 64oz/day which I know isn't enough but I have struggled with drinking water my whole lifeâ\u0080¦ for whatever dumb reason, I hate water and I basically have to force it down)   Fruit (apples, watermelon, grapes, mandarin oranges)   Meat and cheese snack packs from Aldi or Target   Baked chips   â\u0080\u009cSimplyâ\u0080\u009d chips   LF Cottage cheese   LF String cheese   Occasionally a gross frozen meal   Chocolate (like a small 100-200 calorie bar)   Fast food because I always have a ton of calories left for dinner and I don't want to cook (burger and small fries/a wrap/salad/burrito bowl)   I'm fully aware this isn't a healthy diet and, though I am losing weight, I'm definitely not healthy. It's a significant improvement from the amount of junk food/sweets/fast food/soda I was consuming before I started this but, yeah still not great. I'm also unemployed (since Oct 2021) because of mental health (severely depressed, bipolar, and anxious - bordering on agoraphobic). I'm in therapy and on medication and I hope to return to work someday. I live with my husband who is also dieting and he hates cooking too. He's doing keto and 16:8 fasting and has keto meal replacement shakes, keto snacks, and fast food meat that he puts on keto bread/tortillas. Any suggestions? I'm not having a good time and I know that's partially because of my mental health but I think getting physically healthier and losing weight would really help my mental health.    "], ["Struggling with a long term Binge ED", "2", "5", "2024-06-08T10:33:30.384000+0000", "https://www.reddit.com/r/BingeEatingDisorder/comments/1dazyt5/struggling_with_a_long_term_binge_ed/", "I'm a 20 year old woman who has struggled with extreme body dysmorphia and a Binge ED for at least the last 3 years. My bingeing mostly involves me â\u0080\u009ccalorie bankingâ\u0080\u009d such as not eating the entire day and then eating fast food at night. I find it very difficult to not eat fast food, it's like an addiction. I will waste hundreds of dollars on groceries telling myself that â\u0080\u009cI'll meal prepâ\u0080\u009d or â\u0080\u009cI'm going to be good this weekâ\u0080\u009d only to give it up the second I think about fast food. At the beginning of the year I finally decided I needed to see someone and after realising how expensive a psychologist was eventually gave it away. What are some things that help you when you're wanting to binge? Will I ever get out of this horrible slump?    "], ["Struggling with eating healthy/junk food intake. HELP", "3", "2", "2024-06-15T02:15:52.106000+0000", "https://www.reddit.com/r/getdisciplined/comments/1dg7jt7/struggling_with_eating_healthyjunk_food_intake/", "I give in every time I have a craving for cake, honey buns, chocolate, etc.. I also drink a fair amount of juice and chocolate milk. I can rarely go a day without sweets especially on weekends but I eat them every day. I don't want to get health problems and I am already fat (6'3, 284). I am addicted to fast food too. I eat it like 5 days a week...used to eat it 6 or 7 days a week. I have experience cooking but I am not good at it. I wish I did it more often. Fast food just tastes so much better. I only cook like once a week and I usually have meals for the first few days of the week but run out of cooked food by like wednesday. I try to drink water to get rid of sugar cravings. I also eat fruit when I get a craving but it doesn't go away either.    "], ["Struggling with other people in house", "47", "51", "2024-06-18T21:05:19.966000+0000", "https://www.reddit.com/r/keto/comments/1dj1icx/struggling_with_other_people_in_house/", "So I am the only one that is keto in my household- my husband and child are not. I did really well for 1.5 years. I lost 100 lbs. for 6 months I have been struggling with a few days on and off â\u0080¦ with a consequence of gaining about 13-19 lbs. I'm trying so hard to be strong but we all knowâ\u0080¦ it isn't easy and I have messed up. I'm getting myself back on track but my husband (who needs to lose 100 lbs) is buying more junk food than usual and even put donuts under my nose last night. He bought in the last grocery runâ\u0080¦ 6 bags/boxes of chips and donuts, cakes and cookies - leaving them out on the counter for me to walk by. I'm getting upset. I have never bashed him for his food choices. I encourage him to eat some veggies occasionally- he wants to lose weight but refuses to do anything to help himself. I am struggling to have to walk by all this junk all the time. I've started fasting 20 hours instead of only 16. This helps with some of it mentally because the longer I go without eating the less hungry I get. (I get hungry once the fast is broken- then I struggle until bedtime with eating). I really want to get back down to where I was or even lower. I was very sad when I had to buy size 14 pants this week as I have gone up from a 10. I am petrified of gaining more. At my heaviest I was 285 and could hardly walk. I lost 110 lbs and gained 75 back. I then got strict and lost 100 getting down to 150. I have watched the scale creep up to 170 this physical year. I'm trying to fast more and watch my diet and am 163 today. I don't really know why I am posting. I guess I just need to vent - or maybe I know I need to write this for my own accountability. It's hard to be the only one that watches what I eat. He really is a great man. I know he is likely jealous that I have lost weight and he hasn't. I've encouraged him to try keto but excuses. I know I can't say anything to anyone that will make them change. It is an individual decision and mindset and he must become ready for change. I love him dearly and am just venting. I want him to grow old with me. To those that are new to thisâ\u0080¦ keep going. Don't let anyone stop you.    "], ["Struggling with balance", "5", "1", "2024-06-28T01:55:24.403000+0000", "https://www.reddit.com/r/Zepbound/comments/1dq891c/struggling_with_balance/", "I get full really fast now and it takes days to digest food. So when I eat dense foods like a lot of proteins I get full fast and I don't eat much of it. But with things like carbs and sugars, they sit much lighter so I eat more of it. What can I do to help this and be able to fit more protein down without vomiting. This isn't great for my health.    "], ["Help me decipher why my husband said this to me. Iâ\u0080\u0099m struggling with this.", "136", "17", "2023-08-30T04:45:42.631000+0000", "https://www.reddit.com/r/AskMenAdvice/comments/16552pd/help_me_decipher_why_my_husband_said_this_to_me/", "My husband was getting into bed and I was doing some work on the computer. I asked our daughter if she could grab me some of the chocolate gummy bears we bought today so I could have a little fuel to keep working. My husband says â\u0080\u009care you sure you want to do that?â\u0080\u009d Ummmm what the hell!? For reference my husband and I have both been overweight since Covid, I'm not obese, but I'm 40 and I eat healthy but I'm not super active. My husband was obese until recently he's gotten disciplined and has lost 30 pounds since may. But mind you, he was obese and ate really poorly, like pints of ice cream in one sitting entire bags of popcorn or chips. Fast foodâ\u0080¦ lots of fries, lots of fried food etcâ\u0080¦ I typically keep a pint of ice cream in the freezer for a few months and have a couple bites here and there, and eat a couple chocolates around my period time. And I literally mean a couple. I have two candy bars a year and just sneak little bites here and there.  I eat mostly fruits and vegetables and sushi, mean a couple of times a week. Pasta once a month, though I'd have it every day if I couldâ\u0080¦ Of course I'd like to lose weight, but I haven't felt motivated yet and I'm not like THAT concerned about itâ\u0080¦. Regardless, I'm not stupid, there's only one reason that a man would say that to his wife right? And that reason is he thinks she's fat and unattractiveâ\u0080¦.. Thoughts?    "], ["struggling with foodâ\u0080\u0094 advice?", "2", "4", "2024-05-18T02:39:23.183000+0000", "https://www.reddit.com/r/autism/comments/1cun6bt/struggling_with_food_advice/", "hi friends! i sometimes go through phases where i become extremely picky and only want to eat specific things, and it's often fast food that's the only thing i'll eat which is not great for my body nor my wallet, lol. about a week and a half ago i threw up pretty badly because i think i ate something bad, and ever since then ive been really struggling with food. nothing sounds good, and even the things that do sound good i can hardly eat much of. i've seriously reverted to eating like a picky toddler, mac and cheese and chicken fingers only! it's miserable and im starving. any advice?    "], ["Iâ\u0080\u0099m struggling with weight lost and I need advice or motivation or anything to help discipline me", "2", "0", "2024-06-28T04:51:35.841000+0000", "https://www.reddit.com/r/WeightLossAdvice/comments/1dqbinw/im_struggling_with_weight_lost_and_i_need_advice/", "Hi, I struggle to eat healthier and stay consistent with the gym. I used to weigh 145lbs but through out the years I gained 52lbs which I now weight 197lbs. I gained it all through Covid and not just during Covid but after too. I learned to work hard for money and being able to waste it on anything. So I wasted most of my money on fast food with my boyfriend. I feel disgusted with myself. I feel ashamed for how much weight I gained. The worst part is I don't know why I cant lose weight as much. I changed my diet and went into fasting between 12pm-6:30pm and I would eat really healthy and drink a lot of water. I'm trying to stick on the diet but it's hard. I'm trying to stick to the gym and this is the first week in awhile where I have stayed consistent and went for four days. I'm trying to stay consistent and discipline myself. But it's so hard. I want to lose all this fat but sometimes I get frustrated and I feel like I can't. I either maintain or gain. I'm struggling a lot and I need any help or advice. Im trying to eat more veggies and staying away from fried food, fast food, and other bad snacks. I'm trying to drink more water. Please if anyone can give me  advice on how to lose weight because I just don't want to give up. I am a 5'9 female.    "], ["struggling with loneliness", "51", "33", "2024-01-20T17:10:54.058000+0000", "https://www.reddit.com/r/findapath/comments/19bghre/struggling_with_loneliness/", "So i posted a story here couple months ago  about how my life had fallen apart in only one month, I lost my gf, job and friends all in one month. Well I have been doing better recently I picked up a remote job where I work as an insurance agent/producer. However I still have a huge problem, loneliness. I haven't had friends or gone out in months, my social life was already pretty bad before i my gf left me, but at least back then i had her to talk to and loneliness wasn't really a problem. After she broke up with me i realized she was all i really had, i struggle a lot with loneliness and end up spending my weekends at home all alone. I was also seriously considering quitting my remote job and going to work a lesser paying job such as retail or fast food just to make friends/have people to talk too. I know it sounds stupid but at this point i need to be putting my mental health first before anything. Additional info I'm 20/M. Is there any advice you guys can give me on how to make friends/create a network? The loneliness is starting to be a struggle for me, and back then the way i would make friends was through jobs.  I stay home all day and sometimes it gets stressful. And please don't say go back to old friends i tried, that ship has sailed.     "], ["Help Needed: Interview with Coffee Shop/Fast Food Manager for Research Project", "1", "1", "2024-06-09T00:27:02.261000+0000", "https://www.reddit.com/r/gmu/comments/1dbh01v/help_needed_interview_with_coffee_shopfast_food/", "Hi everyone, I am a student at George Mason University working on a research project that requires an interview with a manager from a coffee shop or fast food chain. Despite visiting local Dunkin' Donuts locations and trying to reach out via online platforms, I have been unable to secure an interview. If anyone here works as a manager in such establishments or knows someone who does, could you please help me with a short (20-30 min) interview? It can be conducted virtually via phone or video call at your convenience. Your insights would be incredibly valuable for my project.    "], ["Help needed! To the Indians that cured their fissures and haemorrhoids, how did you do it?", "152", "127", "2023-08-17T05:38:42.188000+0000", "https://www.reddit.com/r/IndiaSpeaks/comments/15te5qx/help_needed_to_the_indians_that_cured_their/", "Firstly, I'm sorry for asking such an embarrassing question here, I know not the right sub but I have been suffering from it from more than 1 year now, I was looking forward to spending 2023 doing something good, outdoor stuff, visit new cities but this problem took that away from me, made me feel miserable, I can't go to new places because I'm always scared the journey would affect my BM, what would happen if I hold my poop for too long, I'm just living same life everyday, mental state is at all time worst, I hate my body for this disease, stopped believing in god, i wish I could just die instead of this pain. I tried homeopathy, allopathy, Ayurvedic, nothing seems to help, they work for some days, let's say a month or so then my fissures recur again, my problem is my poop is always hard no matter how much I exercise, eat healthy, run, from childhood, so I have to take laxatives now and then to soften it, and when I don't take laxative I can't poop, due to hard stools my fissures never get chance to completely heal, I don't drink, smoke, no fast food habits, not too spicy homemade foods, mostly veg, still this problem ain't ready to go away, I have a pretty bad sleep schedule though, I can't sleep more than 5 hours and I mostly sleep at 2/3am, could anyone help me with their advice    "], ["Week 2 help needed", "7", "0", "2024-06-11T03:15:19.608000+0000", "https://www.reddit.com/r/Mounjaro/comments/1dd4bsv/week_2_help_needed/", "Has anyone else felt like a failure in the beginning? I'm on week 2 and haven't lost any weight. It's likely due to my dietâ\u0080\u0094I eat the same foods as before, but reduced portion size. I still crave the same food as but the sweets and chocolate cravings have gone away (huge win for me!). After eating I just don't feel good, but do feel very full and then the guilt takes over. For example, today's lunch was yogurt and strawberries, dinner was 1/2 cup pork with homemade glaze and yogurt mixed with 1 tbs peanut butter, strawberries and graham cracker, probably 2 cups total. I try to get protein each day (but enough). I don't eat vegetables, fast food, fried food or soda. I'm aware that my diet is poor and know what I should and shouldn't eat. I don't cook much, just don't like it and don't like a lot of foods, but when I find something I like I will eat it every day. I work with a nutritionist, which has helped somewhat. Advice? Anyone else have these bad habits?    "], ["Help Needed....", "40", "96", "2023-12-22T10:39:36.127000+0000", "https://www.reddit.com/r/noida/comments/18oc3k1/help_needed/", "Hi Noida NCR waalo. After fighting so much with my family and everyone for my love at last me and my wife are going to be settled now. To bss aap sab ki ek help chahiye if possible, Cooking Mera passion hai so I have opened cloud kitchen for fast food. And really getting so much positive reviews regarding taste and quality thanks to God. But orders kam he aa rahe h abhi kyunki new h kitchen. But quality and taste is my guarantee. We are opening from 12pm to next day 6am. Delivering Noida 63, 62, 50, 15, indirapuram, Noida extension and till 12 km range. Bss iss holiday season aap log orders me meri help kar de so that I can make my dream come true. I will really appreciate that. Link for Zomato and swiggy are posted below.  https://link.zomato.com/xqzv/rshare?id=5602313530563b23   https://www.swiggy.com/direct/brand/463877?source=swiggy-direct&subSource=generic  Or you can search \"Savours Of Noida 'SON' \" Thank you again guys.    "], ["Help Needed for my new CK......", "36", "71", "2023-12-22T10:41:05.423000+0000", "https://www.reddit.com/r/delhi/comments/18oc4ga/help_needed_for_my_new_ck/", "Hi Noida NCR waalo. After fighting so much with my family and everyone for my love at last me and my wife are going to be settled now. To bss aap sab ki ek help chahiye if possible, Cooking Mera passion hai so I have opened cloud kitchen for fast food. And really getting so much positive reviews regarding taste and quality thanks to God. But orders kam he aa rahe h abhi kyunki new h kitchen. But quality and taste is my guarantee. We are opening from 12pm to next day 6am. Delivering Noida 63, 62, 50, 15, indirapuram, Noida extension and till 12 km range. Bss iss holiday season aap log orders me meri help kar de so that I can make my dream come true. I will really appreciate that. Link for Zomato and swiggy are posted below.  https://link.zomato.com/xqzv/rshare?id=5602313530563b23   https://www.swiggy.com/direct/brand/463877?source=swiggy-direct&subSource=generic  Or you can search \"Savours Of Noida 'SON' \" Thank you again guys.    "], ["Guidance/Advice Help Needed", "2", "0", "2024-02-10T08:12:06.160000+0000", "https://www.reddit.com/r/WeightLossAdvice/comments/1anbhlj/guidanceadvice_help_needed/", "I am looking for advice and guidance. I (22M) am 5'10â\u0080\u009dish and weigh around 175/180lbs, and have a larger belly/stomach, chest, and neck fat. At my heaviest I was a little over 190lbs, and hadn't been on a scale in years, and was completely embarrassed with myself. I really put on weight during the COVID lockdown when by daily workouts stopped completely, and I struggled to continue them alone without the strict routine of going to the school for a coach led team practice. Shortly after I got a new job and my intake of fast food significantly increase from once or twice a week to once or twice a day. Last year I moved away with my brother to finish university. I have struggled to create a routine for myself to become healthier. Anytime that I try to change something, like new food or exercise I am met with â\u0080\u009cwhy are you getting thatâ\u0080\u009d or some other form of mockery/judgy comment. I have reduced the amount of fast food I consume, but while being on campus for a few days a week that is what my options are, and it feels like when I am not on campus the â\u0080\u009cwhat's for lunch/dinnerâ\u0080\u009d question has turned into â\u0080\u009cwhat fast food place nowâ\u0080\u009d. Part of it is that that is what my brother always wants, and we are always together (live/school/car). I have lost some weight, but seem to just gain it back the next month or two, and sometimes more. I just can't get into a routine of working out and healthy eating. I seem to fall in to the trap of â\u0080\u009cI don't really want to do that right nowâ\u0080\u009d and then will stop for days/weeks or even months. I am looking to get my weight down to around 160ish and then put on around 20lbs of muscle, I would also like to maintain/build some muscle in the process right now. I graduate this semester and have a vacation in the summer and really want to have lost the weight and start building muscle and have some by then but am struggling on where to start. If anyone has any healthy recipes that are easy/quick/cheap that I would be able to make with a busy schedule and that still taste good. Tips on how to loose the weight and build a routine. Or any workout/exercise tips they would be greatly appreciated. Also if anyone would want to continue to communicate about things like this, or share progress of their journey, or help keep eachother accountable. Let me know we might be able to communicate or create a group on snapchat to all help eachother. Let me know and we can link snap or something.  Sorry for the long post, but I am don't know what else to do. Thank you    "], ["Help needed for shedding!!", "5", "1", "2024-06-25T16:49:22.615000+0000", "https://www.reddit.com/r/cats/comments/1doaolb/help_needed_for_shedding/", "I have two male tabby boys, I think they're half brother cause they were found in the same area two years apart but idk.  That's not the point, the point is they both SHED HORRIFICALLY. And I need food brands that help mitigate the shedding, they're already on a food brand that helps with stomach since the older boy can throw up in times of anxiety or if he eats too fast, should I switch to a wet food brand? If so, which brand best benefits their fur while being good for digestion? Is there a supplement or treat that could be added? Or am I just gonna have to buy a much larger air purifier? Again as far as I know, they are simply tabby male cats, both fixed, one was fixed at 2 years old and the other was fixed around 6 months. The younger one sheds quite a bit more but they both shed enormously.    "], ["Help needed: How do you find gig jobs for a 12th pass?", "2", "1", "2024-04-02T17:37:46.805000+0000", "https://www.reddit.com/r/indiasocial/comments/1bu4t4p/help_needed_how_do_you_find_gig_jobs_for_a_12th/", "Looking for part-time jobs to get exposure. Not really into salary but more into the experience. I've considered fast food places, but don't really understand how to apply to them, like whether online applications actually work. Opinions from anyone who has been in it or has an idea, would be appreciated.    "], ["Serious help needed from all Nagpurkars", "7", "12", "2023-12-15T13:58:24.007000+0000", "https://www.reddit.com/r/nagpur/comments/18j0pag/serious_help_needed_from_all_nagpurkars/", "Being the only Nagpurkar in my office group I also have popat moment face embarrassment as I didn't explored Nagpur during my college days ( paise nai the aur dost bhi nai ). Now whenever my mates ask me suggestions about best place to eat , Travel mere ko kuch nahi pta ð\u009f\u0099\u0083ð\u009f¥²ð\u009f¥²ð\u009f¥²ð\u009f¥² . Please Muje list dedo yaar koi . Best thali in Nagpur ? Best breakfast corner in Nagpur? Best for lunch ? Best for dinner ? Best fast food / chat corner ?    "], ["College Stress is Taking a Toll on My Skin - Help Needed!", "0", "2", "2023-12-18T08:26:45.751000+0000", "https://www.reddit.com/r/Skincare_Addiction/comments/18l3vim/college_stress_is_taking_a_toll_on_my_skin_help/", "I'm a college student (20F) dealing with breakouts and dull skin. Late nights, fast food, and deadlines, my stressed-out skin is paying the price. Any affordable, student-budget-friendly skincare recommendations for a tired, breakout-prone face? A skincare newbie, need your advice    "], ["[TOMT] Need help finding a Japanese film with a scene featuring a fast food worker.", "5", "2", "2024-05-22T00:35:58.436000+0000", "https://www.reddit.com/r/tipofmytongue/comments/1cxnfsr/tomt_need_help_finding_a_japanese_film_with_a/", "I saw a scene from a Japanese film that shows a young fast food worker being trained on the job.  Her supervisor/trainer leaves to go on her break, and just then 3 men come in and order food.  The young fast food worker rushes to make the food as the men start to holler and rush her, with the scene getting more and more frantic and anxious.  I think the scene was also done in one take as well!    "], ["Need help with fast food idea", "8", "3", "2023-07-15T22:13:10.712000+0000", "https://www.reddit.com/r/smallbusiness/comments/150oo2m/need_help_with_fast_food_idea/", "Hey I hope everyone's doing well! To start off, I am a 20 year old who owns a small service business. I have came up with a new idea for a fast food place, and am looking for guidance on how to get started. Things like how to raise money, questions about my source ( That's part of my idea ) and if I need to go through any process, marketing for new food business, and more. Is there someone I can speak with or get in contact with? Or any advice about starting a new fast food restaurant would be greatly appreciated!    "], ["I recently transitioned from retail to fast food and I need help", "6", "3", "2024-01-14T20:01:06.020000+0000", "https://www.reddit.com/r/work/comments/196oo48/i_recently_transitioned_from_retail_to_fast_food/", "I used to work at a grocery store and the environment was pretty tamed and relaxed, I could go at my own pace , stroll around, and sometimes I was even looking for things to keep me busy. However I decided to get a job in fast food because I couldn't handle certain conditions at the grocery store, like having to work in heavy rain storms OUTSIDE. It's barely been a month since working in fast food but I'm struggling. Everything is so fast paced , the customer order their food and since I'm still a bit slow and trying to learn and memorize the menu it slows down my preparation time.  Sometimes when I'm making the food, the customer comes up to the counter and stands over me with their arms crossed while giving me a look threatening look . And I know they're saying â\u0080\u009churry up , I have places to beâ\u0080\u009d. Luckily I have good trainers and co workers who actually help me . But I still feel like I'm lagging behind, it doesn't help that I work at a relatively small business, so there are usually only 2 people scheduled each shift.  Since I'm still new, they schedule me with 2 other people. So If don't pick up the slack then things won't go smoothly when I start working these two people shifts .  It's just really overwhelming and stressful for me. If there's anyone who has been working in fast food for a while and can give me tips I'd appreciate it.    "], ["Need help improving my resume, applying for part-time retail, fast food related work in Canada", "1", "3", "2024-05-04T21:53:36.994000+0000", "https://www.reddit.com/r/Resume/comments/1ckbk0e/need_help_improving_my_resume_applying_for/", "Open to any feedback    "], ["Need help improving my resume, applying for part-time retail, and fast food related jobs in Canada", "1", "1", "2024-05-04T21:52:44.957000+0000", "https://www.reddit.com/r/resumes/comments/1ckbjcj/need_help_improving_my_resume_applying_for/", ""], ["Need help finding primary sources for my paper about \"Fast food and religion in America\"", "4", "1", "2023-11-07T19:22:01.184000+0000", "https://www.reddit.com/r/Essayprowriter/comments/17q22zu/need_help_finding_primary_sources_for_my_paper/", "Your assignment for this paper will be to analyze a case study of your choice. Please select either a primary or secondary source related to food and religion in the US. The primary source can be anything from any period: a cookbook or recipe, a video, a website, a sermon or handbook, etc. The secondary source can be an academic article, chapter of an academic book, or a whole academic book. Using the theorists and case studies from class (at least two to three of these sources), I want you to explain to me why you think this is an important document to understand food and religion in America. One way to argue the paper would be to make a case for why this document or source should be used in the next version of this course. What makes this case important and interesting? What does it tell us about food and religion in the US?    "], ["I just started my first job at a fast food place, and I need help making a budget.", "5", "4", "2023-12-11T00:58:21.323000+0000", "https://www.reddit.com/r/budget/comments/18fibyq/i_just_started_my_first_job_at_a_fast_food_place/", "I don't know much about economics, but I want to make smart spending choices. I also want to save a lot of money since I want to buy my first PC.    "], ["i need help. i can't do this. how do i even fucking start. i'm 450 pounds, addicted to food, in debt because of food, pathetic and constantly getting worse. ", "159", "461", "2024-06-05T17:47:21.636000+0000", "https://www.reddit.com/r/loseit/comments/1d8w2nj/i_need_help_i_cant_do_this_how_do_i_even_fucking/", "I can't reign in this fucking monster. The scope of this problem is so fucking deep that it goes beyond food. It's consumption, mental illness, nonexistent willpower, moral failings, and a constant need for dopamine and I have no idea what the fuck to do.Â  I remember when I was a kid I would sneak to the snack cupboard and literally stuff my face with granola bars. I think early on I was taught that food=comfort. I cared so much about it, my life revolved around it. The act of eating food was paramount. For most kids, it is, kind of, but I think it went beyond with me. For example, when I was 12 I went for dinner at a friends house and his dad, who was a chef, was making mini-pizzas. I had 30. Everyone else went outside to play, and I kept eating pizza. His dad thought it was funny, a challenge. I ate as fast and as much as possible without really thinking about it. My parents fed me well, I wasn't starving, it wasn't a trauma response, i think it was just a greedy part of my personality manifesting. It turned into a trauma response later.Â When I was 14, my cousin, who was like a brother to me, was murdered by my half-cousin along with my aunt and uncle. I turned to food to cope. We ate out all the time in that period.Â  I would run away from the wake (the wake lasted three days) to stuff my face with cannolis and lasagna for as long as I could to gain a little scrape of dopamine. And that continued for the rest of my life. In college, I spent most of my time drinking and sleeping but would spend so much money on pizza and fast food.Â Â When I graduated and stopped living in a city and being active and walking everywhere, my habits caught up with me. I became sedentary. I was never small but from age 25-30 I have gone from 250 pounds to 450, where I am now. It hurts to move and breathe and my chest hurts and I think I am going to die soon. And this is where I have no idea how to turn things around. This is how bad it is. I get fast food, secretly, 5 times a week minimum. I eat gas station food as many times a week. I have 2-3 energy drinks per day.Â My car is literally full of fast food bags. I have spent thousands of dollars on fast food. I will attempt to drive past fast food establishments and have a hyperventilating panic attack until I pull around. I will sneak out of the house to get fast food.Â I drink a two-liter of diet every other day. My legs throb and I have bulging varicose veins. I am so addicted to caffeine that I start to shake when i don't have it. I fog eat, eat my wife's food, overeat constantly,Â  and I have anxiety attacks whenever I don't have â\u0080\u009cenough to eatâ\u0080\u009d. For example, today, I had a bag of tosito chips, a bottle of diet coke, a sausage mcmuffin, 2 celsius energy drinks, a steak egg and cheese on a bagel.Â I spent at least 30 percent of my weekly paycheck on food. I have maxed out credit cards, stolen money (yeah I have sunk that low jesus fucking CHRIST), and been an absolute piece of shit in almost every way. people LOVE ME and I think I love them but I might just be a fucking sociopath because somehow FOOD IS MORE IMPORTANTI don't know where my personality starts and where my mental illness folds into this and how dperession and how and if anxiety fits into this.Â  I have no idea how to unravel this, no idea how to be better, no idea if i'm an irredeemable piece of shit, no idea if i should scorch earth. I can't stay this way. Everything is falling apart and i want to be a better person but I don't know if i can be saved.Â  This shit is pathetic. I have â\u0080\u009ctriedâ\u0080\u009d to change, but it lasts a few days and I'm back in this fucking cycle. I am very self-conscious about my weight and defensive and my health is terrible and I ignore the obvious warning signs of my body. This is the hardest thing I have ever had to deal with and instead of doing the work I am just letting myself be dragged further and further into the abyss and I have no idea how to stop.Â Has anyone ever had it this bad? Am I alone? Where do I start? I am fucking crumbling.    "], ["Help for weight loss meal prep", "22", "19", "2024-04-19T07:32:44.801000+0000", "https://www.reddit.com/r/EatCheapAndHealthy/comments/1c7qy05/help_for_weight_loss_meal_prep/", "I'm trying to lose weight, unfortunately I don't have much time to exercise or money to pay for a gym membership, and I feel like I'm not eating healthy, even if I eat at least 1 fruit a day. I have been working/studying every day and I can't always prepare the healthiest meal to take to work and I end up eating natural sandwiches or fast food.  I have no idea what to do and I'm starting to feel like I'm going to stay like this forever. Can someone help me please?    "], ["I need help for my daughter", "171", "556", "2023-12-07T04:40:51.831000+0000", "https://www.reddit.com/r/loseit/comments/18cnmy7/i_need_help_for_my_daughter/", "Okay my daughter has slimmed down a lot. Like she lost 45 pounds or so. I knew she was eating less but I thought it was in a healthy manner. For example if we got fast food she would get a burger and either not get fries or share them. Come to find out she has only been eating a 1000 calories or so a day for months according to what she was tracking in the Fitbit app. I don't know how accurate she has been tracking either because I didn't know she was until today. She weighs 116lbs and is 5'4â\u0080\u009d. I am going to talk to her tomorrow about how eating so little is not healthy but I need some info. According to a tdee calculator she should weight between 120 and 130 and consuming 1600 calories. Is this accurate? Also my worst fear is she might have an eating disorder and I don't know how to tell. Do I call her pediatrician tomorrow? Do I address her calories with her and see if it was just ignorance? I don't want to give her a complex and I feel like I got to be careful in how I approach this. Also if there is a better sub for this please let me know. Edit. She is 14. We are going to talk to her and come from the side of giving her information. Meaning there are healthy and unhealthy ways to lose weight, be into fitness, etc. I just wanted to get a better understanding of what a healthy weight range was so I could show her the correct calories via a tree calculator. I understand 1000 calories too low. If she is combative I am scheduling a doctor visit right away. Edit #2 We have never criticized her weight. Both my wife and I had parents that were critical of our weight for different reasons growing up. She was 160 last year at her checkup and she was 130 this year at her checkup. The doc asked her about her weight loss and she said she was making better choices. Drinking water instead of soda. If she got a treat, instead of getting a shake she would get an ice cream cone. She wanted to go on walks and be a little more active. None of that screamed a problem. To us at the time we didn't think that was bad. We didn't know she was counting calories until recently and we didn't know she was trying to stick to a 1000 calories. We want to approach this a loving caring way. Hence why I asked about tdee and what is a healthy weight range. If 115 is okay for her gender and age that is fine but she needs to eat more and do this in a healthy manner. Final update. We have an appointment to talk to her pediatrician tomorrow(not with her) to get some advice on how to move forward and approach this. We were going to talk to her tonight but decided to wait until we talk to her doctor. Appreciate the input from you guys.    "], ["Any advice or help for weightloss and motivation", "2", "5", "2024-04-18T03:08:09.681000+0000", "https://www.reddit.com/r/loseit/comments/1c6t44h/any_advice_or_help_for_weightloss_and_motivation/", "Any advice or help for weightloss and motivation I'm 33  and 5'6 weight 250.  I keep trying but at the end of the month I lose all  motivation. For me it meal planning is the hardest. I keep trying but by the end of the week I gave up to fast-food. Idk why but I can't find a plan that just simple to cook and stay with. Im a garbage driver 4am to 2pm so I don't have a place to warm up my food. I tired to fast too but it's difficult after 2pm I'm still hungry and  still  snacks all day till 8pm. I'm just hungry and can't control it . I keep trying going to the gym but i gave up so easily.  Its always busy regardlessthe time and i get disappointed easily.  I tried to look for weights  but its out of my  budget. I even tried to take walks or jogs but I get tried easily ð\u009f\u0098\u0085 I'm not sure if I'm lazy or flat feets. It'd kills me always tired    "], ["Help for beginner", "9", "2", "2024-01-31T06:00:09.439000+0000", "https://www.reddit.com/r/eatventureofficial/comments/1afauvu/help_for_beginner/", "Hi all, Started game couple days ago, beginning of the survey. Have some questions :   How to spend Gems at Vault? Which ones to lvl up for best income. Suggestions pls.   Have all purple gears. How to get legendary or red? Just from box or if lvl max?   Which gear is stat is best? Movement, fast food, perfect etc. Which to focus?   Any more suggestions? What to do at beginning, what not?   Thank you. Have fun    "], ["[23] No Aspirations, Graduated, Unemployed Looking For Ideas, Suggestions & Help For a Career Path", "6", "5", "2024-06-21T19:24:21.162000+0000", "https://www.reddit.com/r/findapath/comments/1dlcb3m/23_no_aspirations_graduated_unemployed_looking/", "Hi, I'm 23, I have no desires, passions, fields I like or a path in my life right now, I have a bachelor's in a field I don't like & I'm unemployed with no certs or internships & less than a year of experience working part-time. I was wondering if there are any good entry level/no experience career suggestions or recommendations anyone had, preferably if they offer some sort of growth potential just so I can start somewhere that's hopefully not draining or dead-end. But I'm feeling really down and like I've wasted my life and time so before I opt out or for any fast food/restaurant/retail job in my area I was hoping for some other suggestions, thank you.    "], ["Weight Gain Help for Anxious Folks (TW: Weight Discussion)", "2", "3", "2024-02-10T14:38:36.175000+0000", "https://www.reddit.com/r/Anxiety/comments/1anhqdp/weight_gain_help_for_anxious_folks_tw_weight/", "I have diagnosed Generalized Anxiety Disorder, and it decreases my appetite making it hard to keep on weight esp when I'm living alone. Has anyone purposefully gained weight, and have any tips to do so in a healthy way? Or better yet, have ways to increase appetite despite always having a baseline of anxiety. Side notes: Fast food gives me acne, and I try to eat a Mediterranean diet to try to avoid the Alzheimers Dementia that runs heavily in my family.    "], ["Need Help for Move", "4", "1", "2024-06-14T23:36:35.230000+0000", "https://www.reddit.com/r/CATHELP/comments/1dg4j8z/need_help_for_move/", "Hey guys, I really need some help. I'm moving to NYC and I'm flying with my two cats (my sibling is coming to carry one for me). One of my cats is very skittish. I was able to get him in a carrier for one vet visit a few weeks ago with 50mg of gabapentin. I was supposed to fly on Thursday and so I got up early and tried to give the cats the dose. The shy cat made me kind of force the food into his mouth that had the pill. I then 1.5 hours later tried to get him into a crate and he let me grab him but then flailed and wouldn't go in crate. 2 hours later I'm covered in scratches and have to rebook flight to next day. On the next day I gave him a dose in some wet food the night before and woke up to give him a much larger dose. However he refused the wet food this time, even crushed and mixed in. I tried again to get him into the crate but failed and got a painful bite. I talked to the vet today and am currently going to have him fast for 2 days and then feed him a max dose the morning of flight. I can either put it in a treat paste or dissolve some on a small amount of tuna fish liquid. Any opinions on these two options? Anything else I should be doing? Im at my wits end here and really need advice. I have to get up there to move.    "], ["Please Help for Getting a Minumum Wage Job", "5", "1", "2024-06-27T17:56:38.128000+0000", "https://www.reddit.com/r/recruitinghell/comments/1dpxmih/please_help_for_getting_a_minumum_wage_job/", "Every retail job I apply to requires lots of experience (some expect atleast a year of retail experience). And as for the fast food jobs, they all are soo overbooked and all say \"we can't hire right now we have way to many employees\". I am not sure what I am supposed to do because I have 2 months of experience at McDonalds (That I quit early because the managers were extremely disrespectful/racist). I also have litte to no connections so I can't exactly get a refferal. On my resume I lied and extended my mcdonald's experience to 13 months and also added 4 months of adidas experience + I have completely open availability and am still being rejected by retail jobs minumum wage jobs for lack of experience. I am unsure what to do because even after faking experience, applying and then following up, and expressing my interest I still get reject. I am scared that I'll get caught in my lies too for fakin and exaggerating my experience but I don't have much of a choice anymore. Should I completely lie and extend my retail experience to a year (so then it'd be 13 momths of mcdonalds and 12 months if some retail job)  in order to get hired? Will I get caught right away for being wildly inexperienced? What should I do? Also, should I lie and say I'm takinf a gap year next year + remove my University education off my resume for better chances? Its so competitive and Im a 3rd year uni student, I NEEED MONEY BADLY RIGHT NOW. P.S: I live in Ajax, and apply in ajax, oshawa, pickering, whitby, scarborough    "], ["Help for painful bloating, constipation, and water retention", "0", "1", "2024-01-09T23:04:24.348000+0000", "https://www.reddit.com/r/Endo/comments/192sl64/help_for_painful_bloating_constipation_and_water/", "I still haven't been able to get a doctor to take me seriously, but based on my symptoms, I am 99% sure I have endo. I was talking to my partner about how I have really extreme bloating and constipation and a lot of times it makes my abdomen very tender. He's Indian, and he called up his sister for a concoction for treating bloating. Miraculously it has worked for me. She is pretty knowledgeable when it comes to these things. However, I will say that this is also in conjunction with changing my diet over the past couple of years to include a significant amount of fresh food and doing my best not to eat fast food or ultra-processed food. I'm not claiming this is a cure-all, but I feel so much better after doing this for over a month now. I have noticed a significant difference while drinking this every morning before eating or drinking anything else: -1 tsp cumin seeds -1 tsp fenugreek seeds -1 tsp ajwain seeds Boil in as much water as you want for a couple of minutes, strain the seeds, squeeze some lime in the water, and drink. You may have a hard time finding fenugreek and ajwain in the regular grocery store, but it is easily found in Indian grocery stores and some other Asian grocery stores. P.S. It doesn't taste that good, but it will grow on you over time. Just think of it as taking medicine. Lol    "], ["Help for my young adult son wanting to invest, learn about wealth building and property investment.", "15", "3", "2024-01-25T05:27:54.190000+0000", "https://www.reddit.com/r/AusFinance/comments/19f1ybp/help_for_my_young_adult_son_wanting_to_invest/", "I hope I'm not breaking any rules here. My son is a 20 year old university student who has several part time jobs. When he was still in highschool he worked for a fast food chain for 3 years part-time and somehow managed to save over 20k before he was 16 years old. He's got a car, a motorbike, no debts and he's a great saver. I'm not sure about the amount in his bank account but im sure hes got a decent amount to invest. He's very disciplined and very interested in building wealth, but doesn't know where to start. He's always talking about his future but he's frustrated.. he wants to be \"rich now\". I wish I could give him better advice but my own knowledge is very limited (although doing ok). Where is a good place to start for him? Who should he talk to? Where can he find a mentor in these matters? He's talking about \"just having a go\" in the stock market because he's so keen to just get his life moving. Honestly that makes me nervous. How can I help and guide him? Thank you for any suggestions.    "], ["Help with ordering at fast food restaurants", "9", "5", "2024-06-26T22:32:54.859000+0000", "https://www.reddit.com/r/deaf/comments/1dpblq0/help_with_ordering_at_fast_food_restaurants/", "So I've been HoH all of my life but recently it's been a lot harder to order food in a fast food restaurant without feeling stupid and playing charades. Can't tell if it's because I have listening fatigue from my day job or if my listening comprehension is getting worse. Just looking for any advice in ordering food in a fast food joint. Thanks in advance!    "], ["Can fasting help with food addiction?", "19", "12", "2023-08-27T20:14:19.705000+0000", "https://www.reddit.com/r/FoodAddiction/comments/1630oai/can_fasting_help_with_food_addiction/", "I am addicted to fast and easy food to the point where it is destroying my health and finances. It seems like I won't go a day without fast food or some sort of microwave/oven convenience food. I have an opportunity over the next two days where, because of finances mainly, I will be all but forced to fast for roughly 48 hours. Will fasting help food addiction? Should I fast longer? Should I fast at all? Any and all constructive advice welcome. Also I work in the sun a lot and currently drink 1.5 to 2 gal of water per day combined with 2-3 small packets of gatorade zero (like for small water bottles) to stay hydrated and keep electrolytes up.    "], ["Foods that help with fasting ", "5", "3", "2024-03-20T18:38:16.500000+0000", "https://www.reddit.com/r/islam/comments/1bjksvn/foods_that_help_with_fasting/", "Salam brothers and sisters, just a quick question to see if someone can help. What foods would you recommend to eat at suhoor? I am a self employed landscaper and around 12pm-1pm I hit a brick wall. My energy disappears to the point its difficult to think properly and I make loads of mistakes. Has anyone felt the same way? What did you do that worked? Thank you    "], ["What foods/supplements can help with fast HR?", "3", "2", "2024-01-11T04:37:48.474000+0000", "https://www.reddit.com/r/AFIB/comments/193t4by/what_foodssupplements_can_help_with_fast_hr/", "I've seen so many different dietary recommendations shared by people who say it has helped them lower their heart rate - bitter gourd to magnesium to raw garlic to potassium. Are there any differences between these apparent remedies when it comes to treating AFib/generally fast heart rates? Any suggestions on what I should try first, and how? Thank you.    "], ["Does eating whole foods help with energy?", "74", "65", "2023-12-20T22:47:37.267000+0000", "https://www.reddit.com/r/nutrition/comments/18n7jiq/does_eating_whole_foods_help_with_energy/", "Let's say you go from eating a diet of 100% Ultra processed foods, frozen foods, packaged foods, and fast food to eating whole foods like meat fruit and vegetables, would it increase energy naturally?    "], ["Highschool student here, mainly going to be applying to full time and part time min wage jobs (Retail, Fast food, etc) I'd appreciate some help with revising, as this is my first time writing a resume :)", "3", "0", "2023-12-20T01:21:22.068000+0000", "https://www.reddit.com/r/resumes/comments/18mi61h/highschool_student_here_mainly_going_to_be/", "For context, I'm homeschooled and 17, been trying to use that to my advantage and applied to countless min wage jobs for the past few months, didn't get anywhere. I wrote this initial resume with a bit of advice from this sub but if anyone could help me figure out how to improve it it'd be greatly appreciated!         "], ["Can anyone help with recommendations for good food near Madison?", "41", "12", "2024-06-01T01:37:13.587000+0000", "https://www.reddit.com/r/nashville/comments/1d5bt73/can_anyone_help_with_recommendations_for_good/", "It feels like everything is fast food. I found out about Green Chile through this sub and am forever grateful. It's so freaking good. Can anyone help out with food that good near Madison?    "], ["Help with leftovers please!", "59", "9", "2024-04-17T15:29:54.587000+0000", "https://www.reddit.com/r/foodhacks/comments/1c6ct1p/help_with_leftovers_please/", "Hey everybody, So lately all of my leftovers have been tasting terrible! It doesn't matter what I cook, when I heat them out, I can't even finish eating them, they just gave a nasty, weird taste. I switched to glass leftover containers as they are not absorbent to odors like plastic, and less toxic. I use unscented dish soap, and I always, always, always make sure there is no soap leftover in the container prior to storing my food! If I take the container out of the dishwasher, I rinse it out with just water before putting food in it just as an extra step to make sure there is no soap in my container. Yet, still, my food has a weird, soapy, just nasty taste. It'd very disappointing because when it's fresh it tastes so good, and I like taking food to work to save money and to be healthier instead of going to get fast food. Buy this is just terrible. I'm using glass. It's clean, there's no soap, am I doing something wrong? Is there a special tyoe of glass that never causes this issue? I can't even eat half of my lunch before I end up wasting it :( can somebody please help me out? I mainly eat jasmine rice, chicken, and a wide range of veggies if that helps. But it doesn't really matter what kind of food it is, it tastes bad after being in the container regardless. Thank you in advance for any help/suggestions, and have a nice day!    "], ["Can a union help with a rude boss?", "24", "5", "2024-06-28T17:02:43.499000+0000", "https://www.reddit.com/r/union/comments/1dqomb3/can_a_union_help_with_a_rude_boss/", "The biggest problem I have where I work is one of our managers, who is quite rude to employees. Can a union do anything to help with this problem? I work at a fast-food restaurant in the United States.    "]]