[["Does anyone have this problem with snake juice?", "4", "3", "2024-04-18T23:39:02.017000+0000", "https://www.reddit.com/r/Water_Fasting/comments/1c7i9ty/does_anyone_have_this_problem_with_snake_juice/", "In the past when I've attempted a water fast, I've made 2 litres of snake juice according to the recipe. However I end up passing a lot of water from my rear end which I believe is caused by the magnesium as it's a laxative. This then makes my muscles ache as my body is not getting enough salts (because of the diarrhoea). What can I do to counter this issue?    "], ["Men whatâ\u0080\u0099s the single, biggest problem with dating, from your point of view?", "529", "288", "2024-06-01T00:15:43.142000+0000", "https://www.reddit.com/r/AskMen/comments/1d5a9pj/men_whats_the_single_biggest_problem_with_dating/", "It seems like dating isn't working for either men or women. What would you do to fix it?    "], ["My problem with Myths of the Realm and Hydaelyn", "48", "0", "2023-10-05T16:37:00.757000+0000", "https://www.reddit.com/r/ffxiv/comments/170mknx/my_problem_with_myths_of_the_realm_and_hydaelyn/", "false  Spoilers for MSQ and alliance story of course.  Hydaelyn fights us to basically have us prove that humanity/the world is at point where we are strong enough to protect ourselves and take on Endsinger. In doing so she also kills herself because she isn't needed anymore. The Twelve basically do just that as well. Now I wonder, why didn't the Twelve suicide for us to use the spaceship instead of using the mother crystal? It was all or nothing at that point anyways. If the WOL lost to endsinger, the twelve would have just died anyways?  Also, the Twelve mention that they've been sucking up all the prayer juice for the last 12000 years and it's shaped them and molded them into what they are. Releasing that back into the world as aether surely would cause disasters no? They say their balancing influence will still be around even after they die but how? Why? They just throw out a line like that and we just believe it? It is what it is?  If they're gone, where is all that prayer juice gonna go now? Where is Hydaelyn's prayer juices gonna go now that she's gone? She is confirmed a primal and we all know multiple of the same primal can't exist at the same time. So now that she is dead, another of her could theoretically be summoned by people just praying to her. It's confirmed that these prayers basically became aether if it wasn't already aether to begin with. Isn't that gonna effectively create primals of the twelve and hydaelyn all around Eorzea? It's not like people will just stop praying and worshipping them going forward.  Unrelated to the Twelve and Hydaelyn, the WOL and friends just peace out of the void to leave two people to figure out how to bring a world back from the brink by themselves? That's wild.    "], ["My problem with the meta being so Gear-heavy is that combat is so simple that it becomes a stat-check.", "159", "108", "2023-10-02T14:35:25.409000+0000", "https://www.reddit.com/r/DarkAndDarker/comments/16xybb3/my_problem_with_the_meta_being_so_gearheavy_is/", "For most classes and trio comps, combat boils down to who has the better gear.  There are a few exceptions, sure, but classes like Barbarian and Fighter and Warlock, etcâ\u0080¦ can just hold W and faceroll you.  Even if you DO run better gear, you're basically doing the same to other teams until you run into a team who's even more juiced.  Sure, it's easy to go caves/ruins and budget run to farm-  but you're basically afterwards just playing a game of â\u0080\u009cwho farmed more for their setâ\u0080\u009d.  There certainly CAN be a lot of skill expression and fun to be had between equally geared teams, but running down players in light kits basically winning for free until eventually matching up against a team playing 16 hours a day who will give you the same fate as your victims isn't a fun loop to me.    "], ["Problem with Drinkmate", "3", "3", "2024-04-25T23:40:13.436000+0000", "https://www.reddit.com/r/SodaStream/comments/1cd6g3a/problem_with_drinkmate/", "Drinkmate advertises that any liquid can be carbonated, but the problem is the liquid (ex: Apple Juice) that goes into the infuser cannot be cleaned by consumer. Inside of it is un-rechable. Has anyone opened it and clean it ?    "], ["Problem with carbs", "7", "1", "2023-12-24T21:39:00.592000+0000", "https://www.reddit.com/r/Gastritis/comments/18q4htj/problem_with_carbs/", "I don't understand what's happening with me anymore.Since I have gastritis( 2 years) I was fine with rice and potatoes but in the past few weeks/months I can't tolerate them anymore.Everytime when I eat potatoes or rice I get bloated.A few weeks ago I tried potato juice but I got so bloated and made my reflux worse.I tried cabbage juice and was the same problem.I can't even tolerate spinach anymore and I was fine with it so far. I don't know what to do anymore and I am losing a lot of weight. Why am I not able to tolerate food anymore? What can I do?    "], ["Vilgefortz and problem with the over powerful characters", "55", "30", "2023-09-22T09:34:18.521000+0000", "https://www.reddit.com/r/witcher/comments/16p5tee/vilgefortz_and_problem_with_the_over_powerful/", "false  Vilgefortz  seems like overpowered character that was expected (for w3 enjoyers, killed the higher vampire Regis with barehand),  but screenplay in series was not continuous. Character seem to get immensely powerful , without proper progression and setups. what was his book character progression actually look like ? Are Koviri druids that powerful ?  IS there any other koviri druids in books  (I know that another koviri druid encounter in Blood and wine, DLC ). Is vilgefortz mutated / juiced / magically enhanced ? Like nothing was provided , he just broke Geralt's bones and starts chasing Ciri.    "], ["The problem with dating advice today is that people are seen as trophies rather than investments", "102", "86", "2024-02-06T19:40:33.089000+0000", "https://www.reddit.com/r/PurplePillDebate/comments/1akihrq/the_problem_with_dating_advice_today_is_that/", "There's a lot of advice these days about becoming a \"high value\" man / woman so you can increase your buying power, score the big deal, buy the \"complete package\" and then that's it... you live happily ever after? But even within this vulgar capitalist framing of human relationships, there's a flawed assumption. Trophies are timeless, they mainly have sentimental value, so they don't appreciate or depreciate. This is not the case with people or relationships. Both can and will change. Microsoft stock was once worth nothing. Nokia was once considered \"high value.\" When your kids beget grandkids, you see how the ROI multiplies. As someone's spouse, you are the most influential person in their life. If 10 years later you decide your spouse is an asshole, it's fair if others ask: what did you do to them? I say if you don't think you can be a positive influence and lead someone in the right direction, don't marry them. So yeah sure, increase your value to get a solid foundation, this isn't an endorsement of a full-on \"fixer-upper\" approach. Just recognize that you're getting a foundation, not a complete package. Today's Microsoft could be tomorrow's Nokia or vice versa.    "], ["Problem with Subdivision surface", "2", "1", "2024-02-29T15:00:50.545000+0000", "https://www.reddit.com/r/blenderhelp/comments/1b32cae/problem_with_subdivision_surface/", "I was trying to make a Juice can but when I applied a subdivision modifier, the hole in it gets messed up, Earlier I thought it's because hole is already subdivided when it was in the geometry so I used boolean for the hole but the problem persists. I am also seeing [ Autosmooth or custom normals detected, disabling GPU subdivision ] in subdivision modifier, I saw an another reddit post about it which says to turn of auto smoothing but it didn't helped. I also tried disabling bevel and smooth shading but nothing helped    "], ["WSJ editor post: Team Cow or Team Soy: The Milk Wars Roiling America As plant-based milks flood the market, dairy producers want to scrub â\u0080\u0098milkâ\u0080\u0099 from labels of alternatives; â\u0080\u0098I got no problem with almond drinkâ\u0080\u0099", "143", "130", "2024-02-05T14:47:42.227000+0000", "https://www.reddit.com/r/wisconsin/comments/1aji7rs/wsj_editor_post_team_cow_or_team_soy_the_milk/", "Wisconsin Gov. Tony Evers wrote to the FDA, lodging a strong objection to labeling plant-based products â\u0080\u009cas nutritious dairy products when they are fundamentally different than the true dairy products that Wisconsin farmers produce.â\u0080\u009d Jeff Karbash, owner of the Duck Inn in Delavan, Wis., said he hoped to stay off the governor's radar. Karbash substituted oat milk for dairy milk in the restaurant's food and grasshopper cocktails while filming an ad for Oatly , the Swedish oat milk company.Â    "], ["Problems with charging a Mophie juice access pack with a Mophie wireless charging stand. ð\u009f\u0099\u0084", "0", "1", "2023-11-08T15:52:22.799000+0000", "https://www.reddit.com/r/mophie/comments/17qolwq/problems_with_charging_a_mophie_juice_access_pack/", "So as the title says, I can't get two products of the same company to work together. It will sometimes charge, but not every day. It's annoying because I really like the product itself because of its full access to the lightning port, allowing hassle free music playing. I have an iPhone XR and XS. Also, I was wondering where I could get a battery case that operates the same way as my current battery case, with future proof usb c charging and full access to the lightning port, when I upgrade my iPhones.    "], ["Problems with public toilets in big cities", "58", "6", "2024-03-11T00:20:52.574000+0000", "https://www.reddit.com/r/travel/comments/1bbpo2v/problems_with_public_toilets_in_big_cities/", "Hello everyone! I want to share a story with you how I had worst 1 hour in my entire life in Paris :) As a little experienced travel I always try to remember that not everywhere it is easy to find a public toilet that can be used. But don't know what happened with me this day, I drunk around 0.7L of juice when I was with my friends hanging around Eiffel Tower and taking pictures. And of course after this amount of juice, my body decided to get rid of this liquid So in this point I wasn't worried at all and said to my friends that I need to use a toilet and will be in 15 minutes. Near to Eiffel Tower they have hella amount of cafes, therefore I decided to ask them to let me use it and I got a â\u0080\u009cNoâ\u0080\u009d cause it is not enough just to buy something in this place, you need to be a guest. But I didn't lose hope and asked around 10 more cafes and they all denied my request. And in last place I almost begged stuff to let me use it, but she said that she cannot let me in to use it and showed me where nearest public toilet is located. So I spent around 20 minutes to ask cafes about letting me use the toilet So in this point I didn't care if it is a public toilet, I just needed to use it as fast as possible. And I just ran to this place and surprise, there was a queue of 15 people before me. I need to tell that it was not a regular public toilet, this one was fully automated and didn't have a regular door that you can open by yourself. After every usage you needed to wait around 3 minutes just for the door to open, so for every person it is at least 5-7 minutes. So in this state I was just sitting on the floor and hoping that my body not gonna give up. And I was so disappointed that in such a big city as Paris it is so hard to fulfill a basic human need. Why am I writing this silly story? Cause I find it is very wrong that in center of such a popular tourist destination, at least around Eiffel Tower it is so hard to find a basic public toilet. And I cannot even imagine how they gonna deal with this problem when there gonna be Olympic Game :(    "], ["Problems with my girlfriends diabetes", "69", "39", "2023-07-07T09:09:26.044000+0000", "https://www.reddit.com/r/diabetes/comments/14t1tpx/problems_with_my_girlfriends_diabetes/", "Hey guys, so this might be long so I apologize in advance, i'm just looking for some advice. To put it as short as possible, my girlfriend has had diabetes since 9, and i've took her to the er for low numbers, DKA scares, and so much more mostly pertaining to diabetes. i've had to call 911 for her 3 times to get an IV with glucose because her number gets insanely low and extreme delirium. Her main problem is night time after she's fell asleep. She recently got Dexcom and it's been 10x better than before which i'm so thankful for and she seems to be happy with it. i've learned everything i know about diabetes from her and her mom, she's the first person i've lived with that had diabetes. we're both 19 if that means anything. So down to why I made the post. More often than not her number goes either super high (300+) or super low (45-) while she's asleep. When i'm home, I stay up usually all night due to my schedule for work being 7pm-5:30am and I watch her number on the app. When it gets low, I grab her some orange juice and a glucose tablet and try to wake her up. When I wake her up, she starts calling me names like â\u0080\u009cpiece of sh tâ\u0080\u009d and â\u0080\u009cstupid bi châ\u0080\u009d along with moans and just overall bad attitude because I woke her up out of her sleep. She's a super sweet girl and when her number is good she wouldn't ever say stuff like that to me so I don't hold it against her but it's just so hard to deal with the way she acts sometimes. She doesn't seem to care as much as I do about her health and values sleep over her health. I force her to drink the orange juice which is always a struggle that takes atleast 20 minutes. She says things like â\u0080\u009cwell if you had diabetes you'd understandâ\u0080\u009d and things like that and I feel like for the most part I have a pretty good understanding, or I try to atleast. I just wanna know what we can do to better avoid situations like these. I care about her so much and i don't wanna constantly argue with her about this for her to tell me that it's me, like i'm the problem and it's my fault that she has the problem she does. there's more to it but i don't wanna make this any longer than it is, and i'd be surprised if anybody read through the whole thing, but any advice? thank you guys    "], ["Smart Changing problems with new Enel X Way app.", "10", "4", "2023-07-17T21:48:53.874000+0000", "https://www.reddit.com/r/electricvehicles/comments/152f59l/smart_changing_problems_with_new_enel_x_way_app/", "I plugged in my on Monday at 4 PM and noticed that it started charging right away. That should not happen based on my smart charging schedule, I so pulled up EV JuiceNet app to see what was happening. That's when I learned that the EV JuiceNet was now defunct and I had to switch to this new Enel X Way app. I logged into the app with JuiceNew credentials, but I could see that the app though my juiceBox was offline and thus my smart charging was disabled. Another attached screen indicated that the new app does know what my car is and it also indicate knows I have a home changer, though I'm not convinced it knows I have the JuiceBox Pro 40, because the icon for \"my\" charger on the app looks nothing like my ( though perhaps the icon always looks like the newest styles of chargers. Does any one have any suggestions? I'm thinking of clicking the \"Add JuiceBox\" box and trying to add my current JuiceBox, but I'm wondering it that will work consider that app might already know my specific JuiceBox. I'm going to try to re-add my JuiceBox to the app, but if that does not work, does anybody know how get the new Enel X Way app to recognize that your old JuiceBox is online. Thanks    "], ["Problems with my ETRS not firing", "7", "2", "2024-03-13T03:05:53.120000+0000", "https://www.reddit.com/r/Bronica/comments/1bdgzem/problems_with_my_etrs_not_firing/", "Hello everyone, I've had problems with my Etrs skipping frames for a while now but I recently got back a almost completely blank roll. The battery has juice, the mirror flips as it should but the shutter won't open most of the time. The red confirmation light in the viewfinder when the shutter has closed only shows up occasionally. Should I just buy another body, since everything else is working fine or is there a way to fix it. Happy to hear from you    "], ["Problems with gilbert's", "19", "1", "2024-04-22T17:27:06.453000+0000", "https://www.reddit.com/r/GilbertSyndrome/comments/1cagokr/problems_with_gilberts/", "Hi I'm 16 and they I am have been suspected of having gilbert's syndrome. I feel nauseous every day and today (second time since symptoms have appeared) my nausea became nearly unbearable and I also started shivering. I'm desperate now as my symptoms are getting worse and I want to know how to make them less intense. If anyone has tips or diet (anything that would help at this point) pls tell me. Edit: the last time I visited the doctor they said those are the symptoms of gilbert's. Yesterday they told me the opposite. So I probably have something alse alongside gilbert's (my eyes are yellow sometimes)    "], ["Problems with high wisp mf mapping", "10", "0", "2024-01-14T04:46:11.605000+0000", "https://www.reddit.com/r/PathOfExileBuilds/comments/1967nca/problems_with_high_wisp_mf_mapping/", "I've been following Fubguns/Tunas MF LA/TS builds, but my character is kind of an amalgamation of the two's. I can kind of comfortably run t11 Burial with high wisp (4-8k), but when I try to move up to t14 or t16 my character doesn't quite have the damage/survivability. My computer can also barely handle the high juice, so I need more character power. Here's my Pob: https://pobb.in/bm9-weOORO0q  Fubguns Pob: https://pobb.in/QBOclC1FYlV2  Tuna League starter I followed: https://pobb.in/hWKqMQrVaa13     "], ["Tummy problems with Covid?", "8", "5", "2024-06-07T01:13:39.617000+0000", "https://www.reddit.com/r/COVID19positive/comments/1d9yjft/tummy_problems_with_covid/", "I've had Covid a few times, but this is by far the worst I've had it. My husband had diarrhea and nausea yesterday, and today I've had diarrhea and threw up for the first time in over 10 years. Have other people had this with Covid? We've had Covid for quite a few days now maybe even a week? Not sure if we got gastro on top of Covid, or if it's all part of Covid? Wouldn't be too likely to be food poisoning because neither of us have really eaten too much recently, the last 24-48 hours neither of us had much of an appetite, we assumed that was just part of Covid too.    "], ["My problems with the current patch (active player, every league since Perandus)", "10", "0", "2024-04-07T21:11:33.579000+0000", "https://www.reddit.com/r/pathofexile/comments/1byfjp0/my_problems_with_the_current_patch_active_player/", "This is my opinion, my solution suggestions. I think last league was rly fun and this league is rly boring. I have 3 characters at 80+ and im still playing just because im trying Wardloop for the first time and its fun. TL;DR: Its a crafting league. Thats ok. But even the crafting is boring and too formulaic. And all the new stuff is too strong, too unrewarding, nerfed existing systems too hard or is too unaccessible to actually be experienced. I really hope the scarab system gets adjusted next league. Compared to what we had before this aint it. The best scarabs are either too rare to actually be used or way worse than expected. 1 in 1500 is a joke. Might as well remove them from the game. Nerf the rarest ones and up their drop rate. Also give us more map device slots. Let every type of T17 unlock one, the new scarabs are so bad you can literally use 4 of the same and its not all that strong. Yes, they drop more often, i get it. But you need all the slots in the map device to juice one mechanic now, where it was just 1 gilded scarab before. Splitting the scarab up into more specific use cases is not a bad choice in itself, but if that means you have to use more of your limited slots to reach the same effect its a straight up nerf. If we get way more scarabs give us way more slots. Its that simple. Dont nerf endgame juicing please. The league mechanic is insanely boring and frustrating at the same time. Literally NO extra monsters. EVERY mob in the mob just got buffed instead while not gaining any quant. Get me out, i dont want to fight for my life against white mobs. All to stack corpses that either result in useless garbage or you stack 100 of them to make a single disgustingly good item (or trash again, happened to a friend). Its literally harvest but worse in every way. The item printing is even stronger, but it feels more like im in a laboratory adjusting knobs than to build an item mod by mod, seeing the progress and fixing mistakes or bad RNG in the process. Its too all or nothing. You use 10 div in corpses? Either mirror bow (in another league lol) or vendor trash.    "], ["Possible fix for battery problems with Lenovo Yoga Slim 7 ProX (6800HS+3050)", "11", "4", "2023-10-25T19:04:37.620000+0000", "https://www.reddit.com/r/AMDLaptops/comments/17gccy5/possible_fix_for_battery_problems_with_lenovo/", "I got mine yesterday and was floored due to how bad the battery life was (getting 3-4h out of it in idle). After reading how other people struggle as well, i check my power draw with hwinfo and was getting 16-17W even without anything running. With 70Wh battery its no magic figuring out why the juice runs out after 4 hours. BUT (!) removing the dongle for my wireless mouse dropped the power draw to 6-7W instantly! I have no idea as to what caused the power surge but it seems its some kind of bug. Please let me know if you experienced similar things and if removing the peripherals helped minimize the power draw.    "], ["Iâ\u0080\u0099m having an issue with 100% orange juice on steam deck", "5", "7", "2024-05-18T04:02:08.910000+0000", "https://www.reddit.com/r/OrangeJuice/comments/1cuonvz/im_having_an_issue_with_100_orange_juice_on_steam/", "Whenever I try to launch 100% orange juice on my steam deck it starts launching it and after â\u0080\u009claunching executableâ\u0080\u009d it stops launching and boots me back to the launch screen. I've tried both in game mode and desktop mode, deleted and reinstalled and verified file integrity and it still won't launch does anyone know any other ways to get it to work?    "], ["The design issue with current league mechanic", "84", "50", "2023-12-18T22:52:29.281000+0000", "https://www.reddit.com/r/pathofexile/comments/18lm3p8/the_design_issue_with_current_league_mechanic/", "The mechanic is great after you have your build finished. When you can farm anything in the game and have in the tens  of million shaper DPS it's great. But it's not what the default in map league mechanic should be. The default version that everyone gets every map should be accessible at all stages of the game, it's one of the big reasons to play the league after all. The current difficulty/reward curve should be an advanced version that you can juice your maps with like with Delirium orbs or Ritual vessels. But it should be something you can opt in after your character is ready. Currently you either need to skip the mechanic entirely or do it entirely there isn't a middle ground. There isn't anything like end Delirium early button, there isn't a take rewards and end encounters Ultimatum button. Difficult mechanics are great for the game but need to be stuff you add manually to your maps not something present baseline but a challenge to be overcome and eventually farmed.    "], ["Sour issue with fruit in secondary", "9", "6", "2023-10-04T14:14:31.462000+0000", "https://www.reddit.com/r/Homebrewing/comments/16zocpf/sour_issue_with_fruit_in_secondary/", "Brewed a simple sour recently (50/50 pils and white wheat), 11ibu. Pitched sourvisiae. After a week it was done. I then added in pineapple juice which has always fermented out in the past when I was kettle souring. No activity this time. Tilt hasn't measured any change in gravity post juice addition either. Ph sample before I added juice was 2.94 (warhead status which is fine because in the past the pineapple juice always masked the tartness). Anyone have any clue as to why fermentation wouldn't have kicked back up? UPDATE The pineapple juice fermented out and it is unbelievably sour. I'm going to dilute it with juice in the keg. Moral of the story is co pitch sourvisiae    "], ["Issue with flavoring beans", "5", "0", "2024-03-03T01:03:56.504000+0000", "https://www.reddit.com/r/CoffeeRoasting/comments/1b549e8/issue_with_flavoring_beans/", "Hello! I've come to humbly ask for advice and pointers. I started roasting at home a couple months ago with the idea of adding naturally some flavours to the coffee. The roasting part I got it, I found good beans, I roast them to a medium level and I am happy with them. But that's where it gets flimsy. I dip my beans when they cool down into some blueberry juice. Since I cannot find documentation on it online I let them soak until they are fully soaked to the core, leaving them even for 6h. I feel like this is too much, I try to bring back their dryness with some fans but to no avail, it really produce poor grinds. I use an oven to re-dehydrate them to some success while it will get the taste of the fruit juice I soak them in while retaining some of its original taste but I feel like I am doing something wrong, if not all of it. I am not talking about the whole wanting flavoured beans idea but the process. I read online about letting the green beans soak pre-roasting, or covering in some flavoured oils once roasted (couldn't find how to make that spray oil at home, I am open to it). I have yet to test those methods as well letting the beans degas in hermethic place with some flavouring on the side. I feel like I hold something novel when the taste is right but I also feel like I could do it better. Any of you have any help, advice or documentation for me? Should I just soak them in juice for 5-10 minutes max so the exterior get the taste but the core stays stable? Thank you so much in advance    "], ["Shutter speed issue with 24 fps Dji Osmo Pocket 1", "31", "7", "2023-10-21T20:01:09.643000+0000", "https://www.reddit.com/r/osmopocket/comments/17db1gy/shutter_speed_issue_with_24_fps_dji_osmo_pocket_1/", "I'm using the DJI Osmo Pocket (#1) to film in \"Pro\" mode at 24 fps, resolution: 4k, shutter speed 1/50 or 1/60 and every time I do a simple pan left to right, the footage looks really jittery almost as if there's a shutter speed issue. I can't figure it out. I've tried to ask a handful of people on the internet and they say I need a neutral density filter but I'm wildly surprised by that answer. I shouldn't have to use a neutral density filter to film smooth pans at 24 fps with the DJI Osmo Pocket. I've tried in low light and bright light at 24 fps, shutter 1/50 and I still get the jittery pans.  I tried shooting at 60 fps and then conforming to 23.98 in Adobe Premiere and it still looks jittery. So my only fix has been to shoot at 48 fps and then conform to 23.98 in Adobe Premiere. And even then the jittery is still vaguely there. I've tried \"slow follow\", \"fast follow\", a myriad of shutter speeds. I can't seem to figure out how to get the jittery to go away on 24 fps pan moves. Here is an example of the jitter I'm referring to:  https://www.dropbox.com/scl/fi/ulogzr2nj5l7fn1fu23e9/DJI_0048.MP4?rlkey=6did5yaqcj1j8az98ieqar7qb&dl=0 (on this one, watch the black crack between the closet doors. see how it vibrates/jitters as I pan by?) is it possible my memory card isnt \"fast\" enough? I'm trying to live chat with DJI Support (the representatives name is \"juice\"). Juice told me to reset my camera and re-calibrate the camera. I did that and it didnt fix the issue. They asked me to update my firmware but my device says \"firmware version 01.10.00.30\" which is the latest firmware. Can someone please tell me why I'm running into this and how to fix it?          "], ["Issue with pc needs fixing desperately", "2", "1", "2023-11-11T16:20:31.365000+0000", "https://www.reddit.com/r/techsupport/comments/17sxte6/issue_with_pc_needs_fixing_desperately/", "Hi there I recently spilt orange juice on my pc but managed to switch it off and clean it out, I have no idea if this has an effect on this issue I'm about to state but over the past few days it's progressively gotten worse and more frequent. My pc will work but then randomly loose display and if I'm on something like a game, the fans and pc makes a engine like noise.. Any advice to fix    "], ["Issue with multiple genetic chemical dependencies", "11", "6", "2023-09-11T19:56:30.168000+0000", "https://www.reddit.com/r/RimWorld/comments/16g5exw/issue_with_multiple_genetic_chemical_dependencies/", "Having a strange issue with multiple genetic chemical dependencies and mood debuffs. Currently my custom xenotype has alcohol and go juice dependency. Usually the drugs are taken at the same time. However after 3 days I will see a mood debuff show Genetic chemical dependency -7. Even though both drugs were taken only 3 days ago. There's no health penalty until the usual 5 days but the mood thing is really an issue for me. Does anyone have a fix for this? The negative mood shouldn't show up until they haven't taken the drugs for 5 days. Not sure why it's showing up so early. I play vanilla with a few quality of life mods so I don't think any mods are impacting this. Thanks    "], ["When I try to turn the car on and all of the lights come on at once like a Christmas tree thatâ\u0080\u0099s usually an issue with the 12v battery right?", "3", "3", "2024-03-19T09:40:25.793000+0000", "https://www.reddit.com/r/nissanleaf/comments/1bigbnq/when_i_try_to_turn_the_car_on_and_all_of_the/", "Hopefully just needs some juice as the cars been stationary for 2 weeks but if it needs replacing it's not the end of the world as long as that's the only problem    "], ["Troubleshooting issues with Cactus Juice", "4", "5", "2023-10-16T16:07:10.766000+0000", "https://www.reddit.com/r/turning/comments/1799krr/troubleshooting_issues_with_cactus_juice/", "Have some ash and red oak that came down that I've been turning, decided to try my hand at stabilizing due to some cracks I had been getting. Got a gallon of cactus juice, activated as directed, put a couple blanks in a vacuum chamber with no more bubbles after a few hours, let it soak for a while, threw it in a toaster oven. Turned a pen blank, the wood seemed weaker than before, and when I tried assembling the pen the wood actually started peeling apart, definitely not something that had happened without resin. Realized I needed to get more scientific about it, read some more, watched some videos. Moisture might be an issue--wood was about 14%. Threw a couple more blanks in the toaster oven, this time with a separate oven thermometer. Set it at 225, thermometer read 240. Baked until I wasn't loosing any more weight on the scale and my moisture meter was lower than its limit of 5%. Ran vacuum until no more bubbles, then about 6 more hours. Soaked for 36 hr in the cactus juice, three times as long as under vacuum (work stuff came up, had planned 24h). Baked 2.5 hr at 220 according to the thermometer in the oven (set at 200). Weight was double the dry weight prior to going under vacuum. Tried turning both blanks today, about 5 days later. First was a pen, and once more having some bits flaking or peeling off as I get to my desired size. Didn't bother finished/sanding to see if it peeled further, didn't want to waste the rest of the kit. Then tried a bottle opener kit. Hollow it out for the hardware to go in, turn it to size, walls are 4-5 mm thick. Drop it while repositioning it, it drops 3 feet onto concrete and splits completely along the drilled hole. Never had these issues with this same wood without resin. The cactus juice seems to have made it more brittle a weaker, rather than the opposite as intended. Hoping someone can help me troubleshoot a bit more--I'm following exactly every step I see online. (Edited for better formatting, on mobile)    "], ["Issues with survivability in juiced/T17 maps on CoC DD", "5", "1", "2024-04-04T23:58:24.224000+0000", "https://www.reddit.com/r/PathOfExileBuilds/comments/1bw39s2/issues_with_survivability_in_juicedt17_maps_on/", "Hi gamers, I've been having a blast with Ruetoo's CoC DD build, I can clear chisel/alched T16s extremely fast and take almost no damage. However, when I try to run with too many altar mods or some super-juiced Rogue Exiles, I find myself getting nuked. I'm ele res/spell supp capped, 4.7k life, 17k armor and 18k evasion with flasks going, but my chaos res is low at 17%. I know I definitely need to get that up as high as possible, but in the meantime, are there any adjustments I could make to my build to help in addition to that? I have considered swapping my Precision for Vitality because according to my PoB I don't lose any DPS and I have hits can't be evaded on my weapon, but this seems wrong to me for some reason. General build criticism is also appreciated!  Here's my PoB for reference: https://pobb.in/rww4lXf80-du     "], ["Issues with Orange Juice on Vinyl", "2", "3", "2023-06-13T23:44:54.075000+0000", "https://www.reddit.com/r/NoahKahan/comments/148t1hp/issues_with_orange_juice_on_vinyl/", "I have the green SS Vinyl and for some reason the volume fluctuates in and out on Orange Juice. This especially happens during the second chorus and is very noticable and frustrating. It only happens on Orange Juice which is a shame because its my favorite NK song. Also the long outro for strawberry wine has popping noises. Its not my turntable because its a nicer/expensive set up and other vinyl play fine. I guess im screwed because you cant get exchanges only returns and the green vinyl is sold out anyways so I cant exchange it anyways. I guess I was just wondering if anyone else was having issues with the vinyl? Specifically with Orange Juice?    "], ["Issues with local farm cider ", "11", "0", "2024-03-03T16:04:37.535000+0000", "https://www.reddit.com/r/cider/comments/1b5kmho/issues_with_local_farm_cider/", "When I use cider from a local farm the final product comes out a little bit smelling like sulfur.  It tastes ok but nothing amazing.  If I buy store bought juice (like Mott's) I don't have any issues. Aside from using pectec enzyme on the farm juice the methods and yeast are the same; only the juice is different. Not sure if I should be doing something different here and could use some advice. Also the farm cider is purchased early in the season if that matters.  Should I be preconditioning the farm cider somehow?    "], ["Anyone see glaring issues with my Penance build?", "37", "5", "2024-02-21T12:37:35.616000+0000", "https://www.reddit.com/r/PathOfExileBuilds/comments/1awb19v/anyone_see_glaring_issues_with_my_penance_build/", "I appreciate the all of you guys give and particular shout out to u/deviant324 who helped me a week or so back with transitioning into a Penance brand build. I am definitely new, this is my first league and 3rd character in that league.   On Playstation where the economy is effed and the trade community really doesn't exist. Here is my current POB https://pobb.in/RWNgbXh2VuxO  I am ok with my damage output but I feel pretty squishy and I am getting one shot quite frequently in juiced maps.   Of course I am never sure quite what is killing me.   I wish GGG gave some sort of kill notification as to what actually killed you but I digress. I could fairly easily bump up my damage another 100k or so with gear sitting in my stash but that would drop my life and armor pretty drastically and exacerbate the issue.   This is the best \"compromise\" I could come up with on a limited budget. Anything stick out as glaringly wrong?  I know the helmet isn't normal for the build but it is allowing a lot of my aura stacking.   Maybe it would be worth it to drop some of the aura's and focus a different way? The careful planning jewel isn't ideal but I needed some dex and I haven't been able to find anything to stick in that slot that would give me a significant upgrade anywhere that would justify tearing apart the build to reallocate dex somewhere or relevel my hypothermia or Vaal haste gems. I am hitting a wall and it doesn't feel good.  I would love a mageblood to have the uptime on the flasks but they are super expensive on playstation and I don't think I have the juice to really effectively farm for it. I have like dozens of multiple div equipment in the stash and WealthyExile says I am sitting at 77 Div worth of loot but the Playstation economy seems completely separate from PC in values and velocity so its basically like I am broke all the time. Any thoughts on how I can get tankier and still reliably kill stuff on juiced maps so I can start generating more divs?    "], ["Issues with customer support", "2", "3", "2024-05-31T19:06:08.360000+0000", "https://www.reddit.com/r/juicedbikes/comments/1d53g7n/issues_with_customer_support/", "Has anyone had to warranty anything with Juiced before? My hub motor is in warranty, and is making a wierd rubbing noise while under acceleration and seems off balance despite my local bike shop truing the wheel. When i contacted Juiced they seem to think nothing is amiss. They also couldnt initially see my video from my google drive bc it has the wrong permissions, yet they never bothered to reach out to tell me that. No phone call, no email, the only reason I found that out is because I called in at the end of the week and another empolyee told me. I'm starting to get fustrated & I feel like they are trying to stall till my warranty runs out in 2 months    "], ["Issues with vacuum seal on chicken", "7", "0", "2024-04-02T18:11:13.553000+0000", "https://www.reddit.com/r/Costco/comments/1bu5nvf/issues_with_vacuum_seal_on_chicken/", "So lately every time I buy chicken from Costco, the juice leaks all over my fridge. Usually one bag out of the whole package isn't sealed properly. Now I have to throw away all my produce because it's on the bottom shelve of my fridge. Doesn't matter what chicken I buy, it can be breasts, thighs or wings. Does anyone else have this issue? This is the second time it's happened in 3 weeks. I only have issues with the chicken. Ground beef and Italian sausages are sealed properly and do not leak.    "], ["If anyone's having issues with constipation or regularity before/after surgery...", "2", "12", "2024-02-21T15:21:27.838000+0000", "https://www.reddit.com/r/hysterectomy/comments/1awemmj/if_anyones_having_issues_with_constipation_or/", "I have two words for you. Prune. Juice.    "], ["Having some issues with my 01 XJ.", "8", "2", "2024-01-09T21:50:11.641000+0000", "https://www.reddit.com/r/CherokeeXJ/comments/192qq4d/having_some_issues_with_my_01_xj/", "I've been have an issue starting my xj. When I turn it on the starter seems to not have enough juice going to it. It does turn on every time tho. I had the battery, alternator and starter motor checked and they had no issues yet the problem persists. Any ideas where I go from here?    "], ["Trouble with juiced T16 maps, is it worth it to run lower tier maps ?", "13", "2", "2023-12-31T04:38:12.878000+0000", "https://www.reddit.com/r/pathofexile/comments/18uzh9f/trouble_with_juiced_t16_maps_is_it_worth_it_to/", "Title. I get screwed quite often by getting too many wisps. The normal mobs in T16 maps aren't a problem but when I hit an abyss sometimes the rare monsters spawning decimate me. I can't find much info about how much of a hit you get on your drops by running lower tier maps. Should I keep running T16 but limit the wisp count to 1-2k or lower the tier but max wisps as much as possible ?    "], ["The Trouble with Performing an Autopsy on a Child", "41", "995", "2024-02-20T13:21:39.612000+0000", "https://www.reddit.com/r/shortscarystories/comments/1avhhwu/the_trouble_with_performing_an_autopsy_on_a_child/", "The boy is only twelve. I double check all my tools. My assistant pleads with me to let her take her lunch. I agree. She's worthless anyway, always yammering about tiktoks. She wouldn't be able to stomach this. Autopsies on children are always the hardest. Not physically, psychologically. Kids aren't supposed to die, cut open a few too many and it might get to you. Worse, are the parents. They always think I'll have some magical answer. It was a super rare disease! They were poisoned! They want me to give them closure. But I think if your kid dies you'll never find it. I examine the body, and the stomach is noticeably swelling. The chart says the deceased complained about stomach pains for weeks before passing in his sleep. I perform my incisions. This kid wasn't lying. His stomach is huge. The likely cause of death was gastric rupture. I remove the stomach. It's heavy and hard. Through the ruptures, I can see something inside it? It might be green? I open up the stomach. Out of it, I pullâ\u0080¦no. I can't believe my eyes. I wipe them. I rinse off what is clearly a watermelon. What type of perversion is this? I wouldn't believe it if it wasn't in front of me. My mind races. GMOs? Or some horrible fertilizer? The kid must have swallowed some mutant seed and it took root in his stomach. The watermelon is vibrant green. So ripe you can smell it. It feels like water is sloshing around in it. Juicy. I'm thinking about murder. Just imagine! All I have to do is crack this bad boy open and take some seeds. Make anyone I want eat the seed and eventually their stomach will rupture, killing them. That cop who keeps giving me parking tickets, my ex-wife. If you put your mind to it, and you knew you could get away with it, wouldn't you kill a few people? Maybe I'll start with my worthless assistant! I grab my best scalpel and start splitting the rind. It's thick like leather. The juice is thick, deeply red. Like corn syrup with red 40. I finally split it in half. The smell, like sweet summer. The fruit is glowing. The meat calls to me. I have to take a bite. I'll be careful to spit out any seeds. One bite isn't enough. The taste is divine. I go in for another and another. My face is practically wearing the melon. I don't even care about the door opening, or my stupid assistant dialing on her phone. I have to eat the other half. â\u0080\u009cPlease. Send the police. I'm at the morgue. The coroner, he's eating the organs of a body. Please. Come quick.â\u0080\u009d    "], ["Bats fights with the JL against cosmic level threats. How does he have trouble with Gotham villains?", "35", "41", "2023-09-12T12:27:06.445000+0000", "https://www.reddit.com/r/batman/comments/16gq26h/bats_fights_with_the_jl_against_cosmic_level/", "Because Batman's rogues gallery, and Gotham itself, is twisted beyond help.  People like Flash or Superman cannot help Gotham the way Batman can.  Two reasons. (1) A good chunk of Batman's rogues are psychotic geniuses.  Joker, Riddler, Hatter, Bane.  There's a reason Arkham Asylum was created.  Sure, Superman could just swoop down and grab the Joker and deliver him to the cops.  But what is he going to do about the poisoned pallet of orange juice being delivered to a retirement home?  How will he even know about it?  Batman is uniquely equipped to not only stop Joker, but make the connection between the orange juice and the stolen shipment of chemicals from five months ago that was used to poison them. (2) The other half of Batman's rogues are baked into the infrastructure of Gotham itself.  Penguin, Dent, Ras, Owls.  There is no â\u0080\u009cfly down, grab Penguin, deliver him to jailâ\u0080\u009d.  These criminals own every aspect of Gotham.  Again, Batman is uniquely equipped to deal this because of his brutality and ability to instill terror.  He breaks the process down from the inside. Why does Batman struggle with villains in Gotham?  Because every other hero would struggle even more.    "], ["Trouble with the rail", "15", "7", "2023-06-19T20:13:36.725000+0000", "https://www.reddit.com/r/HadesTheGame/comments/14dpbah/trouble_with_the_rail/", "I have 19 clears to my name none of which have come with the rail. No matter what build I try it never seems to have enough juice or I find myself being static for too long. Thoughts?    "], ["MF TS Struggling with juiced 6k+ T16s. ~75 div to spend, what should i prioritize as upgrades?", "5", "0", "2024-01-08T22:01:55.404000+0000", "https://www.reddit.com/r/PathOfExileBuilds/comments/191xg42/mf_ts_struggling_with_juiced_6k_t16s_75_div_to/", "https://pobb.in/zprGuVSMS1wq   Whenever I get to 6k+ wisps (and even sometimes 2k+ depending on map mods) I'm getting my shit absolutely kicked in by mobs. Mainly abyss carrion golems or beyond rares with high move/attack speed that one-tap me before I can move away. A lot of maps it seems like if I die once and lose my HH stacks its essentially GG. T7 and T11 are a cakewalk, I might die once every handful of T11s when I have a ton of wisps.  I've got ~75 div to work with atm. Right now im thinking:   Get level 100   Swap timeless to one with more reduced crit damage nodes (50%)   Get enlighten 4 to free up chest corrupt   Get 50% reduced crit corrupt on chest to hit 100% reduced crit damage   After that I'm not sure what would be next in terms of value/cost. Massive Thread of Hope would open up some passive points but is 90+ div.    "], ["I(M18) am Struggling with Girlfriendâ\u0080\u0099s(18F) Celebrity Crushes. How can I address my concerns with her without causing conflict?", "246", "177", "2024-03-29T13:21:03.071000+0000", "https://www.reddit.com/r/AdviceForTeens/comments/1bqp54j/im18_am_struggling_with_girlfriends18f_celebrity/", "Hey Reddit, My(18m) girlfriend(18F) and I have been dating for six months, and things are great overall. However, there's one thing that's been bothering me: her intense fandom for Chris Brown and Trey Songz. While I can understand having celebrity crushes, it's who she's idolizing that's causing me some insecurity and frustration. Both Chris Brown and Trey Songz have a troubling history of abuse allegations, which makes it hard for me to reconcile my girlfriend's admiration for them. People act like Chris Brown only hit Rihanna but there are other disturbing allegations after Rihanna. What's even more concerning is how she adamantly defends them, refusing to acknowledge their faults and dismissing any criticism as \"hate.\" This has sparked some insecurities for me, as it feels like she's prioritizing her admiration for these celebrities over acknowledging the harm they've caused. It's led me to question our compatibility and whether we see eye-to-eye on important values. I've been hesitant to bring up these feelings because I don't want to cause conflict, especially since things are going well between us. However, I know it's important to address these concerns in a healthy way. How can I communicate my feelings to her without coming across as judgmental or insecure? TL;DR: My girlfriend's intense fandom for Chris Brown and Trey Songz is making me feel insecure and frustrated, especially considering their history of abuse allegations. How can I address my concerns with her without causing conflict? EDIT: we are both black. if that matters.    "], ["Struggling with greens - tricks and tips?", "3", "2", "2024-02-18T17:12:20.881000+0000", "https://www.reddit.com/r/Juicing/comments/1atz2he/struggling_with_greens_tricks_and_tips/", "Recently bought the breville juice fountain and adore it. So far watermelons and lemons are my favorite surprises when it comes to my new routine. I am but an extreme beginner juicer. I try to do green juices though and I get like a tablespoon of juice from a fat fist full of spinach. Celery and cucumbers and things work fantastic, anything leafy though just gets whipped around and ends up in the pulp reservoir. Is there that little juice in there? Or am I doing something wrongâ\u0080¦.    "], ["Struggling with tapering off nic", "3", "3", "2024-01-20T21:07:47.092000+0000", "https://www.reddit.com/r/QuitVaping/comments/19blxzk/struggling_with_tapering_off_nic/", "I've been a daily nicotine user for over a decade. I smoked Marlboro reds and chewed Copenhagen snuff to start with, and switched to vaping 50mg salt nic around 5 years ago while occasionally using smokeless tobacco as well. I decided I needed to try to taper before kicking my habits due to becoming physically ill trying to quit cold turkey in the past. I have been gradually decreasing my nicotine consumption I am down to 6mg vape juice (8 to 10 mL a day) and 6-10 6mg zyn pouches a day. I feel like I'm doing more harm than good trying to quit like this and I'm smoking 10x the amount of juice I'd normally go through in a day's time. Would I be better off sparingly using 50mg juice and setting a daily limit for myself at this point or should I do something different. I really want to quit but due to years of heavy use I feel like it's pointless and nothing will satisfy my cravings. I'm getting really discouraged and I feel like no matter what I do I'll never be able to quit    "], ["Struggling with lust ", "39", "8", "2024-04-11T11:15:39.897000+0000", "https://www.reddit.com/r/Osho/comments/1c1cgua/struggling_with_lust/", "So i am a teen(16) and i feel my sexual desires are only increasing with time what should i do, its like a fire is burning within me of sexuality, i know i shouldnt suppress it but thats what i am doing right now cause i dunno what else to do. I dont just want to keep indulging in sex as i feel its a waste of energy (i dont get sex anyway i just masturbate).    "], ["Struggling with Aiptasia? This solution worked for me", "28", "22", "2024-04-02T17:12:49.180000+0000", "https://www.reddit.com/r/ReefTank/comments/1bu4618/struggling_with_aiptasia_this_solution_worked_for/", "Hey reefers. Like many of you, I struggled with Aiptasia for about a year now. I tried Joes Juice, Red Sea Aiptasia X, and those methods worked great to zap an individual anemone, but they always came back somewhere else. I got Peppermint shrimp, but something wasn't compatible in my tank and they eventually all died (or more accurately, disappeared). Maybe one of my other fish ate them. I tried Berghia Nudibranchs, but didn't consider my possum wrasse found those a very expensive snack. I saw on a handful of websites that Copperband Butterfly fish eat Aiptasia. Well, I decided to give it a try, and boy did it work. I put the fish in on a Friday, and by the following Monday I couldn't find a single Aiptasia, and haven't seen one since. The Butterfly fish was a bit nervous for the first two weeks, but is now one of my more chill and entertaining fish, and eats the frozen food I put in with as much glee as I assume he gobbled those Aiptasia. Anyway, if you've got a tank big enough for one and this is an option for you, I can fully endorse it as a viable solution. Edit: There's some good advice in the comments about this, regarding other coral compatibility and dietary pickiness. Worth keeping those things in mind as well when considering this option.    "], ["Finally am enjoying working outâ\u0080¦ but struggling with getting protein?", "90", "23", "2023-11-29T21:19:16.027000+0000", "https://www.reddit.com/r/gainit/comments/1870di2/finally_am_enjoying_working_out_but_struggling/", "For the first time in my 23 years of existence, I'm working outâ\u0080¦ and I like enjoy it? I've always hated it. But now that I'm a dad of two kids under two, it's literally the best way to get out of the house and blow off some steam. And even better, our gym has child-care so it's not a burden to be out of the house on the wife. I'm seeing some of the best progress I ever have, however, I feel like I'm at a huge disadvantage because I HATE protein powder. I think it's absolutely disgusting. Everyone gives me advice on what to add to it, bananas, peanut butter, granola, yogurt, but nothing can get that sickening taste out for me. That being said, any hacks or major sources of protein to look for as someone who hates protein powder? I'm a pretty busy guy, constantly on the go. Bonus points for convenience.    "], ["For those struggling with ship names, here's some guidance!", "158", "388", "2023-10-12T02:39:14.923000+0000", "https://www.reddit.com/r/StarfieldShips/comments/175w7wo/for_those_struggling_with_ship_names_heres_some/", "I know, naming things is hard, I run dnd and still end up calling everyone Albert lol. There's also a lot of frustration from people seeing the posts asking for names, and instead of just another complaint post, I thought I'd try give some helpful advice, and also maybe flex a bit of my dnd muscles in coming up with narratives. (Small note, can't figure out how to do markup on mobile so apologies for terrible formatting, if this post does well I'll make it more flashy tomorrow) Now mildly more flashy!   United Colonies ships  For UC ships, I like to name them after medieval armour pieces. To me it fits with the theme of them defending the universe. They're also all prefixed with \"UCS\" (United colonies ship) but that can be omitted if it feels out of place. It's been pointed out that there UC ships in game are just prefixed with \"UC\", and there's a \"UCS\" ship that exists that I forgot about, so I'll be swapping to that for the suggestions, but again can be ommited. Just Google some medieval armour pieces, and pic one you like! Someone suggested using old real-world spacecraft names, and I realised running out of armour pieces can be a thing, so would make sense to use those, perhaps naval ships, and someone else suggested naming after submarines as well!  Examples:  Capital Ships   UC Brigandine   UC Hauberk   UC Faulds   Frigates   UC Pauldron   UC Vambrace   Fighters   UC Gaultlet   UC Sallet     Freestar Collective  Freestar members are generally roughing it in the wilds, farmers, hunters, miners etc. So I like to name the ships after animals (earth and alien), farming tools, geological features and the such, making it easy to Google these things. I also like the idea that they keep this identity, but are registered under the freestar collective with a designation. I opted for base 36 (all letters of the alphabet + digits 0-9), because I also like mathy stuff lol, but again can be omitted.  Examples:  Capital Ships   FC-H9 Rhinoceros   FC-FQ Ventifact   FC-4V Combine   Frigates   FC-U8 Ashta   FC-2E Fjord   FC-BZ Baler   Fighters   FC-53 Peregrine   FC-7D Arete   FC-AA Trowel     Ecliptic  Ecliptic tend to have ships named after melee weapons I've noticed, and that matches their \"shoot first collect credits later\" mentality and coinsides with their brutality, so I like to continue that theme. They all prefix with \"Ecliptic\", but I don't like that so it's up to you!  Examples:  Capital Ships   Warhammer   Greataxe   Frigates   Scimitar   Falchion   Fighters   Kerambit   Billy Club   Crimson Fleet The Crimson Fleet ships you see in game are named after ethereal undead it seems, which aligns with the fearmongering they go for so I stick with that too. I like to extend it beyond that to other undead and fear inducing mythological creatures. Similar to Ecliptic they've prefixed \"Crimson Fleet\" but I dislike that so I like to omit it.  Examples:  Capital Ships   Lich King   Poltergeist   Cerberus   Frigates   Ghast   Chimera   Draugr   Fighters   Wisp   Chupacabra   Ghoul     Va'Ruun Ships  The Va'ruun seem to name their ships after religious doctorine, rituals, terminology etc. Words that mean sadness, or hostility I find fits in with their theme as well. Someone else suggested using the scientific names of snakes and other reptiles which I think aligns as well! All these things are easily googlable. Again they're generally prefixed Va'ruun,  I think it's more acceptable here for some reason, so I will be including it, but again, omit where you feel it unnecessary.  Examples:  Capital Ships   Va'Ruun Exorcism   Va'Ruun Covenant   Va'Ruun Anomochilus   Frigates   Va'Ruun Krait   Va'Ruun Lement   Va'Ruun Emnity   Fighters   Va'Ruun Rite   Va'Ruun Boiga   Va'Ruun Sin     Independent ships  For a more independent ship names, I like to consider something a character might find sentimental, or a place that might be important to them, and then name the ship after that. If you consider someone who's SO passed away they might name their ship after them, or a possession that means a lot to them, where they used to hang out as a child, or a concept that has a lot of emotional weight for them. Examples:   The Well's Revenge   The Northern Lights   Juliette's Locket   Decaprio III   Father's Rifle   It can additionally be helpful to consider a key feature of the ship, and focus on that.   Do you have two long arms either side with a gap in the middle? Consider something with the number 2, Duel, Bi-, Twin, etc.   Is it sleek looking? Gonsider naming it after a model of car that similarly sleek.   Does it have a purpose as a ship? Like hauling specific cargo, or building space stations? Name it something obvious like \"[material] Hauler\" or \"Construction Drone\".   I hope this at least helps people getting some bein juices flowing, and hopefully cuts down on the name suggestion posts. For those that are good at naming ships, drop your conventions below! Let's make this as supportive as possible! Edit: formatting and some updates based on suggestions    "], ["Day 4 Struggling with food", "12", "4", "2024-05-28T07:49:43.864000+0000", "https://www.reddit.com/r/HPylori/comments/1d2e0rk/day_4_struggling_with_food/", "Hey everyone im having trouble figuring out what to eat and feeling very weak and pretty much suicidal atm its driving me insane and i can't stop cravng lays baked potato chips for some reason and is that safe to eat? I never been big on food im usually a simple dude and microwave food or just eat anything cold then call it a day but now i have to put thought into it and im stumped. I'm lactose Intolerant just wanna throw that out there but what i eat isâ\u0080¦ BREAKFAST -Toast with diced up avocado and egg whites that i spread on toast with water. NOON - Rice cakes,blueberries, and sometimes i sip 100% concentrated cranberry juice (yuck) then switch to water. AFTERNOON - I eat the same food from breakfast w/ water EVENING - steamed broccoli,chicken, and califlower w/ water My anxiety and depression is really bad to the point i was crying my eyes out which never happens to me i almost want to give up and die sometimes but my main issue is finding food to eat and feel satisfied i did like the previous food i listed but now it don't taste good since i have this metallic taste in my tongue for some reason. Having a lot of brain fog so sorry if its hard to read  but i wish i can have something with flavor i can definitely go for a piece of bread with bologna right now. ð\u009f¥²    "], ["Help needed with watermelon juice", "14", "1", "2024-04-22T20:55:34.172000+0000", "https://www.reddit.com/r/cocktails/comments/1caloo2/help_needed_with_watermelon_juice/", "Has anyone ever worked with fresh watermelon juice? Currently I blitz it then strain it. After a while, whether by it's self in a bottle or made into a drink it separates in to clear 'juice' and 'pigment'. Anyone have any ideas how to best stableize this? Or is it best to just clarify it entirely?    "], ["solar for fridge - help needed", "18", "5", "2024-02-21T15:27:22.500000+0000", "https://www.reddit.com/r/SolarDIY/comments/1awerxa/solar_for_fridge_help_needed/", "I have a houseboat on a mooring. Last year, I installed : 3 x 100 ah batteries and a 600 watt panel system ( 3 panels) and a 1500 w 12 v inverter. all to run an apartment size 120 volt AC fridge. On several occasions - cloudy / rainy days, the batteries would drain and could not support the fridge. I have been advised that inverters suck a lot of juice, but i don't know how to calculate that. I was also advised that i could buy a smaller 12 volt DC fridge that would draw less juice and eliminate need for the inverter. this a not a strong category for me - could anyone advise if the 12v fridge is the right direction. If i spend another $800 for the fridge, i'd love for it to stay running through periods of poor solar production.   thanks in advance for any help ; fire away.      "], ["Help needed uk preferably ", "5", "1", "2024-05-29T06:44:29.939000+0000", "https://www.reddit.com/r/Advice/comments/1d35rsy/help_needed_uk_preferably/", "so I have a dream to own my own nigtclub/bar. I want it to be juice wrld themed need help setting it all up. I have ideas and a potential property just need the funds help is appreciated    "], ["Mai Tai help needed", "34", "3", "2023-12-14T21:16:57.744000+0000", "https://www.reddit.com/r/Tiki/comments/18iixoi/mai_tai_help_needed/", "I need help with my Mai Tai. It wasn't very good but I'm not sure what went wrong. Any opinions on how I can try again without buying additional supplies? I also have a bottle of BG Reynold's Rich Demerara available.  (Disclaimer: I know it's not a traditional Mai Tai.)  The recipe I used was: Denizen Merchant's Reserve: 2 oz Liquid Alchemist Orgeat: .75 oz DeKuyper Orange Curacao: .5 oz Simple Syrup: .25 oz Lime Juice: 1 whole lime I shook it with crushed ice.    "], ["Help Needed ", "1", "0", "2024-05-19T10:52:51.205000+0000", "https://www.reddit.com/r/foodhacks/comments/1cvlkw3/help_needed/", "I made watermelon sorbet today. I put in a simple sugar syrup and lemon juice along with frozen watermelon cubes. The sorbet tasted quite good but there is a bitter aftertaste.I'm afraid I forgot to remove lemon seeds or some watermelon seeds got blended in there. What do I do now?    "], ["Substitute help needed", "4", "1", "2024-03-22T12:08:32.807000+0000", "https://www.reddit.com/r/Baking/comments/1bkxoyz/substitute_help_needed/", "My sister is on a special diet and I would like to make her one of the angel food cakes that uses just the dry mix and a 20oz can of crushed pineapple but replace the pineapple with strawberries.  Any suggestions on how to do this to get the right fruit/juice ratio?  Thanks    "], ["Looking for a hood movie I watched as a kid!!! Help needed!!", "31", "7", "2024-03-21T17:09:33.447000+0000", "https://www.reddit.com/r/hiphop101/comments/1bkbo3y/looking_for_a_hood_movie_i_watched_as_a_kid_help/", "I have been hunting for a more dark and serious hood movie, it's not at all like the ones that give a comedy take like sipping juice. The main part that I remember is the ending where the main character gets shot in a shoot out with a guy and he's left laying bleeding in the road staring up into the sky. It may or may not be raining and I'm pretty sure he was wearing a white beater. But other than that all I remember it was definitely more dark that like menace II society and friday. Edit: movie does have topic about gang and drugs I am pretty sure    "], ["Help needed in finding mass pleasing perfume with good presentation", "33", "6", "2024-01-15T04:30:02.739000+0000", "https://www.reddit.com/r/desifemfrag/comments/196zxdx/help_needed_in_finding_mass_pleasing_perfume_with/", "I have not one clue about what makes up a mass pleasing, blind buy kind of perfume for women and need some recommendations. I need the presentation to be spot on since it's going to be a gift. Personally, I was looking into Skinn Nude since I've heard it's really good and the bottle looks kinda nice too. Budget would be 2k. Willing to stretch it to 3k max. Thanks in Advance! P.S- Would be a bonus if it was a well known brand, rather than say an ME brand since the person in question is someone who loves owning branded stuff. But feel free to recommend ME ones too, if the quality of the juice is worth looking past the brand name. Edit: Person in question lives in a very hot and humid region. Literally no winters ever except for the ocassional heavy rains.    "], ["Cabbage Juice: Need Help", "2", "3", "2024-04-25T16:06:33.050000+0000", "https://www.reddit.com/r/Gastritis/comments/1ccvt2g/cabbage_juice_need_help/", "Hi guys, I have been drinking several glasses of cabbage juice, mostly red, for about two weeks now. All in all, it is helping. I don't have acid reflux and bloating isn't as bad as it used to be. However, I still have sensations in my stomach - front rib and back. Therefore, I have questions for all the people who healed themselves with cabbage juice. How long did it take you? Did the discomfort after drinking cabbage juice eventually go away? How much and how often did you drink it? Any other thing you would have done differently? Thank you)    "], ["anyone need help finding juice wrld songs", "8", "3", "2024-05-28T16:37:58.294000+0000", "https://www.reddit.com/r/JuiceWRLD/comments/1d2nvpu/anyone_need_help_finding_juice_wrld_songs/", "i got alot of juice wrld songs if anyone needs the wav/mp3    "], ["Need help with license documentation for a juice company", "3", "2", "2024-06-07T20:58:17.600000+0000", "https://www.reddit.com/r/CharteredAccountants/comments/1dalmql/need_help_with_license_documentation_for_a_juice/", "Hi! I am looking to start a juice shop which works primarily as a cloud kitchen capitalizing quick commerce channel. I did some market research, finalised the target group, area and equipment. While looking at the license registration, it's too much info on the internet, many maintained in unstructured fashion. I'm really confused, what licenses really required to me, and where to apply. I am the only person who will be actively investing into this, so I believe my business should be registered under sole proprietorship. I also see GST is mandatory in some sites, and few mention revenue under 10L businesses not require GST reg. Is it business name or brand name, we need to apply for TM, am I really eligible? To apply for FSSAI license, what all are required to apply. And fssai is specific to a brand or a store ? Please help me clearing the chaos what all licenses really matters, the order of applying and where to apply. Also, If I want to extend by opening a offline outlet, does that require any additional licenses?    "], ["Juice Fluid Simulation in Houdini - NEED HELP", "3", "0", "2024-05-15T13:44:01.500000+0000", "https://www.reddit.com/r/Houdini/comments/1csl5t2/juice_fluid_simulation_in_houdini_need_help/", "Hello there, I am student learning 3D, I have experience in Maya and Unreal engine. I was sent this reference to make something similar, MESH  turning into a fluid Simulation, and back; like in this Advertisment. Can anyone help me with the telling me in a few steps and methods to do this in houdini  https://www.youtube.com/watch?v=yuTSVom_pBY  the breakdown  https://www.youtube.com/watch?v=yuTSVom_pBY     "], ["Need help with juice wrld song", "2", "0", "2024-03-26T05:03:28.401000+0000", "https://www.reddit.com/r/JuiceWRLD/comments/1bnzpib/need_help_with_juice_wrld_song/", "The lyrics are like â\u0080\u009cpop that perc, fuck that bitchâ\u0080\u009d    "], ["I need help I need someone to talk to about juice", "5", "5", "2024-05-20T17:01:31.508000+0000", "https://www.reddit.com/r/JuiceWRLD/comments/1cwkiim/i_need_help_i_need_someone_to_talk_to_about_juice/", "I have a mental problem with juices death iv been going through a lot and I am so attached to him like I never met him but his music literally saved my life ig I just need ppl to talk about juice with bc nun of my friends really like him help?    "], ["Need help with a bar solution for juice well ", "3", "5", "2024-04-10T16:48:17.769000+0000", "https://www.reddit.com/r/bartenders/comments/1c0q989/need_help_with_a_bar_solution_for_juice_well/", "The bar i work at is very small. I've made it work so far, except the only issue is that i literally have no where to keep my simple syrups and juices all day that will keep the ice insulated (hate when they get warm) and no there isn't any room for another wellâ\u0080¦ but i have been looking online, unfortunately still no luck. Has anyone heard of anything like this?    "], ["I need help finding a deleted juice mashup ", "1", "1", "2024-04-07T03:05:24.635000+0000", "https://www.reddit.com/r/JuiceWRLD/comments/1bxu00c/i_need_help_finding_a_deleted_juice_mashup/", "I used to listen to this fake album a lot back in summer 2021 it was called â\u0080\u009cOUTSIDERSâ\u0080\u009d on yt and it had a lot of unreleased bangers . All i want is the songs list. Any help will be appreciated !    "], ["Need help formulating some wake up juice", "5", "3", "2024-01-18T13:19:43.704000+0000", "https://www.reddit.com/r/Trichocereus/comments/199pz74/need_help_formulating_some_wake_up_juice/", "So, I'm in the process of gearing up for spring. Besides up potting some plants, I want to give them a good dose of ferts to kick off my plants. Right now, I have a bottle of Neptune's Harvest fertilizer with the seaweed extract in it. I also have a little bit of food grade urea I'm thinking about adding to the mix. What else should I add to get my babies kicked off for this years growing season? They're roughly in a mix of 50/50 FF OF and perlite. I have 20 qts of pumice coming to use instead of perlite. Tired of the perlite floating to the top.    "], ["Lectric vs Juiced (Need Help)", "14", "3", "2023-07-02T17:47:38.493000+0000", "https://www.reddit.com/r/ebikes/comments/14oue4t/lectric_vs_juiced_need_help/", "Currently trying to decide between getting one of the entry level Lectric bikes as they are on the cheaper end and seem well regarded by those in this community and people I know irl, however the Juiced Hyperscorpion seems like a very good performance option with high speed/safety features for about twice the price, still around 2k. I would be using either for both doordash delivery and getting to classes, nothing super long distance just within a 5-7 mile radius. I can afford the Lectric right now, the Hyperscorpion would have to save some more. Thoughts?    "], ["Heavy released juice fan, need help", "4", "1", "2023-10-29T21:17:36.343000+0000", "https://www.reddit.com/r/JuiceWRLD/comments/17jcw8k/heavy_released_juice_fan_need_help/", "What unreleased songs should I check out from juice and where do I listen to them at. Hope this ain't against the rules. If you have any links to give me, feel free to message me.    "], ["Help for Mohg lord of juice PC", "3", "1", "2024-02-10T03:16:35.467000+0000", "https://www.reddit.com/r/BeyondTheFog/comments/1an6law/help_for_mohg_lord_of_juice_pc/", "Hello I'm at dynasty mausoleum midpoint grace please come help :)) code: banana    "], ["Need help for planning this out", "7", "4", "2024-02-02T19:58:48.622000+0000", "https://www.reddit.com/r/prisonhooch/comments/1ahco4r/need_help_for_planning_this_out/", "Hi, this weekend I'm planning on starting a 20L batch in one of my carboys. I was thinking of doing one part water, one part 100% grape juice (10L water 10L grape juice) I'll be using EC-1118 yeast and I'm aiming for 15% or higher maybe? Now, I'm not sure about how much sugar I need. I heard of the 17g per % rule tho, so that would give me 5.1kg to 6.12kg sugar. Thing is, the grape juice has sugar (100g/L) so for 10L that would be 1kg but I don't know if I'm supposed to include it in the sugar amount I need. I also don't know if I need to step feed the sugar or notâ\u0080¦ I'm struggling out here    "], ["help for booking as a silver member", "11", "0", "2024-06-03T16:28:11.414000+0000", "https://www.reddit.com/r/delta/comments/1d78npz/help_for_booking_as_a_silver_member/", "I am planning on flying LGA to CLT in 3 weeks, friday night,  direct flight just over 2 hrs.   usually i book C+ for the leg room....Do i have enough juice as a silver member to be bumped up to C+ if i book BE or MC?  thx    "], ["I need your help for a garnish", "19", "4", "2024-05-03T03:24:47.417000+0000", "https://www.reddit.com/r/bartenders/comments/1ciyso3/i_need_your_help_for_a_garnish/", "I've got got a drink for an upcoming menu but struggling with a garnish for it. I'll put the specs below, but I'm looking to use rice as a garnish. For reference, I work at a Japanese bar in Australia. Any help or ideas will be greatly appreciated 50ml Oolong infused Vodka 15ml Lemon Juice 15ml Triple Sec 10ml Amontillado Sherry 1 dash Orange Bitters 5ml Sugar Wet Shake with raw sushi rice Served up    "], ["Help for blueberry cider", "6", "7", "2023-07-23T06:43:26.030000+0000", "https://www.reddit.com/r/cider/comments/1577cpb/help_for_blueberry_cider/", "I want to brew a blueberry cider using blueberry juice. I'm being a bit confused. I understand that in F1, the blueberry flavour is being fermented away. Everyone says to add the blueberry juice in F2 instead. Wouldn't this restart the yeast and ferment dry again? How does that preserves the flavour? I found a brand of blueberry juice that is pure. It's not cheap, so I'd rather not f it up. My plan is to ferment 9L of apple juice in F1 and 4L of blueberry juice in F2. Does that sound like a good proportion? How should I change this? Is it reasonable to increase ABV or would I affect the flavour?    "], ["Need help for a friend", "2", "10", "2024-02-04T15:01:37.482000+0000", "https://www.reddit.com/r/EatingDisorders/comments/1aips21/need_help_for_a_friend/", "My friend has a GF who has eating disorder, and she doesn't want to eat anything, it's been two days since she hasn't eaten anything, just drinks water and other liquids (juice etc) For now, its difficult to convince her to eat due to the psychological crisis. What can we do to try to reduce the damages? While we're trying to convince her to eat solid food.    "], ["Aftermarket audio help for 2024 rx350h premium", "12", "3", "2024-04-12T07:22:03.887000+0000", "https://www.reddit.com/r/Lexus/comments/1c22zzm/aftermarket_audio_help_for_2024_rx350h_premium/", "Looking for some insight as i might have bit off more than i can chew. Base system on a '24 premium and hooked up a JL108LGw3v3, audio control lc5i pro, and jbl a5055 amp. Listening through android auto and it seems like my volume has to be turned up a lot higher now than when i had all stock. Im not in the 30s (max volume is 60) for decent volume when before, i was in the 15 to 20. The bass hits hard when tuning into hiphop or reggaeton but falls very short on rock genre. Sometimes the music feels flat and sounds like the vocals are very low compared to rhe bass. Even when the sub knob is turned all the way down, you still feel the bass and the flat vocals. Speakers are still stock but should be able to still handle extra juice. Just not sure if the shop didnt properly tune it. Any initial thoughts on what to check?    "], ["Help for a drink", "7", "1", "2023-09-21T11:28:28.335000+0000", "https://www.reddit.com/r/Cooking/comments/16oddee/help_for_a_drink/", "I made a drink with red grape juice, vodka, and very  fizzy water, but I'd want it to be slightly creamy, is there a way I can make it more creamy/thick without chasing the flavor?    "], ["Does Juicing Help with Pooping", "5", "3", "2024-05-23T15:18:15.560000+0000", "https://www.reddit.com/r/Juicing/comments/1cyvbae/does_juicing_help_with_pooping/", "I've been doing ginger shots on an empty stomach and been also doing veggie juices for breakfast and I noticed I've been going to the bathroom more often. Anyone knows the benefits or effects of juicing overall. To clarify im not doing a cleanse, still eating regularly.    "], ["Need some help with large batches of super juice.", "1", "1", "2024-06-08T09:19:04.943000+0000", "https://www.reddit.com/r/bartenders/comments/1daywui/need_some_help_with_large_batches_of_super_juice/", "Bar manager looking to make some improvements at work and have been trying to replace our off tasting pasteurized jugs of lime and lemon juice, but dont want to deal with and/or get murdered for making my bartenders do fresh squeezed juice. Ran into super juice recipes and it seemed to be a perfect fix. My first small batch came out great. We did a blind taste testing and had 10 of 12 people pick the super juice daiquiri  over the jug stuff one.  Looked to be a better tasting product at a lower cost without  increasing the prep workload to much. Enter the first large batch of juice. About 5 liters that was just flat.  It had been used in some of our batched cocktails and they needed to be doctored with fresh squeezed lime juice. The citrus punch was just lacking, and its what made the initial batch the winner. Someone described the margarita batch as tasting like tequila and minute maid lime aid. Ive been using the Kevin Kos recipe, peeling with a vegetable peeler and adding the peels and acid into a cambro and shaking with the lid on to combine then muddling. Stir it with a bar spoon a few times  over the hour it sits.  Starting peel weight has been between 400-500 grams. Has anyone run into a problem like this making larger batches?    "], ["Does Pineapple Cucumber Lemon Ginger Juice Help with Weight Loss?", "6", "36", "2024-04-04T07:00:08.789000+0000", "https://www.reddit.com/r/weightlossdiets/comments/1bvgqdh/does_pineapple_cucumber_lemon_ginger_juice_help/", "A lot of people have been telling me that this pineapple cucumber lemon ginger juice can help them lose weight. If anyone here has already tried it, I'd like to know what they thought of it. Does it work? If you have used this juice to lose weight before, please let me know what you thought and how it worked for you. Thank you!    "], ["Help with Apple Juice Hooch", "6", "3", "2023-10-23T23:42:18.867000+0000", "https://www.reddit.com/r/prisonhooch/comments/17eyqe4/help_with_apple_juice_hooch/", "Title is as it sounds. I am looking to make an alcoholic beverage but really only have access to apple juice, yeast, and sugar. How might one make this? First time ever home brewing. Thank you!    "], ["Why does orange juice help with sore throat?", "4", "1", "2024-01-26T01:22:46.797000+0000", "https://www.reddit.com/r/NoStupidQuestions/comments/1ab63cp/why_does_orange_juice_help_with_sore_throat/", "So for context I have the flu and strep and people tell me constantly not to drink or eat anything with citric acid like orange juice? But when I drink stuff like that it makes it feel better instead of worse.    "], ["Help with juicing - what am I doing wrong?", "9", "0", "2023-12-28T20:54:38.334000+0000", "https://www.reddit.com/r/pathofexile/comments/18t49gu/help_with_juicing_what_am_i_doing_wrong/", "After seeing all these hype juice about divine drop posts I converted my boneshatter delve char to crouching tuna's Fulcrum MF build and spent around 45 div to create this build. The staff alone is 30 DIV, lol the madness. I don't want 50 div in one map. I want at least 1 or 2 div or decent div cards in 5 maps. I am getting a lot of bubble gum currency but no big drops. I get 1 div in 10 to 20 maps. How many maps i have to run to get big loot drops. If i go delve (350 to 400 depth) with 46000  sulfites, i get a minimum of 150 to 200c worth of fossils and resonators, this is just the bare minimum i get in delve. MF GEAR:   Item Quant (55) and Rarity (143) in Gear (i am using bisco, so if i have rampage it goes more)   My juicing strategy: SCRABS:   Polished Divination   Polished Reliquery   Guilded Harbinger   Guilded Abyss   SEXTANTS:   Magic pack size   Hunted traitors   Divination or gloom shrine   Abyss   MAP: (Min 150 to 200 quant corrupted, but not always 8 mods, it is hard for me to bring all the maps to 8 mods)   Cemetery or Burial Chambers   MY ATLAS TREE:   Wandering Path with the abyss, beyond, deli with the blue altar (30% quant and rarity)   WISPS: I get a minimum of 2 colors to 2k, sometimes all 3 colors to 2k. I am not getting the blue ones always so its either blue and purple or purple and yellow. Question:   Do i have to use guilded scrabs always or polished is ok?   Quantity - i usually run maps with 90 to 100 or 120 max, is this enough or do i have to run always more than 100 quant with 8 mods   How to get more loot, what am i doing wrong?   Do i have to increase my quant and rarity in gear?   Do i have to increase my map mods or sextants?   My friend is running Aurabot, does he have to add anything to his gear?      "]]