[["The problem with modern media is that nothing can stay completed.", "253", "991", "2023-09-20T16:37:05.546000+0000", "https://www.reddit.com/r/CharacterRant/comments/16npve6/the_problem_with_modern_media_is_that_nothing_can/", "Remember the Kung Fu Panda trilogy? Well next year we have a Kung Fu Panda 4. The Arc was perfectly finished in a trilogy - but they have just to milk it. Same with Dragonball - same with Star Wars/Palpatine. Same with the Simpsons that got medicore like 10 Seasons Ago. Or Family Guy or South Park. Nowadays nothing is allowed to remaind completed - to be just done with. If it was popular - if it made money - it will be going on forerver. Or it will be ressurected because of Nostalgia. This makes self enclosed stories impossible. Because there always has to be a continuation 10 or 20 years later that will destroy the original by adding new stuff that contradicts the original. Or they make a remake or reebot like Velma that takes a dump on the original. Or they just keep going past their primes until the show just becomes unrecognizable. You just cant continue something forever or reebot it after it has been finished. In the process it will lose its flavour, it will lose the things that made it good and special in the first place. But modern media just doesnt care. As long as it makes money - keep it going. Ressurect it after decades. As long as it makes money - who cares? There will always be some fans that will swallow everything - no matter how bad it is - as long as they get more... Note: Its something different if Shows like Samurai Jack or Final Space or Invader Zim get revived/continued because these were canceled before the main plannes story could finish.    "], ["Problem with NestDrop's Spout Sender while loading presets with MilkDrop 1 effects, such as invert or solarize.", "11", "1", "2024-02-29T18:56:26.877000+0000", "https://www.reddit.com/r/NestDrop/comments/1b384bi/problem_with_nestdrops_spout_sender_while_loading/", "I'd like to clarify that I loaded the preset that uses only solarize, but it affected the NestDrop's Spout Sender. Same happens with invert too and both invert and solarize effects enabled didn't affect it, this time. Plus, when doing a soft cut transition, the old presets started to stay black, then the new preset blends, getting back to normal. Also tried with the ARGB version of BeatDrop (was XRGB) and same happened as NestDrop. I am using the latest version of Spout ( 2.007.013 ). Any way to fix this issue? If not, Can you make the NestDrop's Spout Sprite supportable for XRGB receivers? Here are some screencaps that it affected the sender:      NestDrop using preset \"PieturP - beats_at_dreamtime\" that affected the Sender with the solarize effect enabled       NestDrop using preset \"Geiss - Inverted 2\" that affected the Sender with the invert effect enabled.       NestDrop using preset \"yin - 294 - Sonic brainstorm (inner state - UHF mix)\" that didn't affect the Sender with both invert and solarize effect enabled.  Here's the Lynn Jarvis's response of GitHub when I asked for a fix: https://github.com/OfficialIncubo/BeatDrop-Music-Visualizer/issues/3#issuecomment-1970099188     "], ["The problem with this game.", "5", "13", "2024-02-12T02:14:03.800000+0000", "https://www.reddit.com/r/sssnaker/comments/1aop1s5/the_problem_with_this_game/", "Each update is worst.  And now is extremely milking.   SS snake broken and p2w   Arena P2w , may gad.. now another way like minner adventure... and a battle pass premium for use the lucky slot XD.   Other world is a joke like Arena.   spend alot of gems for upgrade ur gear.   useless S Snake ... u cant do anything else because u made this game impossible with the damage. Pay or do nothing.   milking and milking   artifacts... is a joke p2w.   be nice and milking us for each loggin ty.   So expensive... is a phone game, not a AAA WTH with that prices. ANYWAY enjoy this casino... so funny.    "], ["Am I the only one who has a problem with Dahbdude? ", "41", "57", "2024-02-18T07:50:35.932000+0000", "https://www.reddit.com/r/supermariologan_/comments/1atotux/am_i_the_only_one_who_has_a_problem_with_dahbdude/", "I mean this guy has stated multiple times that he's done with sml, he hates it, and won't be doing more reactions, but then sees that he only gets views from making Sml criticism and continues? I don't necessarily enjoy his content neither hate it, but he's just milking sml at this point.    "], ["What is the problem with this world", "10", "8", "2024-05-27T18:41:53.815000+0000", "https://www.reddit.com/r/MSPI/comments/1d1ynj3/what_is_the_problem_with_this_world/", "We are countinuing to read different information about when does milk proteins leave breastmilk. I just do not get it, is it that difficult for science to make some laboratory tests about this?    "], ["Strange problem with breastfeeding. Any advice would be great", "5", "4", "2024-02-12T03:47:10.216000+0000", "https://www.reddit.com/r/BabyBumps/comments/1aoqoye/strange_problem_with_breastfeeding_any_advice/", "I'm pregnant with my second and would like to attempt breastfeeding again but afraid I will fail again. I had my first child several years ago and during the pregnancy my breasts grew a little but not much. I had an unforeseen c-section and both my baby and I were safe and healthy. The last day at the hospital (day 3) my milk came in. All the nurses and pediatrician saw my breasts and told me milk has come in and that I had to keep trying breastfeeding and massaging for the milk to flow. I was discharged that day. Here is where I went through the most stressful part of my life. I tried to exclusively breastfeed but my baby wasn't getting enough milk and was losing weight too fast. After several days the pediatrician strongly recommended she get formula and we gave in (at the end of the day no regrets bc the most important thing is that she's fed and healthy). I decided to exclusively pump at that point and talked to other friends for tips, saw 2 different lactation consultants (they checked my posture when breastfeeding and also confirmed I was using the correct flange size and using the machine correctly /Spectra). For the next 4 months I ate sooo much oatmeal, tried sunflower lecithin, drank lots of water, and pumped 7-8 times every single day! All for producing maybe at most 2-3 oz total. This was total milk produced in a single day!?! From both breasts. I still can't believe I put up with so much for 4 months for so little. When I asked my obgyn later he said he didn't have an answer and that our bodies are all different. This has been my biggest mystery and I want to be successful this time around with my second baby. Did anyone else experience this and do you have any tips? *During these 4 months my breasts still got hard with milk, had to wear bra pads due to leaking, and at times needed warm massages due to blockage (never mastitis though). But why did the milk never flow out!?!?!?!    "], ["My mom has a condition called IBS. she has a big problem with food", "3", "2", "2024-06-07T00:18:30.772000+0000", "https://www.reddit.com/r/IBSHelp/comments/1d9xgly/my_mom_has_a_condition_called_ibs_she_has_a_big/", "She's having a really hard time trying to find safe foods. She can't eat milk whatsoever and she's thinking that eggs are a problem for her stomach as well. I was just wondering if there was anybody who has the same condition and what food they eat. Also, she is having a hard time conveying to the staff of any restaurant that she can't have milk or eggs.    "], ["Problem with letdown? Baby frustrated at the breast", "0", "1", "2024-01-11T04:33:28.027000+0000", "https://www.reddit.com/r/breastfeeding/comments/193t1gp/problem_with_letdown_baby_frustrated_at_the_breast/", "So, I am combo feeding..not by choice, but let me explain. My baby boy has always had a big appetite from the startâ\u0080¦but my milk supply has increased really slowly. Basically, I think I had colostrum for 2 weeks PPâ\u0080¦so he was not getting satiated at the breast. The reason I know that is because he'll keep crying and put his hands in his mouth and won't settle (even though I tried putting him at the breast as much as I could) We are working towards EBF - hopefully. Now at 6 weeks PP, I have at least SOME milk supply to be confident enough to slowly wean off formula. He already eats less formula now and I finally had some meals where he seemed satisfied from BF. But, the majority of meals, he still isn't satisfied. What would happenâ\u0080¦He'll suckle and suckle (depends how much stash I have) and then get frustrated and start crying, then screaming, then refuse to take the breast because milk won't come out anymoreâ\u0080¦I don't have this problem always - when milk comes out fine form the breast, he likes to BF. I'm beginning to suspect a problem with my letdownâ\u0080¦is it possible that there's too much break between letdowns? I also power pumped and  got 50 ml (almost 2 oz with power pumping?) and most of the milk came out the first 10 minutes of power pumpingâ\u0080¦then bery little. So, here I am with 40 minutes of pumping and with only first 10 minutes being more productive? Can this also be the case with BF the baby - that most of my milk comes out first minutes, then barely any? Sometimes if he's willing to suckle, another letdown will come later and he'll actively suckle again, but after a while. This night I kept BF him - cluster feeding - up untill one point where he started screaming because there is no more milk and I gave him formula.    "], ["Problem with making cheese", "6", "1", "2024-03-20T19:56:51.734000+0000", "https://www.reddit.com/r/StardewValley/comments/1bjmpgj/problem_with_making_cheese/", "Every since the new update, I can't seem to put my milk in the casts. Is this happening to anyone else? I play on ps4 controller and normally the button is square, but when I'm near the casts amd click it, nothing happens. I am so confused rn.    "], ["I think I have a problem with high altitude", "7", "3", "2024-01-29T03:16:01.953000+0000", "https://www.reddit.com/r/icecreamery/comments/1adl6y1/i_think_i_have_a_problem_with_high_altitude/", "I have a Cuisinart ICE-100 that I bought last month.  Tonight was my fourth batch.  The first two batches were great: I just went with the basic vanilla ice cream, but substituted Jack Daniel's Vanilla Egg Nog for the whole milk, and they were amazing!  Third batch I made a blueberry gelato, also based on the Cuisinart recipe.  Tonight I went for the Peanut Butter recipe.  Again, their recipe.  Pretty basic:   1 cup peanut butter   2/3 cup granulated sugar   pinch salt   1 cup whole milk   2 cups heavy cream   1 tsp vanilla   I added about an ounce and a half ground semi-sweet chocolate.  Everything mixed nicely and I refrigerated it for about 14 hours, then took a whisk to it before putting it in the machine. The recipe calls for a 40-50 minute churn.  At about 25 minutes, it was already pretty solid and the dasher was just spinning the mix, it was no longer moving through it.  I ended up pulling it and putting it into a container and into the freezer. What I'm wondering is if I should add more milk or cream to the mix.  When I say altitude, I mean ALTITUDE.  Forget Denver, I'm at 9,000'.  My house is at about 70 degrees, it's not like I was making it outside where it was in the mid 40s this afternoon. Any suggestions would be most welcome.  Thanks!    "], ["LPT: If you have problems with people stealing your food at work, double bag your lunch box, and double knot each of the bags", "707", "4976", "2024-02-28T01:59:05.546000+0000", "https://www.reddit.com/r/LifeProTips/comments/1b1tzkt/lpt_if_you_have_problems_with_people_stealing/", "People used to steal my milk regularly and it got the point that some idiot finished my whole supply before I even had a chance to use it myself. So I started wrapping my milk in two plastic bags, and double knotted each of the plastic bags. The theft stopped immediately thereafter.    "], ["Walmart and their recent problems with the milk.", "27", "0", "2024-01-31T23:46:35.549000+0000", "https://www.reddit.com/r/walmart/comments/1afwkze/walmart_and_their_recent_problems_with_the_milk/", "Wife and I are in VA and we live well out in the country.  We have Walmart 20 minutes from us then a Food Lion a little further away.  That's it for our options.  I like many of the folks at our Walmart as they like me coming in as I'm an outgoing and friendly retiree who jokes around with them. Although some never want to interact.  The last 3 bottles of their 2% milk have gone sour on us anywhere from 2-5 days before the sell date.  I've felt in the fridge and it seems plenty cold so the issue is somewhere else I presume.  We've had milk we've used days past the sell date with no issues as I'm sure most have.  I finally took the 3rd one in to Customer Service as I was tired of buying milk due to a Walmart issue.  The girl working CS told me her milk also went bad early and she'll only buy at Food Lion now.  Anyone know what is happening and why all of the sudden we're seeing this issue with the milk?  I did ask the girl to please tell the manager but not sure what this may accomplish.    "], ["Problems with unique buildings oil refinery and milking house", "2", "6", "2023-10-29T01:14:01.587000+0000", "https://www.reddit.com/r/CitiesSkylines/comments/17irzzt/problems_with_unique_buildings_oil_refinery_and/", "Not sure if a bug or something I'm doing wrong.  For example when I place the oil refinery or the milking house, they sit empty.  No business opens in them.  Some others I've placed like the chemical plant had businesses open.    "], ["Anyone who's lactose intolerant have problems with AGT, or titty milk?", "5", "1", "2023-09-22T17:36:09.859000+0000", "https://www.reddit.com/r/gamersupps/comments/16pgcld/anyone_whos_lactose_intolerant_have_problems_with/", "Looking to purchase one of these tubs when i get the new waifu today, just want to know if anyone whose lactose has problems with these 2 specific ones as they advertise a \"cream/dairy\" feature in the supp. I know titty milk states theres no diary so im on the edge of ordering that, but what about AGT? Im also considering Grandpas ashes as its also suppose to be a \"cream\" type supp. But no note if it has dairy or not.     "], ["Question / problems with Profitec pro 600", "15", "0", "2024-03-24T14:04:25.026000+0000", "https://www.reddit.com/r/espresso/comments/1bmliv6/question_problems_with_profitec_pro_600/", "I have just bought a Profitec Pro 600 coming from a Delonghi Dedica, even though I tried to tinker with the profitec, i can't pull espresso con crema and the milk frothing is not so good either. I was making better flat whites with the Delonghi. I am pairing the profitec with an Eureka Mignon and I have played with the grinding settings so that I can pull a 17g of coffee in 15seconds in a single stock basket. It doesn't work. No crema forms. I am using the stock single basket with 8 grams of specialty fresh roasted coffee, and the temperature is 92C and 8.5 bars pressure. I don't have flow control on the machine. The coffee puck is soggy after i take out the portafilter. The steam wand is set at 127C degrees and it is almost impossible to get a good consistency, even though I have done it as per many youtube videos. I do get the frothing sound but then the milk becomes quickly hot so I have to stop the frothing. The delonghi was doing better in every aspect. What am I doing wrong?    "], ["Problems with coffee and water ratios", "16", "3", "2024-04-07T02:14:24.002000+0000", "https://www.reddit.com/r/Moccamaster/comments/1bxt035/problems_with_coffee_and_water_ratios/", "Why do I make coffee according to the proportion suggested online, especially strong, and finally according to their own taste, 15g of coffee, add 1 liter of water, so that the coffee is the most comfortable to drink, and will not suddenly heart beat very fast, otherwise, the coffee needs to be added to the milk to taste good! Is this normal?    "], ["Saturation problems with Sneak", "13", "0", "2024-03-25T20:24:00.202000+0000", "https://www.reddit.com/r/SneakEnergy/comments/1bnnxl9/saturation_problems_with_sneak/", "Hello, I have bumped up to trying 700ml of water, and using a milk frother to stir the product better for a couple minutes even... and it still is too powdery especially the buildup at the bottom. It's honestly gross and a turnoff, what am I missing? Seeing all that shit stir in from sitting on the bottom every time I sip is a bad look.    "], ["Problems with dairy fat", "21", "21", "2023-08-22T12:23:10.917000+0000", "https://www.reddit.com/r/SaturatedFat/comments/15y49r6/problems_with_dairy_fat/", "So recently I changed from Butter to Suet (in a mostly ketogenic/carnivore diet), I also added a smidge of Coconut, due to the lauric acid. So I am getting close to Mammoth Fat, which has 2-5% Lauric and a lot of stearic. and to my surprise, I was not tired after eating (Which I always was after Butter/Cream), felt better and ... lost weight (even though I was at 15% bodyfat with visible abs before). I also felt disgusted with butter/Ghe after only small bites, whereas with suet / bone Marrow, I can eat it spoonwise, no issues. The same happened with eating bone marrow: Good satiation, even hours afterwardsThat made me wonder why? I cannot be the MCTs per se (due to coconut, which i took ratios which would result in similar mct profile as in butter, albeit less C8 and C 10 and more C12), or the Oleic, those are roghly the same. It also is unlikely due to milk protein allergy, as I noticed the same with pure Ghee. The Suet is also refined, --> it cannot be oxidized cholesterol in Ghee. Bone Marrow --> It cannot be the MUFAs. -->It must be the palmitic acid, which is richer in Butter than in Suet, and without oleic and stearic to the rescue. Peter from Hyperlipid (and following him Brad) is quite friendly towards it, because it is good from a protons standpoint. u/FrigoCoder is saying that Palmitic Acid is the endresult of de-novo-lipogenesis and therefore does not result in its own oxidation. https://www.reddit.com/r/ScientificNutrition/comments/10loyke/comment/j5zfm22/?utm_source=share&utm_medium=web2x&context=3 Carbs are suppressing CPT1 and therefore Palmitic Acid eaten in Conjunction with Carbs are bad. Which explains why in most nutritional Science Palmitic Acid is bad, but only in a \"High Fat Diet\" (which is also high in Carbs and probably in PUFA). In that Context, Ceramides rise, because you get lipidoxicity (too much unoxidized fat in blood = diabetes). Except I was not eating Carbs, and was ketogenic for 8 years. He also claims that Palmitic Acid is reliant on oleic for its own oxidation. But Butter has oleic also, the ratio is not even as bad as in palm oil. Difference is, Stearic might be converted to oleic (which would raise the ratio), then that stimulates fat oxidation. So it might be the Ratio of Stearic+Oleic/ Palmitic+Myristic (per Nick Norwitz). https://twitter.com/nicknorwitz/status/1323204356557201408  Another aspect is that only Stearic Stimulates Mitochondrial Fission, Palmitic does not. In that sense Stearic seems to be kind of a signalling molecule, a role irreplaceable by palmitic. Oleic also does this: Dose- and Time-Dependent Effects of Oleate on Mitochondrial Fusion/Fission Proteins and Cell Viability in HepG2 Cells: Comparison with Palmitate Effects - PMC (nih.gov)  One thing might be esterification of palmitic Acid in Butter (might be better in Suet?): Matthew Dalby auf X: â\u0080\u009e@gerdosi @KetoCarnivore Palmitic acid is predominantly esterified in the sn2 position in human milk. But not in cows milk, which is more similar to vegetable oils. Palmitic acid is more in the sn-1 and sn-3 position in cows milk fat. Human milk is rather different to cows milk.â\u0080\u009c / X (twitter.com)  Question: Am I missing something? I quite like cream + Butter, maybe adding some mufas / stearic is necessary for digestion. I started to make my own yoghurt replacement with suet and whey as main ingredients (casein is also a trigger for allergies and overeating for me). I might also have some form of insulin resistance due to a lot of stress and chronically bad sleep. So maybe dairy fat/ palmitic Acid over 23% is only for the superhealthy?    "], ["Beginner problems with transglutaminase and penicillium roqueforti", "11", "3", "2024-01-07T12:02:08.781000+0000", "https://www.reddit.com/r/vegancheesemaking/comments/190qp4j/beginner_problems_with_transglutaminase_and/", "Hi, I have just started making vegan cheeses and nothing seems to be working... I have tried to make this blue cheese and I have tried to curdle cashew milk using transglutaminase. Nothing seems to be working and I don't know what's going on. Are there specific conditions the transglutaminase and penicillium roqueforti need to be used in ?â\u0080¯I had the penicillium roqueforti cheeses in the fridge and maybe it is too cold ? I have tried heating the milk with transglutaminase to around 40Â°C and that's still not working. Thanks for your help !    "], ["Problems with Spectra SG", "1", "1", "2024-05-18T18:41:02.887000+0000", "https://www.reddit.com/r/ExclusivelyPumping/comments/1cv42ta/problems_with_spectra_sg/", "I am a mom of 5 week old twins and using the Spectra Synergy Gold pump with the CaraCups. Every time I pump it's super painful and pinchy but it also seems like that a bigger amount of milk comes out only if I go up to at least 6+ as a setting but more like 8 or 9. If it's under that a couple of ounces come out and it stops flowing. Is that normal? How do I make it less painful? I tried using the normal pump flanges and with different sizes, and 24 mm feels the best but it's still pretty painful. I read that using the massage function might help with the amount of milk but that's soo painful for me, I can't handle it even at 1. I am also technically capable of breastfeeding a little, and it barely hurts and only when they latch (I mostly moved on to pumping because it's too exhausting for me to breastfeed 2 babies and I am alone with them most of the day as my husband works and we have no family where we currently are). I just don't get it. The pump instructions say to use the highest setting I'm comfortable with but then I can't empty myself and it keeps decreasing my supply and I end up pushing through the pain on a higher setting instead. How do I stop this for happening without giving up on pumping?? I appreciate any advice!!    "], ["Issue with milking cows", "5", "3", "2024-03-24T18:08:04.059000+0000", "https://www.reddit.com/r/RLCraft/comments/1bmr5c7/issue_with_milking_cows/", "I'm playing the newest version of RLCraft and I can seem to only milk a cow once and then never again. I waited 10 minutes and even sped up ticks and still can't milk the cows a second time. I tried looking this up but I didn't find much, other than it possibly being caused by the Rustic mod or the Inspirations mod. I couldn't actually hit the â\u0080\u009cconfigureâ\u0080\u009d button in the mods tab in the main menu. I dug around in the mod archives but still can't find anything. Anyone able to help? EDIT: I found the config folder and changed the milking cooldown timer. I'm not sure how to fix it though, as I don't want to completely remove the cooldown.    "], ["Issue with milk consumption", "4", "4", "2024-02-01T09:08:08.902000+0000", "https://www.reddit.com/r/AskDocs/comments/1ag6upz/issue_with_milk_consumption/", "I began to drink milk(500 ml) about 7 months ago for gaining weight( for gym). I mix 500ml milk, 2 tbsp of peanut butter and 2 tbsp of honey in the blender. Then drink this before going to the gym. For 5-6 months I didn't face any major issues. But I would get burps after drinking that shake for a hour or some. I would get watery stools. I thought since I am drinking liquid calories it's only natural to get watery stools. After few months my weight began to stop increasing. So I began to drink another 500ml of milk in the morning. I mixed 1 scoop of protein powder and creatine, 1 tbsp of honey with the morning 500 ml milk. I didn't see any issues in the first week. This time I used to eat 25 g of potato chips packet(lays) daily with the eggs I consume for flavour. Then I would eat the same 25g packet in the morning with the morning milk shake if I miss breakfast. After this I started to feel my stomach feeling uncomfortable from time to time. Then one day right after drinking the evening milkshake I felt so sleepy I went to sleep laying on my stomach. I started to feel a mild pain and discomfort in my stomach. It didn't go away after waking up in 30 mins or sum. The pain continued then I felt I needed to puke. Then I puked. After this whenever I drank the evening shake I would feel discomfort in my stomach but not from the morning shake. Then I stopped drinking milk. But when I ate just peanut butter I felt the same discomfort in my stomach. The discomfort felt like I something needs to come out of my throat and also the need to poop. So I stopped eating peanut butter also. I eat normal food for few weeks. But my appetite went down. After eating some bites of food I would feel full. One day I puked while trying to brush my teeth in the morning. After few weeks I tried drinking boiled milk in small quantity. I felt my throat closing like getting larger inside. And slightly hard to breathe. After some more days I tried boiled milk again the feeling was the same but far less in intensity. Then tried boiled milk after lots of days I didn't really feel any of those issues. So I thought my body healed finally. I tried the same morning milkshake today. I felt the throat and breathing thing again but very small in intensity. Then in the afternoon I got watery stools. What happened between my body and milk? I don't boil the milk I consume in those shakes as they are pasteurised milk packets.    "], ["My issue with Milk Tea in Vietnam...", "19", "0", "2023-12-11T11:25:58.467000+0000", "https://www.reddit.com/r/VietNam/comments/18fsey2/my_issue_with_milk_tea_in_vietnam/", "When you order a Milk Tea with NO ICE or LESS ICE, they literally give you HALF cup only? In other Asian countries when you order NO ICE or LESS ICE, they still give you FULL cup. Why does Vietnam do this? I've experienced this in both Ho Chi Minh and Hanoi Other countries in SEA don't do this. I think only Vietnam does this with their Milk Tea...    "], ["Issue with steaming milk on a smaller pitcher ", "9", "0", "2024-03-24T15:50:29.319000+0000", "https://www.reddit.com/r/espresso/comments/1bmnwxt/issue_with_steaming_milk_on_a_smaller_pitcher/", "Hi - I've recently started learning how to steam milk and latte art. I started out with a 600ml daily art pitcher , nothing special but just a starter pitcher : https://amzn.eu/d/d6wCWwy  I'm starting to steam milk well but I have to waste half the milk as I am only using a Cappucino mug with 190ml capacity - I prefer that size when it comes to milk based coffee drinks. So I bought a new pitcher upon recommendation which is 350ml : https://amzn.eu/d/3P6l6xJ  I tried today and the nose of the pitcher is a lot higher than the bigger one, where I usually fill the milk, and the milk rises to the top way too fast. I tried just filling milk half way and the same happened. Tried filling even less milk and the same happened again â\u0080¦ Any ideas what the issue is? I thought a smaller pitcher would be better for latte art on a flat  white , Capp , cortado etc Cheers    "], ["Issue with Milk Washed Bourbon", "12", "0", "2023-10-27T02:41:54.087000+0000", "https://www.reddit.com/r/cocktails/comments/17hdmgk/issue_with_milk_washed_bourbon/", "Hi cocktail friends! Im in a bit of a pinch and could use some advice - I am doing a milk washed bourbon for a new cocktail. I used oat milk during my testing rounds and it worked perfectly, it curdled really well. Today, I made a big batch of it and followed the same recipe as before but it is not curdling at all. It just looks like milky bourbonâ\u0080¦.any advice? We are supposed to release the new menu tomorrow but we can't until I can finish this milk wash. Thanks all!!    "], ["My Issue with milk jug handles..", "10", "0", "2023-09-20T18:00:36.690000+0000", "https://www.reddit.com/r/unpopularopinion/comments/16nrxzk/my_issue_with_milk_jug_handles/", "Why, on God's green earth, are milk jug handles so poorly made? They're too small, too thin, and hard to grab. There is ample room on the entire jug to fit a nicely sized handle. The perfect handle should be 6 inches long, thick enough to fit your hand with finger grooves to provide a perfect grip. I shouldn't have to use three fingers to carry an 8-pound jug of milk because the handle is too small. I could drop it, and it might explode, causing a giant mess. Please, improve the milk jug handles now!    "], ["Could a lack of milk in the pitcher be my issue with latte art? Poor pitcher angle = no flow control", "3", "1", "2024-05-18T22:31:53.726000+0000", "https://www.reddit.com/r/latteart/comments/1cv95ie/could_a_lack_of_milk_in_the_pitcher_be_my_issue/", "Been trying to self diagnose what's going wrong with my pours, which is essentially struggling to get a slower flow rate. I end up finishing my design in like 5 seconds since the milk all rushes out. I can make some nice stacks and tulips, but ripples are impossible because there is way too much milk, meaning the milk isn't a thin stream. Any slower and the design doesn't expand and it sits. So I watched a load of videos and noticed the angle of the pitcher. I only use just enough milk so as not to waste any (200 ml in a 240 ml cup). This means I need to use a very steep angle to get the milk to reach the end of the pitcher, to the point it's almost horizontal. Especially if I'm trying to get close to the surface. When watching experts, the milk gracefully flows out the top with the pitcher almost facing diagonally upwards, allowing a super fine flow. Is there a way I can do latte art without needing excess milk? Or does the problem lie elsewhere?    "], ["Issue with green explosive poops", "7", "1", "2024-03-29T19:17:00.757000+0000", "https://www.reddit.com/r/breastfeedingsupport/comments/1bqxc2a/issue_with_green_explosive_poops/", "Our baby is 4.5 months old. She is exclusively breast fed either directly or via expressed milk. For the last one week or so she has been having green explosive poops many times a day. We suspected it was diarrhea initially but baby has been active and alert and does not have any fever. Finally after extensive searching , I came across resources around hind milk and foremilk imbalance also known as lactose overdose now. So once we started separating the milk and feeding all of hind milk the poops have reduced now. But the baby is hungry as hind milk alone is not enough. I am looking for options on how to address this. Do I put back some of the foremilk into hind milk and risk her pooping or will eventually the baby get the capacity to digest foremilk as well? Are there any options to increase hind milk supply for the mom. We are totally exhausted and want to pick the brains of this group. Thanks again.    "], ["Issue with only Indian currys", "50", "2", "2024-06-02T19:49:17.154000+0000", "https://www.reddit.com/r/IndianFood/comments/1d6lojm/issue_with_only_indian_currys/", "So, I've tried to understand this on my own but I'm getting nowhere so I'd like to ask: Why does Indian curry run through me but I can eat Thai and Japanese curry, no problem? I don't eat spicy curries, and when I have it's always been thai. I tried making an Indian curry using coconut milk, instead of dairy but the same issue came up. I used to think it was the cumin, but all three types contain it so I'm at a complete loss. Unfortunately, I have difficulty finding the spices used for any spice mixes or pre-made curries, let alone the amounts so I'm not sure. Does anyone have any ideas? Edit: thank you for everyone for helping me and educating me on the issues of the language as well as the food. I have a clearer idea of what the issue may be (the fat) and will start trying some things out so I can eliminate ingredients and hopefully be able to enjoy the wonderful Indian cuisine out there that I've been avoiding.    "], ["An issue with obtaining certain materials for bundles", "9", "0", "2023-09-13T17:33:36.793000+0000", "https://www.reddit.com/r/StardewValley/comments/16htay3/an_issue_with_obtaining_certain_materials_for/", "I was getting 10 cow milk for the home cooks bundle when I realized it would take me a lot longer than 10 days to obtain all 10 cows milk, this is due to the fact that you need 10 of the same quality milk, so if I get 1 normal milk one day I might get 1 silver star milk the next day, then add the variations of large milk and it takes forever to get all 10 milk, this applies to other bundles that take multiple of an item that can have a varying quality    "], ["Anyone else having issues with spoiling milk?", "76", "9", "2023-08-08T13:07:29.714000+0000", "https://www.reddit.com/r/halifax/comments/15lhqiq/anyone_else_having_issues_with_spoiling_milk/", "This has happened twice in a row to the milk in my fridge over the past 2 weeks (so not even the hottest days this year). Both times, the milk has been at least a week prior to best before date. Once on the door of the fridge, but the second time it was being stored on a proper shelf. Has this been happening to anyone else? UPDATE: The problem is in fact, the fridge. Bought an appliance thermometer, and it looks like the fridge just isn't keeping cold enough. Set to 3Â° but it's between 7-10Â° in the main area of the fridge. Freezer is perfectly fine, sitting around -18Â°. Tried troubleshooting with no luck, repair appt this week. Thanks for the tips folks!    "], ["Issues with Steaming Milk for Latte", "15", "7", "2024-03-06T22:08:36.089000+0000", "https://www.reddit.com/r/gaggiaclassic/comments/1b8ct0v/issues_with_steaming_milk_for_latte/", "I've had the Gaggia Classic Pro for about 3 months now, and still can't seem to get the milk steaming right.  I've watched every video available, and tried different techniques with no luck, tilting, not tilting, starting to steam before the light comes on. i've asked local baristas what they do cuz i've seen some where they use a thermometer and/or just leaving the milk jug sitting. While steaming, i'm hearing what believe is the correct sound of when it should be done, as well as a 'glossy/silky' look to it, but once i start to pour, it basically just comes out as hot milk.  hard to explain the textue, but if you've ever warmed up milk in a pot over the stove, that generally what i get.  It's making for an unsatisfying cup of latte. i'm now thinking of getting a single holed tip to replace the stock one? maybe getting thermometer? Am i using wrong milk? Any thoughts?! Gone so far as thinking about signing up for an in-person barista class. frustrated.    "], ["Does anyone have issues with soya milk or products? ", "1", "2", "2024-04-19T21:31:00.322000+0000", "https://www.reddit.com/r/SIBO/comments/1c88k5w/does_anyone_have_issues_with_soya_milk_or_products/", "I got myself soya milk and yogurts because dairy is a no no right now, will they cause a flare up? Thank you    "], ["After months of issues with frothing milk", "14", "0", "2023-09-24T10:53:14.575000+0000", "https://www.reddit.com/r/gaggiaclassic/comments/16qus7o/after_months_of_issues_with_frothing_milk/", "I found an old forum post from, like, 2009, where someone is told NOT to press the right hand BREW button. Suddenly I'm now mediocre at frothing milk! Leaps and bounds from where I was, apparently dumping hot water into the milk....    "], ["Milk slow to come in and issues with latching.", "13", "5", "2023-10-02T03:05:23.797000+0000", "https://www.reddit.com/r/breastfeeding/comments/16xlh2f/milk_slow_to_come_in_and_issues_with_latching/", "Hi, I am a FTM to a one week old girl. I am not finding breastfeeding easy, in fact, it's sending my mental health into the actual ground that I'm not intuitive at breastfeeding, not making enough milk, and my girl is mostly on formula because she needs to eat and is quite jaundiced. I feel like an utter failure. I feel like if I don't get breastfeeding down I will have let her down completely, and I don't get why it's so hard. I'm working with a consultant and they can get her to latch but as soon as we're alone it doesn't click. I literally sob over this for hours. I am pumping regularly and hardly anything is coming out. I'm looking for solace, similar stories and advice. I feel like I'm in the loneliest and most heartbroken spot and I don't know what to do. Can my milk still come in and build ?    "], ["Anyone else having issues with Duette pump by Legendairy Milk?", "4", "1", "2023-11-17T17:58:15.488000+0000", "https://www.reddit.com/r/ExclusivelyPumping/comments/17xkvq3/anyone_else_having_issues_with_duette_pump_by/", "I ordered a Duette pump from Legendairy Milk to take to the office with me when I returned to work - used it a handful of times before then and really struggled to even get it to turn on. When it got shipped to me, it arrived with the faceplate detached from the machine. Fast forward to using it in the office for the first time, I can't get the thing to turn on again. I had so many issues with the buttons, I reached out and they sent me a replacement. Now I have my replacement pump and it will randomly turn the suction all the way up on one side when I haven't pressed any buttons. Most recently, it just got stuck with the suction turned all the way up and NONE of the buttons worked on the pump at all to turn it off or adjust it in any way. I just had to wait for it to shut off after 30 minutes so I can try adjusting the settings again. Anyone else having issues like this?    "], ["Found out that I'm also allergic to rice and nuts. What's left for me? Issues with soy milk?", "44", "31", "2023-07-16T00:10:12.315000+0000", "https://www.reddit.com/r/Celiac/comments/150rdfd/found_out_that_im_also_allergic_to_rice_and_nuts/", "This is mostly just me whining, but if you're in the same boat, I'd love to hear your favorite foods, advice, etc. About a year into my celiac diagnosis, I started to feel really frustrated and depressed. I guess the novelty of not feeling sick all the time wore off because it suddenly seemed awful. Between the challenges of traveling, always feeling like a burden/diva to family and friends and having to constantly think about buying and fixing food, I was (and honestly still am) exhausted. I was just starting to come out of this slump when I found out that I'm also allergic to rice and nuts. It was more shocking than annoying at first, but now I'm realizing just how many gluten free foods contain rice and nuts. I had a mild reaction to dairy, so I'm also trying to cut back there, too. (What kind of milk should I try? I read on Google somewhere that people with celiac disease don't react well to soy milk because of the high chance of cross-contamination.) Anyway, I know that avoiding these foods will help me feel better. After a year and a half of eating gluten free, my liver enzymes were still extremely elevated at my last GI appointment, so I'm hoping that this new diet finally cracks the code. Anyone else dealing with food allergies on top of celiac? Any apps or tools that help you manage? I dread meal planning and grocery shopping tomorrow...    "], ["Anyone had issues with milk turning bitter after just 1 or 2 days in the fridge?", "16", "2", "2024-01-03T03:36:48.253000+0000", "https://www.reddit.com/r/Milk/comments/18x9d96/anyone_had_issues_with_milk_turning_bitter_after/", "Specifically we are using Paul's Zymil Milk (UHT). Most of the cartons are fine but some of them have this really odd bitter or burnt taste to them. We put them in the fridge the day before to get them cold and then open them the next day and pour them straight into a cup.    "], ["Any issues with Quest Protein Shakes? Protein blend (whey protein isolate, micellar casein, milk protein isolate)", "0", "2", "2024-03-19T01:05:41.080000+0000", "https://www.reddit.com/r/HistamineIntolerance/comments/1bi7qc2/any_issues_with_quest_protein_shakes_protein/", "Ingredients: PROTEIN BLEND (WHEY PROTEIN ISOLATE, MICELLAR CASEIN, MILK PROTEIN ISOLATE), ERYTHRITOL, NATURAL FLAVORS. CONTAINS LESS THAN 2% OF THE FOLLOWING: COCONUT OIL, COCOA PROCESSED WITH ALKALI, SOLUBLE CORN FIBER, CELLULOSE GUM, COCOA BUTTER, XANTHAN GUM, SALT, SUNFLOWER LECITHIN, SODIUM CASEINATE, SUCRALOSE, SILICON DIOXIDE, STEVIOL GLYCOSIDES (STEVIA), BAKING SODA.    "], ["Anyone have issues with milk coming in at 37 weeks?", "1", "2", "2023-08-28T22:21:25.510000+0000", "https://www.reddit.com/r/BabyBumps/comments/164024z/anyone_have_issues_with_milk_coming_in_at_37_weeks/", "I had my 1st baby at 34 weeks and my milk never came in well. I tried everything for weeks and just never made much. My second was born at 41 weeks and 2 days after I had her I started producing plenty of milk and never had supply issues. I'm thinking the issue with #1 was the early birth and my body just not being ready. I'm being induced at 37 weeks with this baby and wondering if anyone had issues with milk supply after delivering at 37 weeks. Also any tips on boosting supply in the few days after baby is born would be awesome.    "], ["Nerd Alert: Latest Issue of the Journal of Popular Romance Studies is out", "21", "136", "2024-03-22T12:43:27.545000+0000", "https://www.reddit.com/r/RomanceBooks/comments/1bkybwr/nerd_alert_latest_issue_of_the_journal_of_popular/", "The 2024 issue of the Journal of Popular Romance Studies is out and it's a fun one, including the articles Feeling Judged: Reflections on Pornography and Romance from a Minotaur Milking Farm (yes, it's about {Morning Glory Milking Farm by C.M. Nascosta} and Saying \"I Don't\": Queer Romance in the Post-Marriage Equality World . If you like academic articles and reading romance, this journal combines them both - have fun!    "], ["Trouble with Lactose Free Milk?", "37", "6", "2023-12-27T19:18:49.584000+0000", "https://www.reddit.com/r/FODMAPS/comments/18s8nyb/trouble_with_lactose_free_milk/", "My husband is on fodmap and it's going really well. However, the other day he tried a bowl of cereal with lactose free milk and got very sick. It is milk with the enzyme added to help digest. He had a really violent bout of stomach upset for a few hours. No fever, but chills. No skin reaction either. He is able to eat most cheese and even cooked things that contain a bit of regular milk. But the lactose free milk was big problem. The fact that he can eat cheese makes me think it's not a dairy thing entirely. Anyone else have a bad reaction to lactose free milk?!    "], ["Trouble with milk Supply, Pumping Only", "38", "16", "2023-12-25T23:29:59.133000+0000", "https://www.reddit.com/r/breastfeeding/comments/18qty6e/trouble_with_milk_supply_pumping_only/", "My wife has been exclusively trying to pump and has been so upset by her supply. She pumps every 2 hours and produces about half an oz or 20 mLs each time. She has also been \"power pumping\" once a day to try and help. It has been a little over a week now and she is upset by the lack of progress. Has anyone gone through something similar or have any advice? I try to assure her it is okay, and that she can quit if she would like, but she feels bad for our newborn son. It is also important to note she has extensive DVT in her leg and is on Lovenox shots.    "], ["Anyone else having trouble with Brahmin milking?", "35", "15", "2023-11-08T21:20:02.628000+0000", "https://www.reddit.com/r/fo76/comments/17qvzfl/anyone_else_having_trouble_with_brahmin_milking/", "Any Brahmin I've found couldn't be milked(interacted with). I tried server hopping and also restarting the game but no luck. I want to complete the birthday challenges. (Edit. I got the milk)    "], ["New Ecm having trouble with frothing milk", "8", "1", "2024-02-02T19:25:36.595000+0000", "https://www.reddit.com/r/ECM_Espresso/comments/1ahbwff/new_ecm_having_trouble_with_frothing_milk/", "Just recently upgraded from a breville barista to a ECM classika . Had the frothing figured out on the breville however, been having issues with the frothing on the ECM. I'm wondering how long you are supposed to wait for the wand to heat up ? I've been waiting around 3-4 minutes after I turn on the steam switch and it still comes out weak. I'm also wondering if I'm missing a step? I usually turn the pump on and let a little water bleed out before changing to steam mode and letting it heat up.    "], ["Pumping issue: Trouble with getting the milk to flow ", "10", "2", "2024-03-10T09:03:59.310000+0000", "https://www.reddit.com/r/ExclusivelyPumping/comments/1bb5zys/pumping_issue_trouble_with_getting_the_milk_to/", "Does anyone have any tips or tricks for when your boobs don't want to let down? I just gave birth a week ago today and my milk has officially come in. Everything has gone alright, but randomly tonight my milk did not want to come out even though it was there. I had to sit there and massage them for anything to come out. Even after that I feel like I didn't get it all. Both my breast feel kind of swollen and overall I'm just getting so frustrated. I don't know what I'm doing wrong. The lactation consultant said my flange size was correct    "], ["Trouble with MilkStreet Recipes?", "10", "12", "2023-09-11T18:11:52.698000+0000", "https://www.reddit.com/r/instantpot/comments/16g2l63/trouble_with_milkstreet_recipes/", "Hi All, We've been using the Slow and Fast Milk Street cookbook but have a really low success rate when pressurizing. Do other have trouble with these recipes? Thanks!    "], ["trouble with nanofoamer and califia barista oat milk", "4", "1", "2023-11-07T07:07:47.700000+0000", "https://www.reddit.com/r/espresso/comments/17popbw/trouble_with_nanofoamer_and_califia_barista_oat/", "any nanofoamer users here could give me tips with frothing Califia Barista oat milk? I've had relatively good success with Oatly barista oat milk, but for the life of me cannot get the Califia brand to froth properly. it stays super thin. my workflow is to microwave the milk for ~1 minutes and then froth. I've tried aerating for about 10seconds and still no difference. I have no idea why.    "], ["Did anyone who had to have their twins early and in nicu have trouble with their milk coming in?", "34", "13", "2024-01-17T16:38:41.683000+0000", "https://www.reddit.com/r/parentsofmultiples/comments/1990wsv/did_anyone_who_had_to_have_their_twins_early_and/", "I'm discouraged currently. My twins were born 1/9/24 at 5 lbs 4 oz and 2 lbs 12 ounces. I am so incredibly grateful to have both my babies as we almost lost twin b, but because she is so little I want to give her the best I can give her to get her up to 4 lbs so she can come home. Anyone have trouble with their milk coming in because their babies were premature? I'm feeling a lot of pressure because I apparently should be making more, and the nicu nurse last night wouldn't let me try to let baby girl latch to my nipple because she was worried she wouldn't get enough milk. I told her I am okay with any sort of supplementing and that I felt like she'd learn her cues quicker if she tried to latch naturally.  I exclusively formula fed my singleton and he was quite the chunk, and having twins I just assumed I'd supplement with formula. Anyone else been in a similar situation? I'm so tired as it is splitting my time between the hospital and home to be with all my kids in a single day. I think stress is really factoring in here. Any feedback is appreciated!    "], ["Got trouble with milk? Try these proven tips for managing lactose intolerance", "0", "1", "2023-10-04T00:06:50.839000+0000", "https://www.reddit.com/r/mynetdiary/comments/16z82o9/got_trouble_with_milk_try_these_proven_tips_for/", "Does managing lactose intolerance keep you from enjoying the foods you love? Fortunately, there are many easy strategies for dealing with high-lactose foods without sacrificing the best of both worlds.  https://www.mynetdiary.com/managing-lactose-intolerance.html     "], ["Bâ\u0080\u0099ys anyone having trouble with scottsburn cartons?", "41", "55", "2024-05-28T20:39:44.099000+0000", "https://www.reddit.com/r/newfoundland/comments/1d2txcr/bys_anyone_having_trouble_with_scottsburn_cartons/", "I've had a few 2% milk and coffee cream, back to back, that the cartons have been quite difficult to open. They seem softer. lol    "], ["Struggling with increasing milk output", "36", "7", "2024-03-19T07:28:24.021000+0000", "https://www.reddit.com/r/breastfeeding/comments/1biekas/struggling_with_increasing_milk_output/", "So i have been told and i keep reading that milk supply can be increased by just removing milk more often. My son is 6 weeks old  I breastfeed but i also am forced giving my son formula because during the day he eats literally more than twice the amount he does at night. I cant keep up no matter what. And i feel i am going insane and im tired of being told the same things over and over, that it is based on demand. I pump, not exclusively but my son usually falls asleep during breastfeeds, almost instantly, so i prefer pumping so i can at least keep track of the amounts and be done with feeding faster rather than going in and out of sleep for hours. I have been trying to squeeze in pumping sessions as often as i have time but. I dont notice any increase in milk output. Quite the contrary, some days one of my breasts produces about half as the other and im not sure whether thats normal or not. Furthermore, i produce only about 15ml of milk an hours from each breast, at night its closer to 20. But i keep reading \"normal\" amounts are double that. I wish i had double so that i could stop giving formula. Am i crazy? Is this just me, doing something wrong? I pump about 8 times perhaps more some days, plus i put my son to the breast every time i cannot soothe him any other way.    "], ["Struggling with milk alternatives", "17", "2", "2024-03-29T14:32:01.293000+0000", "https://www.reddit.com/r/tea/comments/1bqqpqs/struggling_with_milk_alternatives/", "So I've recently been experimenting with oat milk in tea and I can't lie it just doesn't hit the same. I'm using Oatlys barista one which I hear alot of good things about but it has a tangy quality that just doesn't meld with me, completely overpowers any flavor of the tea. Which others should I try? Something as close to normal milk as possible taste wise? Curious if anyone else has this issue    "], ["Struggling with steaming milk. ", "8", "3", "2024-05-21T19:28:08.578000+0000", "https://www.reddit.com/r/espresso/comments/1cxgfrl/struggling_with_steaming_milk/", "I purchased a profitec go and just suck at steaming milk. Only has been 4 times so far but feel like it will be a while before i get to the point of even attempting latte art.    "], ["Is amul lactose free milk good? Struggling with diet 16M", "20", "5", "2024-03-05T10:30:58.919000+0000", "https://www.reddit.com/r/Fitness_India/comments/1b72531/is_amul_lactose_free_milk_good_struggling_with/", "So I apparently have a lot of food allergies and I'm also lactose intolerant which makes it harder for me to get my protein. I currently drink almond milk but I just saw that there's something like lactose free milk which amul is selling. I just wanna know if it's good and if it'll cause any allergic reaction to me? Also are there some lactose free panner options too? If someone has knowledge about this or have tried this products your advice would be really appreciated.    "], ["Struggling with milk supply/pumping", "20", "7", "2023-09-05T04:35:05.787000+0000", "https://www.reddit.com/r/NICUParents/comments/16aeb6d/struggling_with_milk_supplypumping/", "My baby has been home a week now from the nicu and is officially a month old  and I've been combo feeding.  formula and pumped fortified breast milk every other feeding. I'm getting discouraged because my supply hasn't increased and I feel like I'm failing her. Pumping drains me and it's pathetic because I've extended it to every 6 hours for 25-30 min and it still feels like a burden. The most I've been able to produce is 80 ml combined from both breasts. I bought a supplement to increase it and it hasn't really helped much. To top it off, she's been extra fussy these last two days and I've been extra tired. I was supposed to pump at 8pm yesterday and I was so tired I slept through it while my husband was home which would have made it easier for me to get it done. and it's now 12 am the next day and I haven't been able to pump for more than 5 min because she's being fussy and just wants me to hold her and my husband has left for work. Any advice? Will this just be my supply? Should I try pumping more? It will drain me more but if that increases my supply so she will have more more often I will. Has anyone been in similar space with pumping and it being draining    "], ["Struggling with milk production", "14", "4", "2023-09-06T20:15:30.905000+0000", "https://www.reddit.com/r/breastfeedingsupport/comments/16bup2o/struggling_with_milk_production/", "As the title suggests, I've been struggling with my production. My baby is 7 weeks old and I started out with primarily breastfeeding. I started pumping regularly and was able to get several ounces at first. My production started dwindling and I had to start supplementing with formula. I had a c-section and was told that affected milk production. I started taking supplements from legenDAIRY milk and lactation cookies, brownies, protein powders, etc. Even with regular attempts at pumping I barely get anything, my baby gets frustrated when I try to breast feed. I've seen on TikTok (I know not always reliable) about Fenugreek and thought about trying it. Is it safe? Has anyone tried it and does it help?    "], ["Still struggling with low milk supply 6 weeks postpartum", "13", "3", "2024-02-06T23:41:54.499000+0000", "https://www.reddit.com/r/breastfeedingsupport/comments/1akogsk/still_struggling_with_low_milk_supply_6_weeks/", "I had my boy 6 weeks ago. We dealt with low blood sugar and jaundice and my milk hadn't come in yet so we were forced to introduce a bottle and supplement with formula from the start. The last 6 weeks now I have been combo/triple feeding. Babies latch is super inconsistent. At best stays latched 10 or so min. Tongue tie was ruled out. But we always try breast first. Initially I was only pumping 1oz between both breast's and for a few days I got up to 2-3 oz and now suddenly I'm back down to only getting 1 oz total per pump. Baby is eating 4oz right now. I pump after every feed throughout the day and Night and incorporated power pumping once daily. I really wanted to EBF or even EP but feel like I'm failing at both. I've been drinking body armor , tried sunflower lecithin , massagers, fenugreek tea etc. Is it possible it just never happens for some of us? I'm feeling so discouraged and family thinks I should just FF :/    "], ["Struggling with Chocolate Cravings: Allergic to Milk, Seeking Advice", "17", "15", "2023-12-14T17:40:53.466000+0000", "https://www.reddit.com/r/fuckeatingdisorders/comments/18ie26p/struggling_with_chocolate_cravings_allergic_to/", "Hey fellow intuitive eaters! ð\u009f\u008d« I have a deep love for chocolate, but unfortunately, I'm allergic to milk protein. When I indulge, I end up with eczema, occasional asthma, and a really upset stomach. It's not life-threatening, but it definitely doesn't make me feel great. The challenge is, vegan alternatives just don't hit the same taste-wise. I occasionally treat myself to regular chocolate, even though it makes me sick. The tricky part is, I tend to binge on it knowing I'll have to give it up soon due to my allergy. I don't binge on anything else. Any advice on navigating this chocolate dilemma?    "], ["Help needed on MILLET FLAVOURED MILK ", "17", "2", "2024-04-19T09:35:36.737000+0000", "https://www.reddit.com/r/foodscience/comments/1c7sp7j/help_needed_on_millet_flavoured_milk/", "https://ibb.co/X22JrVV   https://ibb.co/wYsmpV3  This is a millet flavoured milk I have been working on. It was sterilized at 120 degree C. This was what happened. I didn't add any stabilizers to see what would happen without it because carrageenan wasn't helping at all. This is the recipe. Milk - 1030 G DSP - 1 G INSTANT JOWAR POWDER - 22.5 G SUGAR - 120 G Can anyone suggest any stabilizers to get this right? Enzymes are not usable because of the costs. Also, the dosage of the stabilizers would be nice too.    "], ["Help needed!!! Traveling dipped my milk supply! Please help!", "5", "2", "2024-02-25T00:37:12.372000+0000", "https://www.reddit.com/r/breastfeeding/comments/1azadzt/help_needed_traveling_dipped_my_milk_supply/", "So I traveled to Jacksonville Florida a few days ago from Ohio. The next day we left and went back home to Ohio. In the way there I used my media hand pump and was going good. But on the way back and ever since my milk supply has took a dip that I had to touch my little milk stash in the freezer (ps I'm just a enougher I'm not a oversupplier) I'm going to the grocery store tomorrow so please help me on what I need to get food wise to increase my milk supply back. I been pumping every 3-4 hours since we got home and I'm only getting 2-3 oz both breast combined. When I usually get 6 oz. I also was waking up engorged because I didn't pump in the middle of the night and got a good 10 oz every morning. Now that's gone and I'm only getting 6-7 in the morning. Please help I'm so sad. I been supplementing with kendamil formula for her in the mean time :( my goal was to try to make it to 6 months (she's 3 months old) and if I could make it to a year.    "], ["Help Needed! Choosing the Perfect Milk Jug on AliExpress", "5", "3", "2024-01-04T23:05:07.302000+0000", "https://www.reddit.com/r/espresso/comments/18yqwo8/help_needed_choosing_the_perfect_milk_jug_on/", "I'm on the hunt for a new milk jug on AliExpress, and I'm feeling a bit overwhelmed by the sheer variety out there. I figured, who better to turn to for advice than this fantastic community? Here    "], ["Serious help needed to fill the 25gram protein gap and I'm thinking about amul's protein milk", "17", "13", "2024-02-21T04:43:27.708000+0000", "https://www.reddit.com/r/Fitness_India/comments/1aw3atn/serious_help_needed_to_fill_the_25gram_protein/", "I already eat chicken, eggs and fish so i can't be able to eat more. So i would like to drink it. Soya chunks is the worst and I honestly cannot be able to eat 50g. So out of all the options, beef and amul milk would suit my budget but beef is not available so that leaves me to the buttermilk alone Please comment how good it is and does it have a expiry date. I'm sure it'll taste better than soya chunks plus drinking is too easy than eating Pls suggest other options if it comes under 1500rs but I would prefer a drinkable protein or like a snack with very small quantity to eat    "], ["Ckd 4 diet. Help needed", "28", "6", "2024-04-19T01:43:23.895000+0000", "https://www.reddit.com/r/kidneydisease/comments/1c7kvb6/ckd_4_diet_help_needed/", "My mom has ckd 4 i think I'm not sure about the stage. But she is losing a lot of weight because she controls her diet very well. We need something that has good amount of calories but no phosphorus, potassium, sodium & proteins. Please suggest something she could eat to atleast gain some weight. Also it's really difficult to find a dietician who specializes in ckd how do we do that. Edit : no milk and milk products.    "], ["Help needed. Ftm", "80", "13", "2023-06-12T19:24:21.149000+0000", "https://www.reddit.com/r/breastfeeding/comments/147va0i/help_needed_ftm/", "Baby is 2 weeks old and ive been combo feeding with pumped milk and ready to feed milk. After pumping i wouldnt have much left to directly breastfeed so id go straight to pumped breastmilk when feeding him. I was advised to put baby on breast first as the benefits are greater than pumped breastmilk and everything after. Yesterday i tried this out and baby cluster fed alot, but i felt like he wasnt getting enough.. id top up with formula and he'd only drink 20ml (compared to before hed finish even 60ml of bottled milk) On the breast he can stay maybe 10minutes then fall asleep right after.. if i put a bottle in his mouth he continues eating but wont latch on my own breast while sleeping. Today i woke up feeling that my breast were empty but on the days i used to pump (only twice a day) id wake up engorged. I cant figure out what to do.. im not even sure what im asking. What worked out for those who were combo feeding? Is it normal to no longer feel engorged with baby more on the breast? Could i have low supply which is why baby falls asleep only after 10 mins..?    "], ["Help needed", "18", "9", "2024-04-20T20:39:29.910000+0000", "https://www.reddit.com/r/goats/comments/1c8zwej/help_needed/", "I got a baby goat two weeks ago and now he is having diarrhea. The people at the farm said he is 2 months old so he can eat only grass, he doesn't need milk anymore. He stopped eating a few days ago and has been bloated. We called the vet, he gave him some shots and said he has very little chance of survival. He has been eating very little but today he ate some bread and a few leaves. We tried feeding him milk but he doesn't want to drink any. Is there any treatment to help him? Please help me, i really want him to survive ð\u009f\u0099\u008f edit: he is doing much better today, thank you for the help everyone!    "], ["FTM, sheâ\u0080\u0099s here. BF help needed [ON]", "57", "25", "2024-04-12T23:16:29.871000+0000", "https://www.reddit.com/r/BabyBumpsCanada/comments/1c2nbvl/ftm_shes_here_bf_help_needed_on/", "FTM, baby wants to breastfeed, I can express colostrum & my milk is coming in but can't get baby to latch. She has a strong suck on finger and bottle. She doesn't open mouth wide enough and always has her hands at her mouth in the way. Any tips or resources would be helpful Also any suggestions on where to find a lactation consultant that does home visits? I'm in Toronto    "], ["Adopted calfs. Help needed. ", "28", "1", "2024-03-01T07:24:58.928000+0000", "https://www.reddit.com/r/Cattle/comments/1b3og4s/adopted_calfs_help_needed/", "Good people. I just adopted two calfs and hoped they would be accepted by the other cows already with their own calfs. The cows are milking breed and should easily be able to sustain two calfs each with milk. However, the cows do not accept the new calfs, and the calfs are now hungry as they haven't had milk from their new mothers. They seem restless and worried in their new environment. Any tips to how I get the calfs to drink from their new mothers? My current plan is to give it some more time and if not working ill try to tie one mother so that I can guide the calf over and hopefully make I drink. Any other recommendations? All comments appreciated. Edit: Like rest of reddit this sub is also concluding like mad men. The calves are not newborn(!) , they are several weeks. And it's not the first time I adopt, but these are older than normal. Edit 2: Ended well, both calves fully adopted. Great mothers. Glad I did not go straight to bottle feeding as it would be so much harder adopting them after. I guess my cows are not like most cows. Mine are damn amazing.    "], ["Iâ\u0080\u0099m addicted to milk. And I need help quiting", "37", "43", "2024-04-22T02:05:40.325000+0000", "https://www.reddit.com/r/Milk/comments/1c9z68e/im_addicted_to_milk_and_i_need_help_quiting/", "I drink a gallon of milk. A day.   And I feel like I'm gaining weight over it.    I drink milk with all my meals.  I don't drink soda or water just milk.    I need milk to sleep.  Or even to be in a better mood.  It's like a drug for me.   I feel like it's causing me to gain weight.  And I need some tips on how to quit.   I. Either need to go cold turkey because I won't settle for anything less then whole milk. .  It's a way of life I've been drinking a gallon of milk for like the past 20 years.    "], ["Need help with increasing milk supply", "23", "2", "2024-02-26T13:58:13.589000+0000", "https://www.reddit.com/r/ExclusivelyPumping/comments/1b0i527/need_help_with_increasing_milk_supply/", "Update Wanted to give you all an update. So far I'm 8 weeks postpartum and d my milk supply is still low.  Still only making about 20 mls per pump. I will be honest haven't been able to be consistent with pumping on a schedule, especially at night. I love my sleep and I've just been waking up to feed my little one without pumping. So I'm now taking steps to increase my supply again. I've bought mother's milk tea, I'm eating lactation cookies and I'm going to commit to eating more during the day. Naps maybe I'll try. My mother-in-law has also told me about a Hispanic superstition where if you're walking barefoot in the house and your back is uncovered while it's cold, it decreases your milk supply. So wearing slippers and socks and being bundled up will be my new norm. I'll try and update again soon and I'm praying all of these all work. Hi everyone, I'm currently 4 weeks postpartum and trying to increase my milk supply. My little one is drinking about 100-120ml or 4oz each feeding and I am only pumping about 40-60ml each time I pump. I've been pumping every 3 hours and I eat about twice a day with snacks in between and drink lots of water but my supply still runs low. I notice when I get more sleep that my supply goes up but the demands of everyday life is now catching up with me and I can't keep sleeping during the day. Does anyone have any tips or recommendations for me to increase my supply?    "], ["Need help steaming milk", "7", "1", "2024-04-14T21:49:26.973000+0000", "https://www.reddit.com/r/barista/comments/1c45aad/need_help_steaming_milk/", "I'm not a barista, but I work in a cafe and serve coffees. I always get the amount of foam wrong for a latte, I either put too little or too much. I'm bad at estimating how much froth I need People say â\u0080\u009cit should be 1cmâ\u0080\u009d but I'm bad at judging that during the steaming process How do you guys know when to go â\u0080\u009cok that's enough stretchingâ\u0080\u009d? Things I've already tried   practice. I've practiced loads of times. Some days I'm good, some days I'm really inconsistent   timing it. â\u0080\u009cStretch for 2 secondsâ\u0080\u009d. Doesn't produce consistent results   eyeballing the volume - I'm not good as judging it   YouTube videos - I've watched loads, but they don't explain how long to stretch for      "], ["need help for dog food/milk", "16", "0", "2024-04-05T12:43:08.484000+0000", "https://www.reddit.com/r/Assistance/comments/1bwh2ur/need_help_for_dog_foodmilk/", "our dog got pregnant accidentally and gave birth to 5puppies a month ago( 1died cause the mother don't want to breastfeed) the other 4 puppies survived , but i noticed the mother distance herself when the puppies are hungry. we just try to put the baby dogs near her to get fed in return the mother stops eating. Im requesting assistance for the puppies before we can give them for adoption we can't afford to feed 5dogs right now. thank you ð\u009f\u0099\u008fð\u009f\u008f» ps. only have PayPal edit : I need 15$ for the dog food( don't know how much dog milk costs but we are trying to convince browny to eat and feed the puppies. im from Ph ð\u009f\u0087µð\u009f\u0087­ thanks    "], ["\"Berry\" Milk Glass - Need help!", "6", "6", "2024-05-19T22:03:13.271000+0000", "https://www.reddit.com/r/glasscollecting/comments/1cvzo5m/berry_milk_glass_need_help/", "Hello all, I was out vintage glass shopping with my wife today, and after a small mishap at one of the vendors, we are now the owners of this mystery milk glass piece that I have spent hours trying to ID. I'm turning to the professionals in this group for your help and guidance! The seller said it is \"raspberry\" pattern. I have cross referenced it to both Westmoreland and Hobbs Brockunier \"Berry\"/\"Berry and leaves\"/ and \"Blackberry\" patterns but upon close inspection the pattern does not appear correct on any of the aforementioned although very similar (leaf size/shape/detail/placement around the cluster of 5 is the big difference). I've attached a few images of the piece, along with the shattered top that got me into this predicament in the first place. Would love to be able to ID it properly so I have a starting point for my new holy grail search...a replacement top. Thank you in advance to anyone who can offer assistance!    "], ["Need help steaming oat milk", "3", "4", "2024-05-07T23:10:24.489000+0000", "https://www.reddit.com/r/latteart/comments/1cmpofr/need_help_steaming_oat_milk/", "So for the past week now, I've been trying to learn to steam milk properly so I can actually do latte art. I'm using a DeLonghi All in one Espresso machine (not the one who bought it, but it's what I have to work with). I've watched countless videos and tutorials, taking note of all the intricate details like shaking the milk beforehand (Califia oat milk), purging the wand right before so no condensation gets in the milk, letting in super small but consistent chirps of air for the first 3-5 seconds or until the jug is as warm as the hand or until the volume is like 1cm higher, etc. Even with all this in mind, I still can't get the milk to reach the right texture. I started to think maybe it's the steam wand. So I replaced it with a 3-hole metal version of the usual rubber piece people online say to use without the big metal shell. Google â\u0080\u009cdelonghi stilosa steam wandâ\u0080\u009d for a picture of what I'm talking about and you'll also see the metal piece I switched it with. Ok great, should work now. Nope, still not the right texture. Ok, maybe it's the milk (was trying out all the different milk brands my family buys, almond, 2%, oat, sadly no whole milk though). So I got Califia oat milk, the gold standard for oat milk. But, lo and behold, still not reaching the right texture. Ok, let me try one last thing, maybe it's the pressure of the garbage steam wand I have to work with (even though there are videos on YT showing that it's very doable even with just the rubber tip version), maybe it's not creating a big enough whirl pool to distribute the air throughout the milk. So to fix this, after I added enough air and got the milk to the right temperature, which btw I'm checking with a thermometer to make sure it's reaching 140Â° F even with the delay, I then continued stirring with a handheld milk frother making sure to not add any more air and only stir until all the bubbles are gone and the texture looks even. I thought I really had it with this one, but still nope. I'm at a loss of what else to try because I'm positive it's something I'm doing wrong but I just can't figure it out. Maybe it's the amount of air I'm letting in? Please let me know if you want to see my steam wand or even how I do the process, because I'll do anything at this point. I just wanna be able to practice latte art. Thanks in advance.    "], ["Need help increasing milk supply", "6", "1", "2024-04-03T20:22:53.914000+0000", "https://www.reddit.com/r/breastfeeding/comments/1bv368b/need_help_increasing_milk_supply/", "My baby is 1 week, 3 days old. He needs ~50-60ml milk each feed and I feed him 8 times a day. I am only producing ~20ml of milk per breastfeed so we have to give him additional formula each time. Here's the way I am trying to increase my breast milk supply, Pumping immediately after I feed him to let my body know that my baby needs more milk. Eating oats, coconut water, dates, fig etc (not sure if this works) Are there any other mommas who faced the similar issue and got the workaround? I am worried that my milk will never be enough for my baby and I will have to continue giving him formula milk which I don't want to. Any suggestions or advice is welcomed. Thanks in advance!    "], ["What can I eat for fat? Struggling finding fat sources other than fish, nuts, avacado, milk and I NEED HELP!", "153", "0", "2024-01-29T17:02:54.020000+0000", "https://www.reddit.com/r/keto/comments/1ae06ty/what_can_i_eat_for_fat_struggling_finding_fat/", "I can't do this shit anymore. Finding suitable keto meals is fucking hard especially because other than the few things I mentionedâ\u0080¦ finding healthy fat foods is difficult as fuck, especially because it's not filling and especially because it's hard to use those things as a side other than avacado which is like 90% of where my fat comes from and I'm literally hating avacado now because I eat sooooooo fuuuuuckkkkiiiinng muuuuch of itâ\u0080¦. I'm lost and planning to quit this boring ass diet    "], ["Need help! Wifeâ\u0080\u0099s breast milk production has drastically come down and baby refuses all formula.", "97", "58", "2023-10-10T00:44:24.057000+0000", "https://www.reddit.com/r/daddit/comments/17482lp/need_help_wifes_breast_milk_production_has/", "Hey all - todays been rough. Baby is 5 months old this weekend and we're out of food. Our supply of pre pumped milk is done and she's refusing all formula. Wife's production dropped significantly since she went back to work. Idk what to do. Baby keeps crying cause she's hungry and we're trying to give her the small bit of milk we have left from pumping today. Anyone deal with this? 2 month update for those who were interested!(MOM) a few days after this post my supply did go up, which then prompted me to continue breastfeeding her. That was kinda a mistake lol bc when my supply dipped again (around my period) she hated the formula we were using that worked for her previously - the Kirkland brand. We ended up going with a suggestion that someone made on this thread - to try kendamil and that's been amazing. It tastes better to her than the other formulas and closer to my breast milk. She's mostly formula fed, I pump once a day at work, and I only breastfeed 2x a day - before bed for comfort and after waking up. Thank you all for the advice and help! She's happier, I'm less stressed, dad's less stressed! UPDATE: Can't thank everyone enough for all the suggestions. Baby is stuffed and happy today! What worked: -mom started power pumping yesterday and we have had more milk -we mixed pre made similac and BM (cold and room temp) ratio 1:2 respectively and used the medela bottle instead of Avent. Baby willingly drank nearly 15oz of this. -later in the day we tried the Kirkland one with BM ratio 1:1. Baby just drank 4oz of this.   i also got mom lactation cookies from target and vegan oatmeal cookies from TJs, her supply has increased since yday but it's hard to gauge the efficacy of the cookies so quickly   -also got her lactation tea from Walgreens All in all I tried incorporating a mix of suggestions and that's what worked for us so far. Our plan is try to get her on Kirkland by the end of the week. The goal is to increase production and also be able to fully supplement with formula if possible. Again thanks Reddit fam! Baby's so happy and playful now that she's fed right, our hearts are full.    "], ["Need help with Fore-milk Hind-milk Issue", "2", "1", "2023-11-05T01:36:44.449000+0000", "https://www.reddit.com/r/breastfeeding/comments/17o18k2/need_help_with_foremilk_hindmilk_issue/", "My four week old LO has been having horrible gas and green poop which I suspect is a fire milk hind milk issue because I'm oversupplying. I was wondering if I should pump some of the fore milk out before to ensure my LO doesn't get full on fore milk but pumping will not help my oversupply issue. Has anyone successfully rectified an imbalance? I read on some posts that massaging works/ does any one have any experience with that? And if so how do you massage?    "], ["Help for lumpiness", "17", "2", "2024-03-27T11:37:27.725000+0000", "https://www.reddit.com/r/yogurtmaking/comments/1bozppv/help_for_lumpiness/", "Hello! I am super new to yogurt making, and I'm having trouble with lumps. Does anyone have any advice, please? From reading previous posts, I think I may be adding too much starter culture or pasteurizing my milk at too high a temperature.                               I've been using the NYT recipe : 2 quarts whole milk 3 to 4 tablespoons plain whole milk yogurt with live and active cultures Step 1 Rub an ice cube over the inside bottom of a heavy pot to prevent scorching (or rinse the inside of the pot with cold water). Add milk and cream, if using, and bring to a bare simmer, until bubbles form around the edges, 180 to 200 degrees. Stir the milk occasionally as it heats. Step 2 Remove pot from heat and let cool until it feels pleasantly warm when you stick your pinkie in the milk for 10 seconds, 110 to 120 degrees. (If you think you'll need to use the pot for something else, transfer the milk to a glass or ceramic bowl, or else you can let it sit in the pot.) If you're in a hurry, you can fill your sink with ice water and let the pot of milk cool in the ice bath, stirring the milk frequently so it cools evenly. Step 3 Transfer 1/2 cup of warm milk to a small bowl and whisk in yogurt until smooth. Stir yogurt-milk mixture back into remaining pot of warm milk. Cover pot with a large lid. Keep pot warm by wrapping it in a large towel, or setting it on a heating pad, or moving to a warm place, such as your oven with the oven light turned on. Or just set it on top of your refrigerator, which tends to be both warm and out of the way. Step 4 Let yogurt sit for 6 to 12 hours, until the yogurt is thick and tangy; the longer it sits, the thicker and tangier it will become. (I usually let it sit for the full 12 hours.) Transfer the pot to the refrigerator and chill for at least another 4 hours; it will continue to thicken as it chills. I've tried doing it on the stovetop and in my InstantPot on the sous vide setting. I've tried straining it, but it turns out like cream cheese. I think I have it the consistency that I want now with the InstantPot and no straining, but no matter what I do, I get lumps. Any suggestions would be greatly appreciated! Thank you!    "], ["(need help for this) speed and storage", "8", "2", "2024-04-28T00:32:49.004000+0000", "https://www.reddit.com/r/askmath/comments/1ceti2k/need_help_for_this_speed_and_storage/", "Ship A has storage capacity of 24 units of milk and move at constant speed of 30 Km / Hour Ship B has storage capacity of 10 units of milk and move at constant speed of 70 Km/ Hour To move 100 units of milk, Which Ship is better?    "], ["Help for low weight kitten", "1", "2", "2024-06-07T22:06:39.584000+0000", "https://www.reddit.com/r/AskVet/comments/1dan6pf/help_for_low_weight_kitten/", "Hi, new to this sub- hope it's okay to ask?! Not strictly asking specific instructions- more a general advice. We have a cat that had a 4 kitten litter 10 days ago. One of the kittens is struggling to put on weight- it's not drastic yet- it's still nursing, but I feel it's being pushed out of the way by the three other stronger kittens. Question is, can I supplement its natural feeding with â\u0080\u0098kitten milk' I got from the supermarket? I read that cows milk is a big no, and this is made from â\u0080\u0098lactose reduced cows milk'. I've only just seen that it recommends for kittens 6 weeks or older. I wouldn't want to use anything that would be detrimental to its health, but I don't want the kitten to suffer or starve either. For reference the kitten in question is 10 days old and weighed 232g (8.18oz) yesterday, and 237g (8.36oz) today. The others weighed mid 270g (9.52oz) yesterday, and around 285g (10.05oz) today. Would you supplement natural feeding or say it's small but doing okay? And if supplement bottle feeding is required, use the â\u0080\u0098kitten milk' I have, or hold out til tomorrow and get a dedicated powder formula from the vets? Thanks, first time kitten parents here, and really want the best for them!!    "], ["Help for hair smell? ", "31", "6", "2024-04-08T15:31:05.058000+0000", "https://www.reddit.com/r/selfcare/comments/1bz0udq/help_for_hair_smell/", "Hey everyone, I'm an 18-year-old girl and I've been struggling with a persistent issue: my hair always smells bad! ð\u009f\u0098­ It's becoming really frustrating because I RARELY have good hair days anymore. At first, I suspected it might be my shampoo, so I switched it up, but unfortunately, that didn't solve the problem. I'm currently using an Aloe Vera shampoo because I trust Aloe Vera with my life LMAO. I then considered if it could be due to hard water in Germany, where I live, but we have a water filter and strangely, my mom's hair doesn't have the same issue. Btw my hair is currently thick and at chest length, hers is shorter. I've even questioned if I might be using too much shampoo, but I'm pretty careful about it and I also use a scalp massager to ensure it's properly rinsed out. I'm at a loss for what could be causing this persistent odor. Any advice or suggestions would be greatly appreciated! Thank you. EDIT: I would like to add that I'm Indian, in case that clarifies anything! ð\u009f\u0098­ Also I think I might just be washing my hair wrongly, which doesn't make sense! You see, when I broke my arm a few months ago, my mom washed my hair for me and my hair was good! It smelled nice and it was clean for a few days. But when I do it myself, it just doesn't work. So either I'm doing something extremely wrong, or I â\u0080¦ I don't know. I have even bought a hair milk â\u0080\u0094 which I don't know if that's what you would call it in English. if you don't know what that is, hair milk is basically a leave-in treatment that improves the suppleness and flexibility of the hair by replenishing dry areas with moisture. my hair gets dry very easily and fuzzy so that's why I bought it and thanks to that, I can at least spend one day without my hair smelling weird ð\u009f\u0098­ Here's a few links: my shampoo and my hair milk     "], ["64mm burr selection help for my taste profile? Zerno Z1 and fruity espresso!", "11", "2", "2024-05-07T05:03:33.839000+0000", "https://www.reddit.com/r/espresso/comments/1cm3yjo/64mm_burr_selection_help_for_my_taste_profile/", "What I'm chasing:   80% of the time: Fruity espresso in a smaller milk-based drink (cortado)    10% of the time: Expresso straight up espresso   10% of the time: Pourover (though I do have an Ode Gen 2 on the bar)   Bean roast level: I mainly drink light roast espresso, though sometimes I veer into medium roast or experimentally processed coffees.   I understand 1 grinder and / or burr can't optimize for all drinking methods but based off of the aforementioned, should I choose the SSP HU, SSP Cast V2, or SSP MP?Â   With the SSP HU, I worry there won't be enough â\u0080\u009cclarityâ\u0080\u009d   With the Cast V2, I worry it won't shine enough for either clarity or body / texture, resulting in a lacking cup since it's trying to solve both sides of the flavor spectrum   With MP, I worry it'll be too weak of a shot in a cortado, though perhaps this isn't as big of an issue because the milk proportion (for a cortado) is smaller vs other milk-based drinks      "], ["Help for three little newborn!", "9", "2", "2024-03-22T01:45:49.360000+0000", "https://www.reddit.com/r/CatAdvice/comments/1bknt6d/help_for_three_little_newborn/", "I found three little cats, I think they were born yesterday. The mom abandoned them, because they were cold and litteraly dying. Now all the shops in my area are closed and will open in six hours. For now I gave them a bit of water with sugar, and i have cow milk but I know that It will affect their health so I'm not giving It to them. I also have the powder milk of my three years Little Brother. It's called humana 3 I can give It to them?. I don't know what to do... What do you recommend I give them while I wait for the shops to open?    "], ["Looking for some emotional help for my wife.", "36", "34", "2024-01-29T22:24:02.565000+0000", "https://www.reddit.com/r/NewParents/comments/1ae841g/looking_for_some_emotional_help_for_my_wife/", "My wife gave birth to our first baby boy on the 15th. Sadly most everything that could go wrong with the pregnancy did. Right now she is struggling to produce milk so that she can breastfeed out son, which she so desperately wants to do as this is the last thing she can try and salvage some normalcy from in the whole ordeal. Unfortunately I am one of only two voices of encouragement she has to keep trying to breastfeed and get her milk production going while most of her family is pushing to just have her go to formula. I was hoping that other women here who have gone through the same thing could share their experiences and words of encouragement so she can see that this is not an uncommon struggle and that she is not failing as a mother because of something that is out of her control. We are aware that some of this maybe postpartum depression and we have scheduled a meeting with the hospitals counselor for tomorrow, but I would still love to show her that she isn't alone in this and outweigh the voices of negativity with voices of positivity for her. Update: I want to say thank you to everybody who commented. I showed my wife this post and all the comments you have all been leaving and that's made a huge difference already seeing how many people have shared her experience. I have already seen a positive shift in her while attempting to breastfeed, and she even  managed to get a good laugh in when our son fell asleep mid feeding even pumping since sharing this worth her has seen an upswing. I appreciate everyone who shared, you have all had a positive impact on both my wife and myself as well.    "], ["Help for mantis", "7", "3", "2024-05-05T05:37:41.224000+0000", "https://www.reddit.com/r/GroundedGame/comments/1ckk4x7/help_for_mantis/", "I want to go against the mantis and I've gotten almsost milk molars in NG+. But I was wanting to know if anyone has a good build for fighting the mantis armor, weapons, trinket, ect.    "], ["Allergy card help for travel in Rome", "14", "0", "2024-03-01T03:50:25.862000+0000", "https://www.reddit.com/r/Italian/comments/1b3kolm/allergy_card_help_for_travel_in_rome/", "Hello! I'm going to visit Rome in a few weeks, and my girlfriend and I are going to stay in a place where we cook most of our own food because of food restrictions, but we do want to try to eat at restaurants if we can. I have moderate food allergies (not the kind that causes anaphylaxis, but definitely a lot of other bad side effects ranging from nausea to hives and more). I don't need people to scrub the kitchen for me or anything, but I do need to make sure the food doesn't contain these ingredients or use the same serving utensils as food that does. My known allergies are: Moderate (please don't share utensils): cow's milk/cheese/butter and soy(a) Mild (no special preparation needed): eggs, hazelnuts, lentils, amaranth, goat milk/cheese What I've gotten from Google is: allergie alimentari (non anafilassi) allergie moderate (evitare contaminazioni): latte/formaggio/burro, soia allergie lievi: uova, nocciole, lenticchie, amaranto, latte di capra Does this make sense? Should I add any more information? Do you have any suggestions for edits? I just want to make sure I can be respectful to all restaurant employees and communicate with them in a way that's easiest for them. Thanks!    "], ["Having partner help with clogged milk duct?", "54", "26", "2024-02-18T07:37:06.443000+0000", "https://www.reddit.com/r/breastfeeding/comments/1atomhn/having_partner_help_with_clogged_milk_duct/", "So I have a horrible clog or what feels like many clogs right now on my left side and I'm at my wits end. It's hard as a rock and pretty painful. It's only started earlier today so it hasn't been a full 24 hours. My husband went out and got the lecithin and I only just took one. I've also been doing the ibuprofen and the icing and nursing off and on and nothing has helped. The only thing I could think of is having my husband suck it out. And we've tried a few times and nothing has happened unfortunately. I don't know if he's going it wrong? Can anyone help?? I'm desperate at this point ð\u009f\u0098­ð\u009f\u0098­ð\u009f\u0098­ Little update: I continued to take the lecithin and ibuprofen and nurses/pumped like regular and I think those things really helped but oh my goodness I would not wish that pain even on my worst enemy ð\u009f\u0098µâ\u0080\u008dð\u009f\u0092« I had gotten two hours of sleep and I still feel like I'm in some kind of simulation ð\u009f\u0098\u0085 I think it happened because I let my son nap on me for a little over an hour and all his weight was on that breast because later that day is when I noticed the pain. It's happened before when I had him napping on me. But thanks everyone who commented their suggestions ð\u009f\u0092\u0095    "], ["Help with milk powder!", "10", "3", "2024-05-06T14:36:11.004000+0000", "https://www.reddit.com/r/icecreamery/comments/1clklo2/help_with_milk_powder/", "Hi! I'm a newbie in making icecream, I actually learned from my boss since october for a shop in my town. The owners want to expand and for doing that we needed to increase the solids in our recipes, so the owners wife (shes like a food engineer or something like that) helped us out and made a new recipe. Problem is the taste. We use the base for our 'cold' mix, so we use water at probably 70C now and it doesn't require eggs. It takes a bunch of cream too but the texture is great. But our mint is going downhill:( at least I don't really find it as tasty as before, it needs 2 times more flavor (we use a water based essence, well it surely has alcohol but none of them say what ingredients are used) and it still tastes like milk, with a fresh aftertaste of could be mint. It makes me sad ð\u009f\u0098¢ our white creams suffer too, but that essence is way stronger so it hasn't changed much, but the milk flavor just pushes through everything. Even the cherry one or our sky cream that has like wine and everything, those two are really strong flavours and it doesn't matter. I've read around that recipes still use whole milk, and a bit of powdered milk to help texture, but our recipe is made only of powdered milk, liquid sugar, emulsifier in gel and powder, the stabilizer, cream, dextrose and sugar. Anyone can help me out a bit? I want to understand better what's actually behind the ice cream so I can properly point it out to my boss and figure something out with the company that sells us the ingredients, maybe they have a standard recipe we could use?    "], ["Help with producing milk", "7", "2", "2024-05-23T01:04:36.518000+0000", "https://www.reddit.com/r/Mommit/comments/1cygidb/help_with_producing_milk/", "Hello. I'm a mom of a 7 month old boy. So my supply has always been decent. I was able to feed my baby and he'd latch off on when he was full so I'd knew I was making enough milk for him. Lately his appetite has gone up quite a bit so I'd feed him but it's not enough anymore. He sucks but after a while i don't hear him swallowing anymore and he gets aggressive and starts crying for more. I stay hydrated all day. I eat 3 meals with snacks in between. My diet has been good and healthy. I feed whenever he's hungry and that's every 2 hours. I tried the coconut water mixed with electrolyte water to help boost my supply and it helped at first but slowly died down. I did try lactation cookies but unfortunately I can't afford them tbh. I do have WIC. I do have a container of baby formula and I have tried to feed him it but he absolutely hates it. He ends up spitting it out and cries. I'm not sure what I can do so I'm in desperate need of advice please.    "], ["Help with inefficient milk transfer?", "45", "8", "2023-09-04T23:01:45.727000+0000", "https://www.reddit.com/r/breastfeeding/comments/16a72qn/help_with_inefficient_milk_transfer/", "My baby is 1 month old and I'm feeling a bit stuck in our progress to get from triple feeding to (ideally) primarily nursing. Background: on day 3 he had to go to the hospital for dehydration and low blood sugar because I wasn't making enough milk, they kept him for 2 days because they were concerned about possible infection (in the end there was none) and started me triple feeding. Since then I've been trying to wean off triple feeding; I am making enough milk now to not need formula so supply isn't the issue; currently I offer the breast every feed, then we top up with bottle (slow flow, paced feeding) 4x a day, I also pump 4x a day (instead of previous 8). This is working right now, but I don't know where to go from here. We got a hatch scale and he gets anywhere from 30ml to 80ml in a half hour nursing session. It's frustrating that he knows what to do (it seems) but sometimes he's getting so little? He's also a bit sleepy at the breast and I'm doing everything I can (clothes off, tickling feet, etc) - it just makes nursing take a long time. Two LCs at the hospital said he has a good latch. Another outpatient LC said he has a bad latch. I think his latch is shallow because my nipple is compressed in shape after feeding, but it doesn't hurt. Pediatrician and LC are at odds whether his small tongue tie is worth addressing, I asked for ENT referral to evaluate and the next available ENT appt isn't until mid October. So what now? I am continuing to work on making sure we have as deep a latch as possible every time, and I've been told that as babies get bigger and stronger transfer can improve. Is there anything else I can try or ask about? I also welcome any positive stories from folks who have been in a similar place. I keep worrying about feeding him enough and feeling exhausted with feeding/pumping/cleaning bottles etc.    "], ["Help with Milk frogs?", "4", "6", "2024-05-03T03:27:19.285000+0000", "https://www.reddit.com/r/frogs/comments/1ciyuck/help_with_milk_frogs/", "I'm having trouble finding information specific to Amazon Milky Tree Frogs, of which I have two. I've had them around a year, and their level of energy/activity has fluctuated at times, but with them being nocturnal, I don't know if they were completely estivating at any point. Are they supposed to? I also have a few side questions that I was unable to find through google if anyone knows about them. Just want to be the best caretaker I can be! Other questions: -Other than crickets, do your milky frogs like any other insects? Mine seem to be picky and not like wax worms, they'll only eat crickets really. -What age do they reach full growth? They were very young when I got them (8 weeks I believe) so they are probably right at a year old. -someone at the store I bought them from, which specializes in reptiles, amphibians and arachnids, told me sphagnum moss is bad for them, but online I'm seeing people say to use it. What substrate is best for them? I've been using coconut husk soil since Ive had them and it's been fine.    "], ["Would milk help with malnourishment?", "4", "1", "2024-05-31T18:08:35.776000+0000", "https://www.reddit.com/r/NoStupidQuestions/comments/1d523iv/would_milk_help_with_malnourishment/", "All babies eat to grow is milkâ\u0080¦would human milk help adults who suffer from malnutrition?    "], ["Help with milk count! ", "7", "4", "2024-03-29T23:50:45.832000+0000", "https://www.reddit.com/r/starbucksbaristas/comments/1br3ej9/help_with_milk_count/", "So I'm trying to become a shift and my current shift is showing me how to do things. He tried showing me how to do the milk count but heres the thing : it had been a hour since we opened and I had only slept for 3 hours. My brain was jelly and I had no coffee in me and I told him how I didn't understand a word. So if anyone can help me, I would be so grateful!    "], ["Help with milk punch cocktails", "9", "1", "2024-04-14T12:38:10.131000+0000", "https://www.reddit.com/r/cocktails/comments/1c3smqx/help_with_milk_punch_cocktails/", "I am in the process of creating a milk punch cocktail however I am having trouble with the straining. I have tried using cheesecloth and coffee filters and it is getting trapped in the filter and not passing through after a certain amount of time. I even left it for 24hrs and still it had not passed through. Any ideas?    "], ["Having problems weaning breastfed baby!", "0", "1", "2024-03-31T20:25:18.413000+0000", "https://www.reddit.com/r/breastfeeding/comments/1bsjyek/having_problems_weaning_breastfed_baby/", "I'm wanting to wean my 10 month old from breast feeding. She won't take breast milk in a bottle (upright refuses bottle) and won't take it from a straw cup. She drinks water from a straw cup, so I've been trying formula instead of water and she's refusing the formula as well. My first was so easy to wean from the breast but my girl is a sassy unit hahah. Any tips tricks or advice!?    "]]