[["Does anyone else have issues with Smoothie King?", "20", "9", "2023-08-01T13:48:16.000000+0000", "https://www.reddit.com/r/glutenfree/comments/15fd4x1/does_anyone_else_have_issues_with_smoothie_king/", "I had a yogurt delite strawberry yesterday with protein and am paying hell for it today. Does smoothie king affect anyone else?    "], ["Has anyone actually had issues with potassium?", "19", "12", "2024-01-11T04:54:36.529000+0000", "https://www.reddit.com/r/Spironolactone/comments/193tfc3/has_anyone_actually_had_issues_with_potassium/", "I'm on 100mg, and because of the new year I've started to incorporate better foods into my diet. I'm trying to get more fiber in because I was having....issues....at the end of last year. My go to is raw veggies if I wanna snack on something. Carrots, cucumbers, bell peppers, with ranch or hummus, if I want something to snack on. Of course, those all have potassium. I'll also do a green smoothie with spinach, zucchini, and banana... All of these have potassium :( My doctor says he really doesn't worry about healthy people eating too much potassium...he just doesn't want me to take any supplements. But idk, I get nervous about it.    "], ["Wife is having trouble with biting her tongue after having 2 molars extracted, any advice? ", "5", "1", "2024-05-12T00:14:48.797000+0000", "https://www.reddit.com/r/askdentists/comments/1cpv3z1/wife_is_having_trouble_with_biting_her_tongue/", "Hello dentists of Reddit! My wife has been dealing with this for a week now. She got her two back molars extracted a week and a half ago. She was healing very smoothly and then she bit her tongue (the back/side) and has been in serious pain since then. She's having difficulty swallowing and eating anything, she's been eating smoothies for days now. When she talks, she said it lightly pinched her tongue, and she bites it when she chews. Anyone have advice on what to do to help? She went back to her oral surgeon and he basically said to come back in if it's still hurting in a few weeks.    "], ["Having trouble with food and the kid I'm babysitting", "25", "1", "2024-04-21T13:52:39.912000+0000", "https://www.reddit.com/r/AskParents/comments/1c9ieuq/having_trouble_with_food_and_the_kid_im/", "He's 7 and I watch him for 8-10 hours, 4x a week. She has no other family or friends to watch him and cannot afford traditional tutoring or daycare, so I'm  all she has. She drops him off at my place in the morning. On the days he's over I can't really leave home since he's a handful in public. I'm having issues keeping him fed. What she packs for him isn't exactly substantial. On most days she'll send him over with a pack of cheap instant noodles, a fruit cup or smoothie, and a few cookies. This is supposed to last him all day. He's a normal weight for his age and height but has a big appetite and can be a picky eater. I've brought this to his mother's attention twice already. He's also very used to the junk his mom buys or orders for him. My husband and I don't have kids and I'm a light eater, so it's not like we have a stash of kid-friendly frozen foods just lying around for him. I've had to cook for him a few times, but whether he'll eat what I make is another story. He won't eat any potato that isn't a french fry, most fruit, any other vegetables, soup, or meat that isn't a fried chicken nugget. Whenever I tell his mom that her son needs more food, she just throws in another second pack of instant ramen or some other nutritionally void junk that makes his ADHD worse. He's also a little sneaky. I once gave him a few chocolate chips as an incentive for doing his homework and now he snoops around the kitchen looking for them nearly every day. He also tries to make excuses to go into the bedroom (which he isn't allowed in because of his habit of taking things that aren't his) to look for snacks. Not food. Snacks. I know this is pretty normal kid behavior, but it's getting on my nerves. I tried to stock up for him before, but he goes through food so fast it's not feasible with what I'm being paid to care for him. A pack of nuggets he'll finish in 2 days is half of what she pays me, and that's just one item. My own family tells me to feed him only what his mother packs and nothing else until his mom, but I can't let him suffer because of his mom's failings. Do you guys have any advice on what I can say or do to solve this issue? Note: His mom doesn't cook, so meal prep on her days off is out of the question. I've been to their place. The shelves are only stocked with what she likes to eat, adult health supplements, and instant noodles. Like I said before, they only eat out most of the time.    "], ["Struggling with food post op", "1", "1", "2024-05-19T14:30:12.816000+0000", "https://www.reddit.com/r/gallbladders/comments/1cvpk33/struggling_with_food_post_op/", "Is anyone else still struggling post op with food? Had my lap Chol Monday and I am still only able to consume liquids, very soft foods (yay for smoothie maker) My actual surgery went smoothly but I did have a delayed reaction to anesthetic 48 hours after and had terrible migraines/sickness. Was pricribed sumatriptan and cyclizine which have helped with those symptoms. I have also had a few issues going to the toilet but have now been twice but not very much so I don't know if that's part of the issue. I'm not being sick anymore but even liguid/soft food leaves me extremely bloated and crampy after and I have no appetite at all. Have been having smoothies the last 2 days to make sure I'm getting as much nutrients as possible but again they leave me so painful. Smoothies are mostly free from milkshake and fruit (although did add soaked chia seeds today) My Dr doesn't seemed to bothered and said just take it slow but I see so many people posting that they've gone straight back into eating normally. Will also state I do have a hiatal hernia and suffer with IBS.    "], ["Iâ\u0080\u0099m struggling with maintenance in winter.", "53", "10", "2023-11-25T07:30:45.190000+0000", "https://www.reddit.com/r/keto/comments/183eeqd/im_struggling_with_maintenance_in_winter/", "I'm freezing, I'm tired, I've no motivation or energy, can't sleep. I  can't seem to figure out how to do my meals since the winter came because the summer go to which was a huge salad with cheese and eggs is too cold. I feel miserable. I've switched up to a peanut butter / almond milk / spinach smoothie mid morning followed by scrambled eggs then nuts for lunch , then a dinner of meat/ fish and veg but I can't stop feeling cold and I feel miserable.  I don't crave cake or anything but I crash on a few crackers and Kerrygold mid afternoon. What am I doing wrong, I felt like a million bucks when I was losing weight and during the summer!  Doing this diet for NASH reasons not weight loss but it didn't hurt.  Got bloods etc done last week so should have results back.  It's 7am it's zero degrees and I'm freezing under a huge duvet. Help I need to feel like I did in the summer.  Bouncy !    "], ["Iâ\u0080\u0099m really struggling with eating right now?", "19", "2", "2023-12-15T19:48:56.833000+0000", "https://www.reddit.com/r/jawsurgery/comments/18j8kfn/im_really_struggling_with_eating_right_now/", "It's really hard for me eating right now. I've been just basically drinking fruit smoothies with Greek yogurt. I'm on day 3 of recovery, this is just very bad right now.    "], ["Struggling with food", "1", "4", "2024-03-10T19:49:31.816000+0000", "https://www.reddit.com/r/adhdwomen/comments/1bbj6qu/struggling_with_food/", "Good morning ladies ð\u009f\u0092\u0095 since being on adhd medication iv struggled with food, The whole aspect of it. Iv lost my appetite I struggle to come up with recipes from the loss of appetite. I'm not eating enough which is resulting in me feeling weird. I have my morning smoothie in the morning and struggle for the rest of the day and snack on crap food because I can't bring myself to eat a proper meal. Any suggestions on how to deal with this? I'm always working out at the gym so need need my protein but just can't for the life of me get it together    "], ["Struggling with food ", "2", "2", "2024-06-04T11:43:47.242000+0000", "https://www.reddit.com/r/adhdwomen/comments/1d7v2yu/struggling_with_food/", "I am having such a hard time eating enough. When I started my first ADHD med, it would make me so nauseous that I couldn't eat. Six months into this journey, on a different medication for about three months, I don't find I'm nauseous but I just stop half way through a meal not wanting anymore. Like my body says, nope were done with that. Just now trying to eat my breakfast, I had a massive gag reflex kick in. This is a newer thing that's been happening a bit. I'm so tired of it. I was thin to begin with and now even more so. And to make it feel more disheartening, my goals over the last year and a half were to build muscle mass with weight lifting. I feel like I don't eat enough to have the energy to workout how I'd like to and I'm not consuming enough to make those muscle gains. So it doubly sucks. Other than making protein shakes and smoothies, what are some things that have helped you eat enough?    "], ["Iâ\u0080\u0099m struggling with weed and It feels like it controls my life.", "16", "0", "2024-02-07T23:10:53.509000+0000", "https://www.reddit.com/r/Advice/comments/1algo48/im_struggling_with_weed_and_it_feels_like_it/", "I'm a 21M and I have smoked weed consistently now for the best part of 5 years and at first it was great it really did provide an escape and at the time it served a purpose but I've found myself lately feeling my lowest lows and it's when I'm smoking more then I ever did. And I finally really want to quit but I still can't quite do it yet. can anyone provide any useful tips or just anything to help me I've looked at all the normal stuff like cold showers and saunas and having a detox smoothie but is there something I'm missing any help is greatly appreciated.    "], ["struggling with meal time", "5", "3", "2024-02-13T20:57:10.821000+0000", "https://www.reddit.com/r/NewDads/comments/1aq4bn4/struggling_with_meal_time/", "Our 10 mo absolutely hates meal time and it's becoming traumatic. Meals regularly take up to an hour and include multiple sessions of shrieking and sobbing. The easiest meal of the day is breakfast because who doesn't like banana and strawberry-yogurt smoothie. But after that, it's torture. Somedays he likes steamed apples, some days he hates them. He might take two bites of a puree before twisting away like its poison. He's also not doing a lot of self-feeding. He'll pick up pieces of banana, avocado, and steamed carrots and eat them on his own (sometimes), but everything else we have feed him either by hand or by spoon. We don't know what else to try and of course whenever my wife asks her friends, they're all like \"Really?! That's so strange. Our baby loved meal time!\" So she's kind of losing it at this point and I'm not far behind her.    "], ["Struggling with eating", "1", "1", "2023-09-07T16:09:22.803000+0000", "https://www.reddit.com/r/Anxiety/comments/16cjsqm/struggling_with_eating/", "When you lose your appetite, how do you get past it and actually eat? When even making a simple smoothie seems overwhelming and unappealing because the anxiety is kicking off.    "], ["Been struggling with the worst internal hemmorhoids you can imagine for the past 3 years.", "34", "10", "2024-01-21T22:26:44.761000+0000", "https://www.reddit.com/r/hemorrhoid/comments/19cfqf2/been_struggling_with_the_worst_internal/", "Have had 11 banding ligation to remove internals. The pain from that puts me out for 2 days but gives like 2 weeks of relief. Eventually comes back. Pain, hard to pass stools, bleeding, fissures. Diet is now all vegatables, smoothies, laxatives and lots of water and i fast reguarly in the mornings putting me to 2 meals a day. I take sift baths after shits to relieve pain for 20mins. I use ice packs on my ass before i shit if i can to reduce the blood swelling down there I dont sit ever. I exercise with walking every other day for 1 hour. My bmi is not bad. 5\"10, 180lbs. Fairly active. Im only taking a shit for max 1 or 2 minutes. Lost 20 lbs, frankly im scared to eat food or take a shit always. I'm also worried about developing colon cancer. Colonscopy said I'm good though.  Ultrasound came back fine too. I have lost my job (software engineer) because of it and my joy of life. Everyday its the same thing and i cant bare the pain daily. I live in Canada btw Is there a way out of this problem or is suicide the only thing left for me.    "], ["20F struggling with health issues is this a good meal plan?", "26", "4", "2024-04-20T04:24:11.553000+0000", "https://www.reddit.com/r/AnimalBased/comments/1c8h3kp/20f_struggling_with_health_issues_is_this_a_good/", "Hi! To preface this I struggle with thyroid issues / Dysautonomia / Gut issues / Anxiety and I had been plant-based for years which made me severely anemic as I can't digest vegan iron rich foods.  I then gave up and switched back to a SAD (I'm a sugar / bread fiend) which turned to bingeing due to lack of nutrition and having little to no muscle mass. I'm a 20 year old female, 5'3 and 115lbs and I found this sub as my sister started following animal-based diet for her PCOS and suggested I give it a go.  I just bought a bunch of groceries and I'm wondering if this is a good start Breakfast:  3 scrambled eggs with sea salt, half an avocado and a banana + black decaf coffee Lunch:  I don't really eat lunch (never have) but I'll eat a snack so 1 naval orange, beef stick and turmeric ginger beef bone broth Dinner: organic turkey burgers or beef patties, other half of avocado OR butter, and berries (strawberries, blueberries, etc) Snack (I always get a little hungry at 9:30):  frozen mango with cinnamon or smoothie with coconut milk, cacao powder, and dark cherries Is this too much fruit? I feel like since I've cut out sugar and processed foods on Monday (it's now Friday)  I've been feeling fatigued, a little sick, lots of flatulence and bowel changes. Is this probably because I went completely cold turkey and fully transitioned? I also started working out after not exercising for 3 months.  My exercise is Pilates and 10k walks. I'm confused a bit about the low carb / high fat or high fat / low carb thing as I usually eat 3-4 servings of fruit which is my 90-100g carbs and a whole avocado since it fills me up Any suggestions or feedback? Again sorry if this is a dumb question I'm on the spectrum so I just want to make sure I'm doing things right in terms of following this    "], ["need help with smoothie proportions", "7", "8", "2024-02-11T22:46:43.062000+0000", "https://www.reddit.com/r/EatCheapAndHealthy/comments/1aokvqs/need_help_with_smoothie_proportions/", "i'm making a smoothie with the following ingredients. what measurements/proportions should i do for each ingredient? -supergreens mix -fresh orange juice -honey -frozen blueberries -frozen strawberries -milk Update: I decided to do proportions vibe based and it was tasty. Just wanted a way to measure calories, macros and such. Cheers!    "], ["Need help figuring out ingredient portions for smoothie prepping.", "6", "1", "2024-03-14T10:49:15.788000+0000", "https://www.reddit.com/r/Smoothies/comments/1beidcp/need_help_figuring_out_ingredient_portions_for/", "I haven't made smoothies in a long time. I used to kinda wing it and they were ok. Not super tasty but good enough they they were fine. I like to make enough to put into cups I can put in the freezer so I can just pull them out each day instead of making a new one every day. But I want to do it right and try and get a tasty smoothie this time. So hopefully y'all can give a general ratio for ingredient type? Like oh you need 1 cup fruits and 2 cups liquid etc. That way if I want to make more I can just double/triple it etc. I feel like it'll help to list my ingredients? I like to try different fruit combos each time. Typically each smoothie will have: 2-3 different frozen fruits Coconut oil Greek yogurt Soy milk Frozen kale Frozen bananas Frozen avocado Chia seeds Ground flax seed Dry oatmeal flakes Powder (acai, fancy green vegetable powder etc) How would you ratio these together?    "], ["Need help with my smoothie recipes!", "8", "5", "2023-06-30T16:17:41.525000+0000", "https://www.reddit.com/r/Smoothies/comments/14n4tpk/need_help_with_my_smoothie_recipes/", "Love the subreddit and have been using it as inspiration for my journey this year. I've hit a point where I need more protein and fiber in my diet, so I've started replacing my normal breakfast with a homemade smoothie. Here are the two that I make: Oats - 1/4 cup - 75 cal Protein Pow. - 1 scoop - 75 cal Super Seeds - 1 Tbsp - 50 cal Spinach - handful - 6.5 cal Almond Milk - 1 cup - 30 cal Peanut Butter - 1 Tbsp - 95 cal Banana - 1 - 105 cal Ice - 2 cup crushed Oats - 1/4 cup - 75 cal Protein Pow. - 1 scoop - 75 cal Super Seeds - 1 Tbsp - 50 cal Berries - 2 1/2 cups - 180 cal Spinach - handful - 6.5 cal Almond Milk - 1 cup - 30 cal Ice - 2 cup crushed So far, they taste great and are pretty filling, but I wanted to see if there was anyone here more experienced with any tips to improve them. They're pretty thick and I haven't been able to thin them out without losing ingredients. These recipes are usually split between me and my wife, so I guess (2) 20 oz servings. I appreciate any help!    "], ["Need help improving operations (acai bowls and smoothies)", "13", "4", "2023-07-21T21:34:49.553000+0000", "https://www.reddit.com/r/restaurateur/comments/1560yj2/need_help_improving_operations_acai_bowls_and/", "I run a small juice bar which sells acai bowls, smoothies, juices and coffees. I acquired this tiny restaurant back in March, and smoothies have always been the best seller. As of late, our Acai bowls have been popping off. Coffees and juices don't really make me as much money. I've been finding - especially since we've seen increased demand over this summer - that we lose a lot of sales to prolonged wait times (on top of the poor experience of customers who order and wait ages to get what they paid for). Can anybody point me to some resources to help educate myself on this? Books, articles, blogs, videos, youtube channels - anything would help, really. I'm even struggling to keep the opening & closing procedures reasonably short; it takes ages to clean and close properly nowadays. Any input would be greatly appreciated!    "], ["Need help with simple smoothie recipes for a beginner in the nutrition department", "9", "12", "2023-06-10T17:14:12.387000+0000", "https://www.reddit.com/r/Healthy_Recipes/comments/1465msj/need_help_with_simple_smoothie_recipes_for_a/", "Hi everyone.. I'm looking for some advice for some simple smoothie Recipes being that I don't know a damn thing about nutrition and or healthy foods.. I would like to also hear about some powders that are affordable and good tasting to ad to them for more benefits.. I'm a pretty big baby when it comes taste so anything that's not unpleasant please lol and things that will help out alot with energy that's also affordable too please. I'm a 32 year old female whose diet has been ATROCIOUS consisting of pure sugar for a long time and the effects are wreaking havoc on my life since im really feeling VERY foggy, unfocused, sluggish, fatigue, lethargic and having spurts of nausea almost every other day. I need a change immediately. Thanks everyone.    "], ["Ok so only now did I start making smoothies but holy shit they are amazing! Need help though!", "14", "6", "2023-06-27T20:43:42.643000+0000", "https://www.reddit.com/r/Smoothies/comments/14koxdj/ok_so_only_now_did_i_start_making_smoothies_but/", "I only had smoothies as a treat but now I think I'll make it a staple in my diet! It's like a meal in drink form! I woke up late this morning and made myself a smoothie. It was lettuce, milk, berries, some mango, and almond milk with vanilla. Then I decided to make another a few hours later. This one was the best by far. I used berries, lettuce, mango, banana, oatmeal, a scoop of peanut butter, and some milk. And holy shit it is super good and it'll be a big help in a boost for kickboxing! So I need some help here. Anyone got any good recipes that are affordable but healthy and stuff? Or any smoothie tips? I'm open for whatever. Thanks!    "], ["i need help finding a vanilla protein powder PLEASE", "63", "13", "2023-09-18T18:49:46.225000+0000", "https://www.reddit.com/r/fitmeals/comments/16m3rn5/i_need_help_finding_a_vanilla_protein_powder/", "i tried the vital proteins collagen peptides but i can't stand the taste of it in my smoothie. the â\u0080\u009cunflavoredâ\u0080\u009d flavor is overpowering, even with banana and vanilla extract and splenda in it. i don't want to painfully down the smoothie with my nose plugged. i want to enjoy my protein smoothies. i have sensory issues and problems with that. if someone could just give me their recommendations for a good vanilla protein powder, that would be awesome. thank you!    "], ["Need help with breakfast.", "29", "3", "2024-02-13T16:02:23.839000+0000", "https://www.reddit.com/r/Noom/comments/1apwxrz/need_help_with_breakfast/", "Hi! I am new to Noom, so I am still figuring out the colour code system. I don't usually have much time in the morning for breakfast so a fruit smoothie works best for me. I prepare it the night before so I can just grab it in the morning and go. I vary the type of frozen fruits I use; I add fibre and chia seeds, almond milk and water. I use an 800ml bottle. According to Noom, this is an orange food, and it gives it 433 calories. Which puts me 133 calories over my limit. Not a very good way to start the day! Do you have any suggestions on what I can do? how can I replace or make a lower cal smoothie?    "], ["Need Help with nutritional smoothie recipes that are simple, affordable and easy to make for someone whose got no idea on eating healthy", "5", "2", "2023-06-10T19:22:23.694000+0000", "https://www.reddit.com/r/healthyeating/comments/1468og8/need_help_with_nutritional_smoothie_recipes_that/", "Hi everyone.. I'm looking for some advice for some simple smoothie Recipes being that I don't know a damn thing about nutrition and or healthy foods.. I would like to also hear about some powders that are affordable and good tasting to ad to them for more health benefits.. I'm a pretty big baby when it comes taste so anything that's not unpleasant please lol and things that will help out alot with ENERGY that's also affordable too please. I'm a 32 year old female whose diet has been ATROCIOUS consisting of pure sugar for a long time and the effects are wreaking havoc on my life. im really feeling VERY foggy, unfocused, sluggish, fatigue, lethargic and having spurts of nausea almost every other day. I need a change immediately. Thanks everyone.    "], ["I need urgent help for my routine!", "1", "1", "2024-02-27T02:58:00.206000+0000", "https://www.reddit.com/r/curlyhair/comments/1b113dh/i_need_urgent_help_for_my_routine/", "Guys look heres my routine, i wake up shower (not a shampoo day) i condition my hair, apply shea moisture curling smoothie, and camille rose spiked honey mousse and finally Dillon lathams strong hold clay, i do this every 2 days, my question is since this is a new routine i made literally just today do you guys think i can wash all the products out just with water after the second day?    "], ["ASVAB help for struggling learner?", "7", "1", "2023-09-25T01:39:27.373000+0000", "https://www.reddit.com/r/AirForceRecruits/comments/16rf100/asvab_help_for_struggling_learner/", "Any help pls for asvab So I'm a prior service Marine going into the army soon. My fiancÃ© is planning on joining the Air Force as it's been a dream of hers for a while. Problem is she can't pass the asvab. Now I've been working with her to break down problems and understand how to solve them without stressing. She has adhd but has been of meds for a bit and her recruiter is working with her to get a waiver. My concern is her ability to process math primarily or test taking. I've seen her at work and even worked with her before, she's completely functional. She's a secretary for a construction company rn which includes a ton of paperwork and documentation. None of which she struggles with. It's seems to be just test taking and general academics in question form. It took her about ten minutes to solve this word problem with me breaking it down to simple numbers and addition for her: A smoothie costs $3.50 on weekdays and $4 on weekends. If a guy buys a smoothie everyday everyday except Saturday how much did he spend that week? Aka 3.50x5+4 I had to break down 3.50 + 3.50 for her but she didn't know what that was so we had to go to 3+3+3+3+3 and and the same for the 5 days of the .50 and then add the 2 together to get $17.50 then add $4 the for the Sunday to get the answer $21.50. I'm not trying to be rude but that problem took me like 20 seconds and I was a c average in high school. Anyone deal with a situation and was able to help them learn how to learn? I know each person is different and you just gotta find what works which is what I'm trying to do but idk what will work. And I don't want her to get hurt by failing and think she's stupid cause I know she isn't.    "], ["product help for textured fringe hairstyle", "0", "1", "2023-08-19T11:08:07.398000+0000", "https://www.reddit.com/r/Wavyhair/comments/15vddq4/product_help_for_textured_fringe_hairstyle/", "I am trying to bring out my natural waves as a guy with 4-5 inches of hair should i use the shea moisture  curl and shine conditioner with either A) shea moisture curl enhancing smoothie or B) sea salt spray. Open to any advice i have 2a hair maybe 2b only when its wet though (dries straight/wavy)    "], ["Teething pain help for high needs baby", "10", "2", "2023-09-12T16:25:57.288000+0000", "https://www.reddit.com/r/beyondthebump/comments/16gvu0s/teething_pain_help_for_high_needs_baby/", "Okay like HOW do you do this? She's 14 months old and seems to be getting her first molar. And she's already incredibly intense with her feelings, so you can imagine that this might possibly be the end of the world for her. What do you do to help with the pain, besides pain medication (we already tried this in safe dosages)? We try distractions like walks and outside play time, but man she is tough as soon as we step back inside. She doesn't really want to eat anything hard, so we're making smoothies and lots of soft fruits/veggies and stews. Is there anything else that has gotten you through this? I know we've got a lot more molars ahead of us!    "], ["Help for my girlfriend", "1", "1", "2024-01-08T23:48:38.593000+0000", "https://www.reddit.com/r/EatingDisorders/comments/19201bl/help_for_my_girlfriend/", "So my girlfriend has recently told me abt her issues with eds since she has become very sick. So we're both around sophomore age so we have limited access to anything She had a really bad experience with and ed in 7th grade and had to go to the hospital a few times. Over winter break her mental health got really bad and she started starving herself again. She used to follow the pro Ana goddess thing when she was younger and I worry she subconsciously did it. She ate for a few days when school was back but now whenever she smells food or eats it she throws up. She's been terribly sick like her whole body hurting, feeling like passing out. She says this has happened before and it just leads to the Ed but she has no idea how to stop it. She has a therapist but an very abusive mother that cannot know the details. She struggled even opening up to me about it. She takes Zoloft and has an anxiety medicine but I'm not sure how much it'll help I just need to find out how to make her eat. I doordashed her a smoothie the other day. But I can't keep doing that. How do I make her eat?she can't go back to how she was    "], ["Help for a starving Anole?", "3", "5", "2023-09-10T23:27:19.700000+0000", "https://www.reddit.com/r/Lizards/comments/16ffc1k/help_for_a_starving_anole/", "Hey friends! I care primarily for tarantulas so please go easy on me here - My friend owns a plant shop and on one of her imports a little Cuban knight anole tagged along. She didn't find him in the shop until a few days after the shipment came in and she contacted me looking for some help. I have extra ten gallon tanks, heat lights, crickets etc because of my T's so I took him off her hands. He's still quite small (maybe 5 inches?) but he's VERY skinny. He won't eat crickets, so I blended some fruit (mango and berries) into a smoothie texture for him and he took some from a syringe. He's also drinking water. Currently have him in humidity and under a heat lamp - what else can I do to get his weight and protein intake up? Any help is appreciated :)    "], ["Help with smoothie", "7", "1", "2024-04-04T15:41:14.073000+0000", "https://www.reddit.com/r/sugarfree/comments/1bvqeng/help_with_smoothie/", "Hey guys, I have been trying to cut out sugar because I'm pre diabetic and I am also hoping it will help with acne and period cramps. I have recently been drinking a smoothie everyday because none of the ingredients I add have any added sugar so I thought it was good but after reading things online I'm not so sure. What do you guys think of this smoothie: 2 big bananas 2 big scoops of peanut butter Almond Milk 2 scoops of Collagen Powder I blend them them well    "], ["Help with a Breakfast Smoothie Recipe", "7", "1", "2023-10-23T18:10:37.712000+0000", "https://www.reddit.com/r/Cooking/comments/17eqxt3/help_with_a_breakfast_smoothie_recipe/", "There was a place I used to get these amazing breakfast smoothies that I swear I could've had every single day and never gotten tired of, but unfortunately the store closed. The good news is that before that happened, I carefully watched them make it and noted all of the ingredients. The bad news is that, despite numerous efforts, I can't seem to recreate it at home. I'm currently using steel cut oatmeal (which I cook earlier & cool in the fridge), almond milk, frozen strawberries, fresh banana, peanut butter, and cinnamon. I don't add any ice. I've played with the proportions, but it never tastes as good as I remember.  I think they used Soy milk instead of Almond, can't remember if they added a tiny bit of ice, and know they added a little powdered protein, but don't know how much any of those really impact the taste. Does anyone have any advice? Edit: Ideally, I'd really appreciate amounts or at least proportions if possible.    "], ["Help with smoothie recs", "4", "3", "2023-08-31T19:04:47.360000+0000", "https://www.reddit.com/r/Smoothies/comments/166jut8/help_with_smoothie_recs/", "I'm someone who really struggles with eating fruits and veggies because of my ASD, I involuntarily gag because of the texture and taste and I just can't stomach fruits and veggies beyond applesauce and raisins, but I'm trying to get better so I wanted to ask if anyone can recommend store bought smoothies that 1) don't have a lot of added sugars 2) are SMOOTH ( like no seeds or chunks or anything like that 3) no bananas. I just straight up hate bananas.    "], ["Help with smoothies", "5", "1", "2023-08-08T19:22:12.212000+0000", "https://www.reddit.com/r/Cooking/comments/15lrm1y/help_with_smoothies/", "What are some good things to put in smoothies as well as some good liquids? Almond milk, orange juice? Etc.    "], ["anyone know good smoothies or shakes to drink that help with weight gain?", "19", "1", "2023-08-30T11:07:12.367000+0000", "https://www.reddit.com/r/GERD/comments/165bmyf/anyone_know_good_smoothies_or_shakes_to_drink/", "Preferably should be prepackaged ones such as Ensure. Ive been drinking ensure after someone on here recommended it to me but it seems like its been causing me harm instead of Good and i flare up for it. what are some good substitutes that I can use instead of Ensure which clearly gives me trouble    "], ["Help with trying to eat healthier - mostly smoothies/drinks", "10", "5", "2023-06-27T13:07:36.235000+0000", "https://www.reddit.com/r/HealthyFood/comments/14kdbhw/help_with_trying_to_eat_healthier_mostly/", "Hey folks, i have long ate like shit and I want to be healthier. I am absolutely horrible about flavors/textures, as such I know its truly a long shot to find something that works well for me but the only way ill know is if I ask and try. Fruit I will eat:   Apples   seriously that's all   Vegetables:   Bell peppers   Onions   Broccoli   Cauliflower   Peas   Corn   Potatoes   Cucumbers   Tomatos (i like them well enough for salad/pizza but ive never been a fan of V8 etc)   When it comes to artificial flavors I like fake cherry as jolly rancher/starburst, same for orange and lemon. I like strawberry poptarts but i know that is a super fake flavor as I hate strawberry flavors in many other things. I know what I'm asking is a tall order but if someone knows any solid recipes I can use to make basically a meal replacement with some chocolate/peanut butter (protein) powder that would be healthier i would greatly appreciate it. You have my utmost thanks for any and all help provided.    "], ["Help with big mom pls", "33", "0", "2023-12-08T23:27:53.526000+0000", "https://www.reddit.com/r/GroundedGame/comments/18dzrir/help_with_big_mom_pls/", "Big mom spider tips I some of the base smoothies, some healing smoothies, some rage smoothies, some energy smoothies.    "]]