[["I have a problem with soccer.", "24", "18", "2024-06-13T10:06:16.248000+0000", "https://www.reddit.com/r/bootroom/comments/1deveqd/i_have_a_problem_with_soccer/", "I live in an area where a lot of people have family that are soccer fans and were practically born with cleats and a ball on their feet. Unlike them, my family has never been into soccer and I myself have never had the chance to play soccer in my youth but now I would say I am as encapsulated in this game as much as the people around me. I have been playing soccer for maybe a year or two and watching for much longer. I play in a rec league and the match becomes the focus of my day up until to the point where the game begins and I make mistakes here and there and my teammates start criticizing me on my skill and I become a laughingstock. I usually try to laugh along but it really hurts my confidence as I have tried to and  taught that I improved a lot from my beginnings. This is even worse for conditioning for tryouts of a competitive team where my friend who is already in the team interacts with his teammates I feel the judgement from everyone there and I just feel so out of place and I come home and tell to myself that I don't want to do this anymore. The next day I start watching a game on TV and I just get so engulfed in the soccer that I kinda forget about everything and push all those insecurities aside until I start playing again. Here is my biggest problem. I know what I have to do which is practice and I plan and think what I will practice and the next day I just start to get something that feels like imposter syndrome where I feel like if I go to the field and start practicing and voices in my head start saying that people think that I am hopeless and not even practice will save me and that I am cursed to stay at this level. So I just don't practice or procrastinate leaving for the next day. I know that I should just not pay attention and keep my head down and work hard but what I am thinking logically is very different to what I keep feeling and I am just not able to change this feeling. I want to play soccer and improve because this game is one of the greatest passions of my life. Please if you have any advice I will take it. This was very long so if you even read it, thank you for doing so even if you don't have any advice it feels better getting it off my chest.    "], ["There is no major problem with parity in European soccer.", "24", "0", "2024-03-07T08:04:43.753000+0000", "https://www.reddit.com/r/unpopularopinion/comments/1b8p8dn/there_is_no_major_problem_with_parity_in_european/", "To be honest, European soccer is not that different from American sports in terms of parity. . The winner of the Champions League final is the true winner The winning team in the 21st century is . MLB 16 teams (Yankees, Red Sox, St. Louis. Texas, White Sox, Cubs, Dodgers, Washington, Houston, San Francisco, Kansas City, Angels, Arizona, Philadelphia.atlanta. Marlins NFL 12 teams (New England. Pittsburgh. Tampa Bay. Kansas City. New York Giants. Baltimore. Denver. Seattle. Green Bay. New Orleans. Indiana. La Rams NHL 12 teams New Jersey, Tampa Bay, Boston, Las Vegas, Carolina, Pittsburgh, Chicago, Anaheim, LA Kings, St. Louis, Washington, Colorado NBA 11 teams. Lakers.Warriors.Celtics.Miami.SanAntonio.Detroit.Toronto.Cleveland.Dallas.denver.bucks European soccer 10 teams Real, Bayern, Barcelona. Chelsea, Liverpool, Man c .  man u, AC Milan, Inter, Porto Of course, the Champions League final and Super Bowl are one-off games. Rather, different teams have won the Champions League over the past five years. (Liverpool Munich Chelsea Real Man City) The Chiefs have made it to the Super Bowl four times in five years. Won 3 times.    "], ["Whatâ\u0080\u0099s everyoneâ\u0080\u0099s problem with handling out participation trophies?", "358", "66", "2023-11-14T14:14:21.193000+0000", "https://www.reddit.com/r/Millennials/comments/17v33o8/whats_everyones_problem_with_handling_out/", "I could be wrong, but I believe participation trophies were another way of saying, â\u0080\u009cThanks for participatingâ\u0080\u009d, instead of doing nothing or sitting in your room playing video games. It's really not that different from saying, â\u0080\u009cgood gameâ\u0080\u009dor shaking hands. Isn't welfare, unemployment insurance, and/or basic income subsidies just another form of a participation trophy? Shouldn't kids be rewarded for trying? Is 2nd place really 1st loser? Reddit karma is really just a participation trophy. Participation Medals are given to all athletes and officials who participate in the Olympics. These medals have been a part of the games since the first modern Olympics in 1896 and continue to this day.    "], ["Another article circling the problem with no solutions.", "46", "20", "2023-11-10T16:42:50.856000+0000", "https://www.reddit.com/r/Referees/comments/17s81i5/another_article_circling_the_problem_with_no/", "https://sports.yahoo.com/soccer-has-a-refereeing-epidemic--just-not-the-one-you-think-225117561.html     "], ["Can pop Tibia(?) out at will without pain. Recently started hurting a bit and had a problem with knees, any ideas?", "1", "1", "2024-06-25T23:31:08.966000+0000", "https://www.reddit.com/r/AskDocs/comments/1dok62f/can_pop_tibia_out_at_will_without_pain_recently/", "I (18f, 5'6 155lbs, not taking any meds and not drinking or smoking) have always been able to move the bone in my leg that connects to the knee joint (the tibia I think) when I cross my legs or just one leg so that inside of my legs point upwards. You can see it, and can feel it. I also used to be able to pop something (I have no idea what and Im not sure if I want to know) out from inside my knee. Although I can't anymore.) I've always have genetically bad joints, (hyper extension in my elbows, and knees, and partially dislocating my shoulder only for it to pop back in by itself.) Recently, I went to go sit on my knees after doing a plank. As I went to sit down it felt like my lower leg caught on something inside my knee. I felt a popping sensation and a lot of pain but it quickly went away so I continued what I was doing only for it to happen a second time. I do soccer and go to the gym, so I've always been in pretty good shape. And the soccer season ended less than a month ago so it wouldn't be from not using it a lot. Any ideas?    "], ["The Problem With Club Drop-Ins", "22", "10", "2023-10-13T10:45:48.030000+0000", "https://www.reddit.com/r/EASportsFC/comments/176vvsk/the_problem_with_club_dropins/", "And clubs in generally, I notice this when playing with my friends even when I tell them to just breath and scan the field sometimes. Everyone is obsessed with being THE guy or HIM or whatever. Everyone wants to be the one to score, even if it means taking a 1 in a million shot with 3 defenders in front of you in the top corner of the penalty box lol instead of just passing like any actual footballer/teammate would do. Even if it means sprinting right into a defender everytime you get the ball. Even if it means spamming A when you're covered/offside and making the team lose the ball over and over again. I just dont get it. Do FIFA players actually WATCH football/soccer? Or do they just wack it to Haaland and Mbappe highlights and just want to emulate that all day? If so, play seasons on semi-pro, you're not good enough.    "], ["Problem with screen on ios", "4", "2", "2023-08-20T09:50:10.600000+0000", "https://www.reddit.com/r/headsoccer/comments/15w792b/problem_with_screen_on_ios/", "Hello friends, i just download on my new ios phone head soccer but there is a problem with screen. The places of buttons are wrong. How can i fix this? Thanks.    "], ["Long term problems with Stickman soccer 2018", "6", "0", "2024-05-06T15:41:45.667000+0000", "https://www.reddit.com/r/AndroidGaming/comments/1clm6iq/long_term_problems_with_stickman_soccer_2018/", "Why I cant login to the older account via facebook there and why market with players isnt available? (I tried both ways- installing via app store and other page too but still doesnt work). Im also angry on djinnworks company, cos developers ignoring my messages for months    "], ["Anyone else having problems with the goalie not moving sometimes on World Cup soccer? ", "8", "2", "2024-06-16T21:57:10.638000+0000", "https://www.reddit.com/r/PinballFX3/comments/1dhifl6/anyone_else_having_problems_with_the_goalie_not/", "it's so annoying when in a crucial situation, especially during multiball!    "], ["Anyone else having a MAJOR issue with Flies over the last month?", "63", "157", "2024-06-19T18:15:34.873000+0000", "https://www.reddit.com/r/houston/comments/1djpzbg/anyone_else_having_a_major_issue_with_flies_over/", "It seems like over the last 4-8 weeks, we've have had an exponential increase in flies, at least in my area of the Heights.  I am going through a fly catcher bag every 3-4 days, there's at least 100 dead ones in each bag, and today when I went outside there were at least half a dozen sitting on a soccer ball in the yard. The only change I can think of is the amount of rain since Derecho, but I don't remember so many flies showing up after previous storms.   No trash/garbage left out or livestock in the area, nothing dead/decomposing...It's to the point where I can't sit outside with a drink without 4-5 flies constantly trying to land in it. Are y'all experiencing the same thing?  What else can I be doing to combat this?  I'm always hesitant to just fog with Talstar because that'll kill all the bees and butterflies too.    "], ["Issue with neighour kids hitting vehicles with balls", "66", "37", "2024-03-24T02:06:05.607000+0000", "https://www.reddit.com/r/homeowners/comments/1bm9lq8/issue_with_neighour_kids_hitting_vehicles_with/", "What can I do about my neighbour's?? Their driveway is across the street directly across from ours. Their kids play soccer, hockey, and have a basket ball  net set up on the street (not their driveway) that faces our driveway. In the last year we have talked to their parents in person, via text and over the phone asking them to talk to their kids and tell them to stop coming up our driveway as their balls are hitting the cars and the house, we have over 40+ videos of them on our property playing and hitting the cars. Will the police do anything about this??    "], ["Picture quality issues with soccer", "19", "4", "2024-03-21T23:09:59.767000+0000", "https://www.reddit.com/r/ParamountPlus/comments/1bkkhdo/picture_quality_issues_with_soccer/", "Signed up to watch the men's national team today vs. Jamaica. Looks like 30 frames feed, it's blurry with motion, and is screwing with my eyes. Is this normal???    "], ["Issues with Woodcroft Club?", "44", "22", "2023-10-11T23:50:23.160000+0000", "https://www.reddit.com/r/bullcity/comments/175sq4o/issues_with_woodcroft_club/", "As a member of Woodcroft for several years now, I've noticed some ongoing maintenance issues as well as the removal of several impactful programs. The owners decided to get rid of tennis, pickleball, soccer, and multiple summer camp programs. My kiddos were loving the tennis programs there, so I'm considering taking our family elsewhere, even tho Woodcroft is so close. The state of the facilities is concerning, especially considering how important these are for members and the durham community at large. Also, I've heard some murmurs about the management or ownership not being up to par. Has anyone else observed this or had similar experiences? If so, can you shed some light on what might be going on? Are there specific issues with the owners or management that the community should be aware of?    "], ["Issues with strip, square etc", "1", "2", "2024-04-28T05:00:20.152000+0000", "https://www.reddit.com/r/smallbusiness/comments/1ceybj7/issues_with_strip_square_etc/", "How come there are online businesses selling fake soccer jerseys and tracksuits and when I inspected their website they use payment accepting programs like stripe, square etc but if my friend tries to do the same his account gets locked after 1 sale? Could someone give us good recommendations of payment processors which aren't as strict. (We are located in Australia btw) Edit: The business which has been running consistently without issues using stripe is: KitKartel.com     "], ["Paint issues with 2023 SR5 (Ice Cap) ", "3", "0", "2024-06-26T18:32:31.739000+0000", "https://www.reddit.com/r/4Runner/comments/1dp5v9f/paint_issues_with_2023_sr5_ice_cap/", "Has anyone had issues with their paint job on the plastic portions (bumpers, wheel well flairs, etc) of their 4Runners? I got a 2023 SR5 in Ice Cap white last year and the issue first started when I have my grille wrapped in matte black 3M wrap. The installer told me that a portion of the paint peeled off when he went to take the wrap off and reposition. He went through the effort of completely repainting the grille/bumper before finally rewrapping. That was issue #1. Issue #2 was when my 6 year-old was putting his soccer cleats on in the trunk and grazed the bumper, chipping a piece of the paint off, exposing the black plastic. If I run my finger over it, it doesn't feel like the layer of paint is thick AT ALL. Issue #5 is paint flaking from the edge of the rear passenger door trim (guard?). I know that it hasn't been hit into another car, but the paint seems to chip more and more as time passes. Just curious if anyone else has dealt with this, or if it has been already documented. I also don't know what to do. Is this something I can bring to the dealerships attention? Will they fix it? Thanks, and love this community!    "], ["Trouble with participating in soccer", "10", "7", "2023-10-22T01:10:04.809000+0000", "https://www.reddit.com/r/Preschoolers/comments/17dhjyg/trouble_with_participating_in_soccer/", "We signed up our 4 year old for soccer this fall. He's participated in more informal, introductory programs in the past, but this is his first real soccer team with games against other teams. We are struggling with his confidence and resilience. The second he doesn't get the ball or the other team takes possession he cries and walks off the field. He'll go back out several times but always ends the same way. I've noticed he's the youngest on his team, the others are in kindergarten and have older siblings who also play. My guy just does not have the same experience and emotional maturity, and we just don't know how to support him. We try to be supportive and not put too much pressure on him. Any insight/advice?    "], ["14-Year-Old Struggling with Soccer Tryouts: Can't Run 2 Miles, Rib Pain. Tips?", "5", "3", "2023-08-03T00:02:25.829000+0000", "https://www.reddit.com/r/nikerunclub/comments/15gocpj/14yearold_struggling_with_soccer_tryouts_cant_run/", "Hey there, I hope everyone's doing great. I'm just a 14-year-old who's in a bit of a pickle and could really use some help. So, here's the deal - I'm about 6 feet tall, weigh around 187 pounds, and my body fat is about 17%. I know, numbers right? Now, I've got this soccer thing going on. I really want to be a goalie, and we've got tryouts on the first day of school (August 31). But here's the catch, I need to run 2 miles in 18 minutes, and right now, I can only manage 1.85 miles in 19:34 with a 10:32 pace. And I can't be a backup goalie 'cause, well, that won't get me much playing time. I've been hearing there's this awesome goalie coming in, and it's got me a bit worried. And yeah, it's a co-ed team, which is pretty cool since it's a small tech school. But still, I've got to step up my game. Oh, and another thing, running is a bit of a pain in the rib cage for me. Literally. I've been working on running and stuff recently, but honestly, I'm scared. Like, really scared. And I need to be able to do shuffle runs, fartlek runs, and all that good stuff. Can anyone out there give me some tips? I'm open to anything at this point. Like, I'll take all the help I can get. Oh, by the way, if you're up for it, I've got this list of requirements. If you're willing to share some insights, just message me. Seriously, any help will be like gold to me. Thanks a ton in advance! You guys rock    "], ["Struggling with hamstring pain issues.", "4", "0", "2024-04-08T05:01:55.491000+0000", "https://www.reddit.com/r/Kinesiology/comments/1bypjo0/struggling_with_hamstring_pain_issues/", "Hi Kinesiology professionals, I have been struggling with hamstring pain, as a soccer player I'm not sure if it was the Cleats I used that caused my injury or otherwise because I used firm ground cleats on turf as Canadian winters force us to play indoor soccer, I eventually purchased turf cleats but by then I was a walking patient. I never went for treatment , being stubborn I haven't played since we won the indoor league 2 weeks ago, I've tried K-tape and feel better but am worried on how to begin light exercise without aggravating. Pardon my English, any help would be greatly appreciated thank you ð\u009f\u0098\u008a ð\u009f\u0098\u008að\u009f\u0098\u008að\u009f\u0098\u008a    "], ["Struggling with son's aggressive behavior.  ", "10", "2", "2024-03-09T23:16:01.401000+0000", "https://www.reddit.com/r/daddit/comments/1bav8b2/struggling_with_sons_aggressive_behavior/", "My 5 year old son has several bad behaviors but the most troublesome one is aggressive behavior. Just yesterday he got into trouble for punching a girl at soccer practice.  I was mortified.  I explained to him this was shameful behavior and that we were canceling our plans for the weekend that was going to be his reward for good behavior during the soccer game.  I sent him to his room when we got home and afterwards had him help me match socks while I folded clothes.  Not a few hours later out of the corner of my eye I catch him back handing his sister (2 years old). We have attempted to enroll him in a couple private schools and he hit his mother multiple times on the way out of one school and at the interview for the most recent one he pushed his sister down multiple times and pushed another kid that was making faces at him. He has couple of other bad behaviors like running away from us in public and not following directions. We are not violent people and do not encourage violence in any form. I am a stay at home dad and he is with me all the time.  He does watch a lot of television but it is all age appropriate and with minimal fantasy violence.  I know excessive screen time is not good but I am afraid he would just beat up on his sister if he didn't have tv to distract him. He does occupational therapy twice a week and we have made appointment to have him screened for ADHD. In addition to the soccer he also do swim practice, and gymnastics so he does have other interactions with kids but I dread taking him anywhere where there will be other children.  I feel like I have tried a lot of different approaches and quite honestly I don't understand his behavior.  His personality is just so different than mine or his mother's and even at two I can tell a huge difference in him and his sister.  I am really at a loss here. I have been trying to find resources online and educational material but I feel like I have tried all of these suggested strategies.  I have been patient but I honestly losing hope and becoming depressed at this point.  If this community has any experiences they can share, advice they can give or resources they can direct me to I would be forever grateful.    "], ["27 male (68 kg) struggling with single arm exercises with a 12kg kettlebell ", "41", "12", "2024-03-05T12:31:40.675000+0000", "https://www.reddit.com/r/kettlebell/comments/1b74385/27_male_68_kg_struggling_with_single_arm/", "A bit of background, i largely played soccer/football in school and since becoming an adult I have barely taken part in physical activities hence I'm slender but pretty unfit and lacking functional upper body strength. To some extent, my current work is fairly physical and requires some strength hence I would like to build on it. For that reason, I bought one 12kg kettlebell online. I heard that 12kg was the recommended weight for men but I'm finding it either impossible or difficult to perform the snatch, halo ring, overhead press among other single arm upper body excercies. I'm currently living frugally so I'm a bit apprehensive about buying another kettle bell but for a lower weight. Are there any other options available to me, other recommendable exercises or general advice for going forward? Feel free for harsh words or brutal truths if needed     "], ["Struggling with Pain", "20", "9", "2024-01-23T01:13:22.179000+0000", "https://www.reddit.com/r/Marathon_Training/comments/19dc5fx/struggling_with_pain/", "I'm a male, 31. I ran my first half marathon this summer. It went great. I felt very strong and felt like I could've done it faster even. (Practically no previous running experience and ran it in 2 hours.) Soon after running that I signed up for my first marathon in March. I'm trying to train for that but just keep dealing with pain in my shins, ankles, and sometimes in my knees. None of this happened while training for the half. It's pretty much stopped me from training for the marathon. I'm able to play about 2 hours of soccer each weekend and that's practically all I can do. I realized a few weeks ago that I should've gotten new shoes about three months ago. So a lot of that pain must've just been from running on old shoes. But after two weeks of using the new shoes and doing lots of rest I still feel all the same pains. I just want to run! Any suggestions? Do I just take a few full weeks off of any running until I totally heal?    "], ["Struggling with diet", "5", "5", "2023-12-18T12:07:59.544000+0000", "https://www.reddit.com/r/FTMFitness/comments/18l75y3/struggling_with_diet/", "Hey guys! I'm 5 months on T and I've been doing sports since I was a kid, the last three years I stopped cause of a heart problem and I've been on and off from sports and exercise. I never had to care about my diet cuz I used to practice soccer 4 hours every week and I used to live with my mom so I just ate lots of proteins and all that. Anyways, now I've been living alone for 2 years and I have a terrible diet, I just eat whatever I want and I try but I can't seem to keep up with what I want, I know how much and what to eat but I never never follow it, it's so so hard, and also, I can't have consistency at the gym cuz it's so boringâ\u0080¦ I can't go back to soccer because it's a 2 hour drive from where I live and I would have to go at night time here in SÃ£o Paulo and it's dangerousâ\u0080¦. Idk if this makes sense, I had ADHD, I've read that it's harder to keep consistency in exercise and diet for those who have it  Anyways, I'm here asking if anyone has faced the same problem and how you've overcome it? I've tried a personal trainer to make me feel obligated to go to the gym and not skip the exercises but it's expensive so I stopped.    "], ["23M looking for long term friends struggling with loneliness", "1", "0", "2024-05-21T07:30:45.609000+0000", "https://www.reddit.com/r/Needafriend/comments/1cx26du/23m_looking_for_long_term_friends_struggling_with/", "After I moved to back the US in 2021 I have struggled to make friends and I'm coming on the subreddit in hopes that I'll be able to finally find a close friend. I live in the metro ATL area and I like to game (mostly Overwatch and a couple of single player games). Physical sports I enjoy are soccer, pickleball and badminton ( I wanna pickup tennis too). Preferably looking for someone who's around my age and lives in metro ATL area.    "], ["Im really struggling with nerves", "8", "1", "2023-12-09T20:10:47.924000+0000", "https://www.reddit.com/r/Advice/comments/18elx6j/im_really_struggling_with_nerves/", "I am a female freshman JV goalkeeper in soccer and I'm really struggling with nerves. I play really great during practices and I have proper technique, make great saves, etc but during games I completely choke. My goal kicks aren't good, I forget my positioning, my hands shake, etc. I don't know if this is the right place to post this but I had a panic attack during my game today and I don't know what to do. Any tips would be really greatly appreciated.    "], ["Help needed in designing Soccer drone cage.", "2", "2", "2024-06-26T13:51:50.233000+0000", "https://www.reddit.com/r/Fusion360/comments/1doz4p7/help_needed_in_designing_soccer_drone_cage/", "Can anyone give me idea on how I can model the white cage in fusion 360. I have tried out many method but it is not working out.         "], ["Help needed to decide the type of model to use for event detection in sports (football/soccer)", "1", "1", "2024-03-26T10:13:53.686000+0000", "https://www.reddit.com/r/deeplearning/comments/1bo4bb5/help_needed_to_decide_the_type_of_model_to_use/", "I have to make a project related to event detection in sports particularly football which classifies video datasets into categories but not limited to goals, red cards, yellow cards, corner kicks, and no event. Many existing models first break down videos into image frames, then classify/segment them into different categories in 1-2 stages. I want help regarding what kind of pre-trained model should I use for image classification/segmentation and anything different I can do from existing approaches. Here are related papers: https://arxiv.org/pdf/2102.04331 , https://www.hindawi.com/journals/cin/2022/2839244/ , https://www.semanticscholar.org/paper/Automatic-Soccer-Video-Event-Detection-Based-on-a-Jiang-Lu/2a654b390031872c8be469cbaa895ecaa8873b54  Let me know if you need pdf versions.    "], ["Lost Wedding Ring at Mather Sports Complex - Help Needed", "1", "7", "2024-06-24T04:26:19.667000+0000", "https://www.reddit.com/r/folsom/comments/1dn50fe/lost_wedding_ring_at_mather_sports_complex_help/", "Hi everyone, I lost my wedding ring today at Mather Sports Complex. It fell out of a hole in the bag I had it in while I was playing soccer. I've retraced my steps and searched all around the soccer field, but I couldn't find the ring. I'm feeling pretty bummed about it. I've already contacted the Lost and Found with both the soccer league and the park. I know it's a long shot, but there are a few grassy areas where it might be beneficial to look with a metal detector (the ring is made of tungsten). If anyone has a metal detector I could borrow, I would greatly appreciate it. Please let me know. Thank you!    "], ["Help needed with high school boys training", "25", "1", "2024-02-13T03:04:04.183000+0000", "https://www.reddit.com/r/SoccerCoachResources/comments/1apj3i1/help_needed_with_high_school_boys_training/", "I was voluntold to coach my daughter who is now in coed HS rec soccer.  She is a moderately talented player who dropped out of travel soccer due to school time constraints and just doing this for fun.  I last coached when she was u10 and it was great.  The problem is she is now the only girl on a team of nearly all HS boys that are very talented.  Most dropped out of ECNL or equivalent clubs.  My plan for small sided drills and dribbling (because it is 8v8 on a half field) has flown out the window.  I need help for 6, 1 hour trainings.  I have pup goals, cones, and balls.  Thanks    "], ["Help Needed! 50+Year-Old Egyptian Immigrant Seeking Job & Immigration Advice", "21", "0", "2024-03-27T21:28:32.298000+0000", "https://www.reddit.com/r/ImmigrationCanada/comments/1bpdky5/help_needed_50yearold_egyptian_immigrant_seeking/", "Hello everyone, I have a question regarding the job opportunities available for immigrants who are 50 years old or above in Canada. I am an Egyptian citizen who holds a Bachelor's degree in Law from Cairo University. Although I have never worked in the legal field, I have worked in various other professions, such as a driver, dishwasher, construction worker, front desk agent, sales associate, soccer manager, soccer team sponsor, and soccer club owner for a year. Additionally, I was the manager of an Asian foreign employment office in Kuwait, a store manager, and a business owner in the food industry. I have worked abroad for over 10 years in the gulf region, mainly in Kuwait, which makes me well-equipped for any job. However, I have two obstacles to overcome. Firstly, I am not fluent in English, which may pose a challenge in finding a job. Secondly, I am 50 years old, and I have a family of five, including my wife and four children, who are all under 18 years old. Therefore, I am looking for a job that can help me support my family, and also help me to legally immigrate to Canada so that we can settle there. The current situation in Egypt is challenging due to the falling economy, the decline of the Egyptian currency, the sudden rise of average market prices, and the country's debt. If anyone has any information or advice that could help me, I would be very grateful. Thank you.    "], ["Need help getting explosive for soccer/football", "47", "2", "2024-06-09T19:23:06.330000+0000", "https://www.reddit.com/r/bootroom/comments/1dc1sy3/need_help_getting_explosive_for_soccerfootball/", "I'm a 6'3 15 year old who weights 157, play as a Lw, cam or st and I'm very slow, unagile and stiff. I need help becoming a quick, explosive and coordinated player that doesn't move awkwardly like I do, I'm very skinny and idk what to do. People say do plyos, weight lift and sprint but how much can I improve, am I just cooked and it's over for me?    "], ["Need help finding soccer anime", "4", "1", "2024-06-05T17:22:01.397000+0000", "https://www.reddit.com/r/anime/comments/1d8vgok/need_help_finding_soccer_anime/", "Need help finding anime about - soccer set in future. In that world a new \"power\" was discovered but was banned in everything other then sports(soccer?). It's not new anime, so not Blue lock. It's not Inazuma 11 as well. Tried to look for years n still no success somehow. I am not a anime nerd, so prob don't even know where to look for optimal results.    "], ["Need help patching World Soccer Champs", "1", "3", "2024-06-05T06:49:51.471000+0000", "https://www.reddit.com/r/luckypatcher/comments/1d8jjb9/need_help_patching_world_soccer_champs/", "I have a rooted device. I want to mod World Soccer Champs for in app purchases but normal patches don't work. Can someone trying and give me a solution please??    "], ["New to Soccer Champs and Need Help.", "4", "1", "2024-06-11T00:23:00.708000+0000", "https://www.reddit.com/r/worldsoccerchampsgame/comments/1dd10dd/new_to_soccer_champs_and_need_help/", "Hello, as the title states I am new to soccer champs and I have been enjoying the game but I was wondering if there is a way to improve a notion that does not have a playable league. In my case I want to improve a carribean nation such as Cuba, Dominican Republic, or even Jamaica. I have seen posts on this reddit that suggest managing a club that is part of a near by nation to improve my chances of spawning a player from my target nation. I tried doing that with Guatemala and I only ever spawned Guatemalan players. I know my interest is probably very niche but I was wondering if anyone has any advice or suggest me to do something differently?    "], ["Need help with soccer!", "5", "3", "2024-02-28T20:14:09.727000+0000", "https://www.reddit.com/r/CoachingYouthSports/comments/1b2g3fx/need_help_with_soccer/", "Hi all, I have volunteered to coach one of the 8-10 year old soccer teams after some guilt was sent out that a whole team couldn't play unless someone stepped up. Hooray. Anyway, I played soccer all through middle and high school and that's the extent of my knowledge. Any tips on organizing this chaos? They're young and it's just for fun, but I don't even know the system: do I let them pick positions, do I assign, etc? And then where can I find info on age appropriate drills? Don't think I can have 8 year olds running suicides down the field! Thanks in advance for any help for this desperate amateur coach dad.    "], ["I Need Help Getting A Good Youth Soccer Team Photo", "18", "1", "2024-05-16T17:07:54.033000+0000", "https://www.reddit.com/r/PhotoshopRequest/comments/1cthyuu/i_need_help_getting_a_good_youth_soccer_team_photo/", "Greetings. We are trying to get an 11x14 team photo printed for our coach as a 'thank you' for a great season. As you'd expect from a bunch of kids, getting them all to be serious and look forward at the same time is... impossible. I have a few different versions of the photo and I am hoping someone can help me accomplish the following:   Use the photos provided to create a single version of the photo where all of the boys and coach are facing forward using the 'best version' (in your opinion) of their face/head/stance   Add the words 'Barca Academy CLB 2015B Red' to the bottom   Hoping to get a pretty quick turnaround on this please. I am willing to Venmo or PayPal $20 to the best result. Google Drive Link included with full resolution photos, if that is easier. https://drive.google.com/drive/folders/1IuPHeCZPta9NWklG09ALdoTi5ZFoJYZv?usp=drive_link  Thank you!                   "], ["first year playing soccer, need help", "7", "1", "2024-01-11T02:52:03.153000+0000", "https://www.reddit.com/r/bootroom/comments/193r1km/first_year_playing_soccer_need_help/", "I'm 16(sophmore in highschool), 5'8, 175-180lbs. I play left or right back. I play for my school, my school is small, but the team is still pretty good(many club players). I'm pretty slow, my shot is improving, I'm pretty good at passing(for my experience), I'm not very aggressive (although i can be at times). I'm not a starter but I see myself a rotational piece. I've seen myself improving but i want to be even better. My coach sees me improving, i think he sees potential in me, he's separated others and myself and told us that he sees us as the leaders for the future years. my coach told me he sees me as a smarter player on the pitch and I'm more consistent than others. I see my potential too, i want to reach my full potential as soon as possible. I feel like my weight is a big reason as to why I'm not at my full potential. Although, i feel like my body was built for soccer, most of my weight is in my legs. I have big legs. Im not looking to go pro, i just want to have fun in highschool. Should i get a trainer over summer? What can i do to progress? Will getting a trainer help me get in shape for soccer over the summer? Anything helps ð\u009f\u0091\u008d    "], ["Soccer van drowned - need help deciding on next family car.", "3", "3", "2024-06-23T22:17:57.267000+0000", "https://www.reddit.com/r/whatcarshouldIbuy/comments/1dmxv9d/soccer_van_drowned_need_help_deciding_on_next/", "Wife drowned our 2014 Toyota Sienna van in a recent flood - need some help choosing new family-friendly vehicle for around 50k. Looking something comparably sized for carpooling kids to soccer (6-7 seater preferred), but with higher ground clearance, as our neighborhood floods regularly due to king tides and heavy rains (aware driving through high water not safe) and possibly a hybrid. Research so far: Toyota Grand Highlander Hybrid; Subaru Ascent/Crosstrek, Lexus RX 350, Hyundai Tuscon Hybrid so far - suggestions?    "], ["I need help brainstorming a username for my Women's soccer news/blog focused Instagram account.", "21", "0", "2024-05-07T14:15:38.240000+0000", "https://www.reddit.com/r/WomensSoccer/comments/1cmcyki/i_need_help_brainstorming_a_username_for_my/", "As the title states, I need help coming up with a username for my Instagram account that incorporates Women's soccer news preferably a witty name or Lingo or a catchy word Thanks In Advance    "], ["I need help finding old rubber soccer balls, used in soccer games in the 1970s.", "2", "2", "2023-11-13T20:26:24.538000+0000", "https://www.reddit.com/r/HelpMeFind/comments/17ujy1g/i_need_help_finding_old_rubber_soccer_balls_used/", "Hello folks, I need help finding old rubber soccer balls, used in soccer games (match used) in the 1970s (specifically the older rubber soccer balls used between 1967 and 1977). Keep in mind, these are not anything like the cheap, toy rubber soccer balls of today. Soccer balls, back then were made with various rubber compositions, like polyvinyl, polyurethane, and urethane. Many had latex bladders in them, as opposed to the cheap butyl ones used today. Rubber soccer balls had been used all over the world, as practice/ training balls to being used in full blown soccer games in local-town-village tournaments. These types of soccer balls were inferior and not very durable, and so a new heavy duty design was introduced in the mid 1970's (machine glued) and eventually, rubber soccer balls were phased out (primarily in north America first). Many brands (worldwide) made rubber soccer balls in the 1970s, specifically made to be used in games. Unfortunately, most of these sports brands no longer exist today.  I hope, by making this post, someone out there has one (or more), of the really old, rubber soccer balls from the late 1960s, 1970s, that were used in soccer games (footballs matches). I do not care how worn they are I do not care if they hold air or not I do not care if the ball is damaged from decades in play I do not care what part of the world they were used in. ---------------------------- I do care what size it is (I'm looking for full size only) I do care if the rubber composite has \"dry rot\" I do care what type of rubber composite the ball is made of (Vulcanized rubber soccer balls are toy balls)  Many were used in schools in the 1970s, and these I will also look into taking.  I will offer anywhere from $75 up to (but not limited to) $1000 Age (older is better) history wear (more is better) Country is what used in Rubber composition  If anyone out there is willing to help me find a few, I would be grateful.      "], ["Need help choosing a soccer game for my family", "11", "11", "2023-12-29T06:13:31.954000+0000", "https://www.reddit.com/r/WEPES/comments/18tg76g/need_help_choosing_a_soccer_game_for_my_family/", "Hi all, I need help choosing a soccer game for my extended family to play when they get together as I know nothing about soccer or sports games in general. They play PES 2013 on their PS3 whenever they hang out and they all seem to really bond over it, so I want to have something similar available for when they hang out at our house. I have an Xbox Series X, and from what I can see, it looks like only PES 2015-2021, eFootball 2022-2024, and FIFA 2014-2023 are playable on it. I would ask them which one I should buy, but I want it to be a surprise, and they never played anything beyond PES 2013. Single player campaign and online play are irrelevant - which one has the best offline vs?    "], ["help for soccer game gameplay", "0", "0", "2024-02-25T23:22:06.505000+0000", "https://www.reddit.com/r/UnrealEngine5/comments/1b02clo/help_for_soccer_game_gameplay/", "Hello, recently I wanted to make a soccer game, I have everything, I just need the gameplay, I want to have the gameplay of this video https://youtu.be/7VONnSV7280 Unfortunately, I am too new to using Unreal Engine 5. I would like to know if Can anyone help me or know how to do it, thank you    "], ["Need help for long run at 4am", "48", "40", "2024-06-12T01:05:58.128000+0000", "https://www.reddit.com/r/kansascity/comments/1ddudf1/need_help_for_long_run_at_4am/", "I am from out of town and will be in Kansas City for Copa America soccer games. I am currently training for the San Francisco Marathon at the end of July. The weekend I will be in Kansas City I will need to complete an 18 mile long run. I found a 8 mile race hosted by East Side church which is located in Independence, Missouri. The 8 mile run starts at 8am and I am planning to run 10 miles at 5am from my hotel Hampton Inn Downtown/Financial district to the East Side Church prior to the 8 mile race which will add up to my 18 miles. Is this a safe area to run at that time of the morning? Absolutely not familiar with Kansas City and hoping to get my long run in and make the most of my time exploring/being a tourist. I will Uber back to my hotel after the race so that won't be an issue. Any help is appreciated.    "], ["Looking for help for two projects", "80", "41", "2024-02-21T22:20:30.552000+0000", "https://www.reddit.com/r/artcommissions/comments/1awp9mg/looking_for_help_for_two_projects/", "Hi everyone. I am looking for help with two separate projects. Both are for personal, entertainment purposes so there is no rush on delivery time. Also, if you'd like to only work on one and not the other, no worries! I am completely open to splitting the projects between two artists.  One project is pretty simple. All that it entails is a profile picture for my Xbox and Steam accounts. My name is SovietSpaceBear so something around that theme is what I am looking for. All styles accepted!  The other project may be a bit more niche. I am an avid soccer fan and have recently started a new Football Manager save with the Romanian sixth division side FC Ripensia Timisoara. I have an idea to have some art done now, and then later on in the save after certain promotions etc. to mark my progress in the save. Was thinking of maybe a map of the city the club is from highlighting certain landmarks, stadium, etc. Though, if you have an idea for something else, I am all ears!  I have never commissioned art before so I apologize if I am not providing enough details. If you have any questions or are interested, please DM me!  Thanks, and I look forward to hearing from you talented peoples!     "], ["Translation help for my grandma's neighbors?", "12", "8", "2024-02-14T23:45:49.677000+0000", "https://www.reddit.com/r/guatemala/comments/1ar1ipk/translation_help_for_my_grandmas_neighbors/", "My grandma is 81 and recently a nice guatemalan family has moved in next door. They've been really nice to my grandma and their kids come over to her place to play with my family's old toy cars, play doug, soccer,  legos etc. Seems they don't have many toys or have no place to play. It's really brightened her up from what I can tell. Two of the mothers came over and just sat with her and talked, they couldn't understand eachother but my grandma really loved the company. It seems the family still has their grandma back home. I got some toys, a cool usa soccer ball, paint supplies, hacky sacks, a wooden spinner (google didnt help with 'guatemalan toys' but whatever lol), and some school supplies like pencils and folders. I don't know their situation but it'll be in the pile at her house if they need it. I just want to make a note to them to thank them for being nice to my grandma and giving good company. Itd be nice for their moms to be able to read it too. I was going to do google translate but I know the dialects can be very different. Can I get some help with the translation? Itd be short. Or even a toy recommendation they'd might like? The oldest is in 7th grade.    "], ["I need help for my younger brother", "0", "1", "2024-04-18T20:07:41.972000+0000", "https://www.reddit.com/r/therapy/comments/1c7d5vc/i_need_help_for_my_younger_brother/", "I just joined this community a couple minutes ago for only this issue. The best thing about this is that you stay anonymous. Sorry if it is too long ð\u009f\u0098\u0085. So here is what is happening; My brother is turning 14 this year. He is in grade 8 about to go to high school. On the other hand, I am his older sister I am in grade 12 about to go to university. For the past couple years, you have been making lots of issues, but specially this year it's been way too much nearly every day and no trouble. He never stops arguing with my parents day and night, he's just shouting at them for the silliest reasons. He just want to stay on his phone and go to his soccer practice and nothing else and even when it comes to his soccer practice he's always late and his coach complained multiple times. Those are the minor things for the major ones. He always get in a fight at school and say that everybody's targeting him. He would come every while and a while with the bruises or a call from the principal. Not only in school, but also in community centre events, we would get a call about him being racist to his friends or racist at his school, start a fight while he's playing soccer in school. And at home he's nothing better, like he has dirtier mind than me and all his jokes are disgusting and he doesn't mind saying them infront of me. I am genuinely so done. I want to live for one day in a positive environment and I am worried that my 4 year old sister learn something from him or learn how to be aggressive. My parents are absolutely amazing, and the proof is me. Hope you guys can help with this. Any suggestions, anything to help with this. I really feel bad for my parents and I feel guilty for being useless in this issue.    "], ["Help for trans son", "3", "4", "2024-03-02T12:42:41.596000+0000", "https://www.reddit.com/r/trans/comments/1b4nfgw/help_for_trans_son/", "Our (53M, 53F) trans child aged 10 is being bullied at school (hit in the back of the head with a soccer ball and called a lesbian just yesterday), and we need an advocate. We are also in a tough spot financially right now. State is Massachusetts. Does anyone know of resources??    "], ["Lens help for Football Video/Photo!", "1", "1", "2024-04-22T10:34:30.055000+0000", "https://www.reddit.com/r/videography/comments/1ca7e7e/lens_help_for_football_videophoto/", "Hi all, I'm looking to break into football / soccer video work and sideline photography and need some help with lens. I currently have a Sony A6300 which has done me good for years. I'm looking at the Tamron 28-200mm F2.8 and wondering if this is good for the A6300? I am aware that it is a full frame lens so there will be a crop increase, will this totally ruin it? Any other opinions on E mount lenses are welcome. My budget is max Â£500 at the moment which may be hard to work with, but I'm happy with second hand lenses as I'm entry level into sports coverage so don't want to take the jump into a huge telephoto just yetâ\u0080¦ Thanks!    "], ["NEED HELP for Creating a Cup", "0", "1", "2024-01-10T01:15:55.869000+0000", "https://www.reddit.com/r/footballmanagergames/comments/192vnfq/need_help_for_creating_a_cup/", "I was trying to create a cup that similar to HKFC Citi Soccer Sevens in pre-game editor, a cup mixed with some Asia first team and English U21 team. However, I don't know how to add youth team into the cup while adding some Asia first team. Can anyone please help me to tackle this problem?         "], ["[CA] Help with expanding my soccer facility business", "7", "2", "2024-04-25T20:34:05.929000+0000", "https://www.reddit.com/r/SmallBusinessCanada/comments/1cd1xuk/ca_help_with_expanding_my_soccer_facility_business/", "I've owned a business for a little over a year: I leased a 10 000 square foot warehouse, put in an artificial turf where I run soccer programs while also renting out the facility to local soccer clubs. We've had a good first year with $500 000 in revenue and $420 000 in expenses. Our second year looks to be even more positive. I'm in a location with a population of 300 000 with very low access to indoor sports facilities. Soccer is huge here, my business is constantly growing, we're the only large \"private training\" program in the region. We have some of the best coaches and have a good reputation in the community. I want to build a full sized artificial turf, putting a seasonal dome over it during the winter months. The project is estimated to cost $5.5 million with everything included. The business plan includes running our private programming, starting an actual club that plays out of this facility and renting the facility out to other groups. There's one other full field indoor facility in our region, it's fully booked from early morning to late at night 9/10 months of the year, then they run day camps during the summer, they have a long wait list for groups to rent. They're basically only rentals. Our model is better as most of our usage will be from our own groups, where players are each charged an hourly fee, coming to a much higher hourly revenue compared to hourly rental revenue. I met with a bank yesterday, this type of project would require 50% paid up front. This down payment would be mandatory no matter what assets I have, no matter what other investors were potentially involved. For many reasons, including realistic projections, I know this expansion would be a success. I know there will potentially be a lot of support for this project from sponsorships and private donors, but I really struggle to see myself being able to come close to raising $2.75 million. Does anyone have any advice on how I could make this happen?    "], ["Does regulat soccer ball juggling help with futsal? ", "14", "2", "2024-02-27T15:07:44.511000+0000", "https://www.reddit.com/r/futsal/comments/1b1e2b6/does_regulat_soccer_ball_juggling_help_with_futsal/", "I am trying to improve my first touch and ball control. All the football youtubers talk about learning how to juggle, Is that valid? Will it help with futsal ball control?    "], ["Help with soccer bets", "4", "1", "2024-01-17T08:19:34.891000+0000", "https://www.reddit.com/r/sportsbetting/comments/198rpsp/help_with_soccer_bets/", "WTF is the difference between Asian -1 handipcap and -1 3 way handicap?    "], ["Help with soccer pitch", "6", "2", "2023-10-11T13:24:00.043000+0000", "https://www.reddit.com/r/lawncare/comments/175dxtl/help_with_soccer_pitch/", "Any idea what these circle of grass are being caused by. Northern Ohio, this pic was taken at the start of the season. Circles of grass that grow taller usually and darker grass. Pics in comments.    "], ["Can anyone help with which soccer cards to buy please?", "0", "1", "2024-06-01T21:46:17.086000+0000", "https://www.reddit.com/r/SportsCardTrading/comments/1d5xpu2/can_anyone_help_with_which_soccer_cards_to_buy/", "Basically I'm looking at getting into soccer cards and have been researching the several different packs. I enjoy opening packs so am sort of against buying singles (will buy a few that I need of course) but would rather open packs for the surprise ð\u009f\u0098\u0082 I am looking to build a collection as a potential investment in the future and this is where I'm not sure on what packs to buy! I have been looking at Panini Prizm, Topps Finest, Topps Gold, Panini Select and Donna's, all the most recent boxes. Any help would be greatly appreciated. I suppose I'm looking for something where it could potentially be an investment in the sense of how valuable cards are worth in the box. My budget for a hobby box is around the Â£250-Â£300 mark. Thanks.    "], ["Help with Mechanics for a soccer theme based tcg", "10", "4", "2023-10-21T05:51:57.165000+0000", "https://www.reddit.com/r/homemadeTCGs/comments/17cvnoh/help_with_mechanics_for_a_soccer_theme_based_tcg/", "Like the title says, i'm struggling to make a fun game based on soccer that implies using cards more in a triditional tcg way. I watched some other soccer card games but all were pretty simple like the match attack one. Any ideas are welcome since i dont know any more soccer tcg to take reference from.    "], ["Looking for stretches to help with weak leg mobility for soccer!", "0", "2", "2024-03-23T19:10:12.725000+0000", "https://www.reddit.com/r/flexibility/comments/1bm04w5/looking_for_stretches_to_help_with_weak_leg/", "Hi all! Just for some context I'm a right footed soccer player who is working on getting their left foot up to par. I've been working at it for about a year now, and there has been some improvement. However one issue I've been running into is passing with my left foot open up. For anyone unfamiliar with the mechanics here, I think this video illustrates what I'm talking about : https://www.youtube.com/watch?v=umYh09GLr7I&t=58s (0:59 - 1:02) He stands with his right foot straight and his left foot perpendicular (a little over 90 degrees, actually) and goes from behind his right foot and follows through, with his left foot maintaining the roughly 90 degree angle. My issue is, on my left foot, I just cannot do this motion. My left foot does not want to remain open (I struggle to even statically stand with my left foot open like that). As soon as I begin to follow through, especially as I move my leg forward past my hips, either my standing foot (my right foot) will point inward or my left foot will curl inward. I do not have this problem when I flip which foot does what (right foot swinging, left foot standing). Are there any stretches I can do to make this motion easier on my weak side?     "], ["Newb help with the soccer/football mini game?", "4", "0", "2023-08-21T21:42:32.130000+0000", "https://www.reddit.com/r/forgeofempires/comments/15xl4lp/newb_help_with_the_soccerfootball_mini_game/", "I'm trying to merge similar badges (color, type, level, etc.) and they are NOT merging. What's the secret technique here Fam?    "], ["Soccer Drama (1988)/ Strike for goal (1990) help with missing instructions and piece inventory.", "0", "2", "2024-02-16T19:12:26.559000+0000", "https://www.reddit.com/r/boardgames/comments/1asgur2/soccer_drama_1988_strike_for_goal_1990_help_with/", "Hi Everyone, My 7 Year old son has recently started getting interested in Football thanks to Match Attax (more stats and facts than playing). He's also interested in board games and while at his Grandparents I found a board game from 1988 called \"Soccer Drama\" (Irish Version), I think also known later as \"Strike for Goal\".  https://boardgamegeek.com/boardgame/5315/soccer-drama   https://boardgamegeek.com/boardgame/11282/strike-goalll  Unfortunately it appears my brother in law may have not been as careful as he should have when he last played it 30 years ago and the instructions are missing. I've done some Google Searches for the instructions and haven't found anything.  Would any one have a copy of the instructions or any idea where I could find a copy? I'm hoping the instructions include an inventory of the cards as well as I'm not sure I have them all. I know I am missing   the dice, one has some custom sides.   A sand timer   some player pieces   I'm hoping i can work this out from the instructions; I rather restore the game and make it playable again rather than throw it out. Thanks,    "]]