[["got problem with Baking soda and Vinegar to unclog house's drain", "7", "0", "2024-04-28T04:27:55.239000+0000", "https://www.reddit.com/r/Plumbing/comments/1cexsre/got_problem_with_baking_soda_and_vinegar_to/", "I probably did something wrong and now it's not even draining. I followed the Youtube:   Pour boiling water   Baking soda   Vinegar   Boiling water   Hot tap water   It seems to work for many people but not for my home.  Most probably the baking soda crystalized. Help?    "], ["Problem with stop drinking soda", "6", "2", "2023-08-03T12:21:15.312000+0000", "https://www.reddit.com/r/HydroHomies/comments/15h2p2c/problem_with_stop_drinking_soda/", "I have this problem that everytime there is some type of soda, I have to order it and drink almost 1 gallon of it. This problem is going for almost 8 years now, you can help me to lose this addiction? I am really grateful if you can!    "], ["A scene depicting the problem with this country", "109", "0", "2024-04-26T12:24:01.530000+0000", "https://www.reddit.com/r/centrist/comments/1cdk130/a_scene_depicting_the_problem_with_this_country/", "I live in a high-end neighborhood that is under construction. I just walked to my mailbox and saw the following scene that, I think, epitomizes one of the major problems our country faces. 4-5 hispanic men are working on the cement foundation on a new house, using shovels, rakes, etc. All moving and working hard at 7:30am. At the front edge of the property is a big, fat, white guy leaning over on his small skid-steer type buggy (think a big shopping cart with treads) with a can of soda/energy drink and looking at his phone. His truck and trailer are parked across the street. It's an F150 (fine, it's a legit work truck), platinum edition or whatever, lifted, with big tires, big wheels, spikes for lug nuts, a bullet-shaped antenna, and 'Let's Go Brandon' bumper sticker. This lazy mouth-breather with an ~$80k truck is watching these hispanic men work hard--probably waiting for them to finish with the foundation so they can then load his machine for him--and supports politicians who want to deport these guys. He's presumably making good money but probably hates Joe Biden (Let's Go Brandon = Fuck Joe Biden) for the economy, immigrants, etc. It's not the first time I've encountered this scene. I know this neighborhood could not have been built without immigrant labor, or at least it would have taken years longer and been for more expensive. The same is true for much of this country. I wish our politicians on both sides would talk to the mouth breathers with this truth rather than foment their fear and hate. We need both immigrant labor and for Americans to be willing to work. Instead, we get hate for immigrants and coddling of entitled, lazy Americans. Update: 2 hours later, landscapers are buzzing, framers are hammering away, etc. Almost all look hispanic. And he's still sitting in his truck. Edit: I never called the hispanic men \"illegals.\" I said the guy with the \"Let's Go Brandon\" sticker supports a politician who talks about these immigrants as murderers and rapists and wants to deport them.    "], ["Does anyone else have a problem with eating too much fake sugar?", "43", "25", "2023-10-11T19:13:50.935000+0000", "https://www.reddit.com/r/UlcerativeColitis/comments/175m8hv/does_anyone_else_have_a_problem_with_eating_too/", "I have had ulcerative colitis since the summer of 2021, I am in remission and living on campus at my university.  I have noticed that finding the right foods for me to eat in the cafeteria can be challenging. I have tried to eat real sugar, such as sodas and desserts, but that made me sick. Recently, I started to bring sugar free candy to college as an alternative. I also bring sugar free syrups, and energy drinks with me. I have noticed that eating too much fake sugar can make me sick as well, just like regular sugar can. Does anyone else have this issue?    "], ["Eyesight problem with my medical. Should commit to training while I sort it out, or wait to be safe?", "17", "9", "2023-07-29T13:11:45.731000+0000", "https://www.reddit.com/r/flying/comments/15cs0gp/eyesight_problem_with_my_medical_should_commit_to/", "I've been going through the motions of joining flight school. Did a discovery flight, got my student loan financing approved, and scheduled my 1st class medical. I knew one of my eyes was bad, but not bad enough that I need glasses to drive or live. Saw the eye doctor Monday and was told I have amblyopia (lazy eye) in one of my eyes. My vision in that eye is 20/30 but amblyopia is non-correctable so that eye will never see better than 20/30. So I'm 20/20 left eye, 20/30 right eye, and 20/20 with both. The AME changed my 1st class appointment to a 3rd class after I inquired about my options. He said I have to do the medical this week, if I fail the eye portion then he will defer my info to someone with a local faa office. That person would schedule some special medical flight, and if all goes well I'd get a â\u0080\u009cSODAâ\u0080\u009d and they would issue my 1st class. Reading about the SODA process online makes it sound like it can take anywhere from a few months to a year+â\u0080¦. Assuming my eyes are the only problem my AME has, should I push forward to start training immedialty while I sort out the SODA stuff? I'm in my mid 30s working towards a career change so the thought of putting training behind for months or even a year+ doesn't sit well with me. The risk being that there's no guarantee I'll get the waiver, so I end up thousands of dollars in debt. What are your thoughts about my predicament. Would you risk the debt knowing there's no guarantee you'll receive SODA or do you put yourself months or a year behind in training as you sort it out? I'm hoping someone here has had a similar problem they worked through. Would love to hear about how the experience went. Thank you    "], ["A weird problem with my alexa and lemon demon", "1", "11", "2023-11-01T22:43:31.602000+0000", "https://www.reddit.com/r/lemondemon/comments/17loi6n/a_weird_problem_with_my_alexa_and_lemon_demon/", "So I keep asking my darn alexa to play Hip Hop Cherry Pop but she keeps playing Modify instead. Anyone know how to fix this..? I just wanna listen to the magic soda song. She also does this with The Satirists Love Song.    "], ["Which Latin American Countries Have The Worst Problems With Obesity? Which Ones Have The Least Issues With Obesity?", "67", "29", "2023-07-06T06:14:17.977000+0000", "https://www.reddit.com/r/asklatinamerica/comments/14s01r5/which_latin_american_countries_have_the_worst/", "Mexico has surpassed the United States in Obesity. But according to this map: https://landgeist.com/2021/12/09/prevalence-of-obesity-in-south-america/  It is also a big problem in Argentina, Uruguay and Chile as well. How prevalent is obesity in your country? Do you see lots of people with bad eating habits? Is soda, fast food and pastries/desserts popular in your country? Is it common to see normal people become fat when they become adults? Do you worry that your girlfriend or boyfriend will become fat? Do you worry what you will look like at the beach?    "], ["Designing a food ordering app and having an issue with the quantity button over multiple products!!", "2", "1", "2024-03-28T23:17:13.149000+0000", "https://www.reddit.com/r/FigmaDesign/comments/1bq9usu/designing_a_food_ordering_app_and_having_an_issue/", "I've setup my product variables(pizza, soda, popcorn) and have applied the variables to each page. I've added a quantity button that resembles this    -  0  +    as a component with the variables appled(pizza, soda, popcorn) I've applied the appropriate quantity variable component to each page.  However, whenever I add an item on the Pizza page and then navigate to the Soda page. The quantity component shows as 1 on the Soda page when I haven't yet added a Soda item.  I'm new to Figma and I hope I'm clearly communicating my issue.  I'm at my wits end. Please help and TIYA.    "], ["Anyone else have an issue with recurring oral thrush during chemo?", "16", "4", "2024-02-03T20:55:05.912000+0000", "https://www.reddit.com/r/breastcancer/comments/1ai5ykz/anyone_else_have_an_issue_with_recurring_oral/", "I do what my doctor told me to in order to avoid getting oral thrush, yet every time I undergo chemo, a few days later, despite swishing the salt and baking soda solution multiple times a day, I always manage to develop candida in my mouth. This last Wednesday was my third treatment, and like clockwork I'm dealing with oral thrush AGAIN. It seems no matter what I do, I can't stop it from developing :(    "], ["Issue with spin mop bucket reaking of pinesol!!", "1", "1", "2024-02-20T02:22:30.519000+0000", "https://www.reddit.com/r/CleaningTips/comments/1av697p/issue_with_spin_mop_bucket_reaking_of_pinesol/", "I got one of those spin mops that I have seen ALL OVER the internet. I have the two-bucket system. I love it and it worked fantastic!!! However, I used a couple tablespoons of pinesol in the water and now I can't get the bucket and mop head to stop REAKING of it. This has never happened when mopping with more traditional products. No matter how many times I rinse the bucket with hot waterâ\u0080¦ it persists! Am I not supposed to use any cleaning products in it? Anyone know how I can get the strong smell to stop?    "], ["Any issue with changing reservation to share a room?", "9", "3", "2024-01-04T03:09:07.126000+0000", "https://www.reddit.com/r/NCL/comments/18y2mbt/any_issue_with_changing_reservation_to_share_a/", "First time cruiser! We are booked for a May cruise and originally a large group of us were going including my husband. He can no longer go so I was going to switch to sharing a cabin with my mom. She has a club balcony suite on the getaway vs my ocean view room. Will this screw up any flight deals? We should be able to get the second person free if I'm in her room? She's not planning to do any excursions but I might. I also have the FAS drink package but she cannot drink. I believe she has the soda package though. Just trying to think of any possible issues we might have with the switch and if it's a good move rather than 2 singles in regular cabins.    "], ["Solving the overspending issue with ADHD partner?", "31", "15", "2023-11-23T21:47:04.021000+0000", "https://www.reddit.com/r/ADHD_partners/comments/182bszq/solving_the_overspending_issue_with_adhd_partner/", "I've been seriously trying to pay off our debt for a couple of years now and my Dx ADHD partner (on meds) continues to spend or find reasons to spend.  Reality: - We have 4 issues with the house that we do NEED to address before it gets worse, and I know I'll be using my credit card to address those issues and I'll have to be okay with that. - We will be taking at least 3-4 years to pay off what we have in debt right now and I don't want it to get worse as my goal is to be debt free (outside of the mortgage) by 35 years old. - My partner will go to get groceries or gas and buy hot wheels, sodas/snacks, etc. instead of what was budgeted for/listed (and then if our son goes with him they both get toys). Basically my husband going out of the house = spending frivolously. My husband looking up cars = husband spending frivolously.  I'm not sure what to do. He has maxed out all his credit cards. He spent money to get our car working as it needed new parts.  He is an auto tech (or was but plans to be again once our situation with our son gets better - we currently work from home and homeschool our son) and my husband feels that spending on cars is always a need/justified (we have 4 cars - all paid off, 1 not drivable, 2 need work to be in top condition, and my car is doing alright but does need parts to keep it maintained).  My husband admits to the impulsivity of wanting the new things or the desired item.  Does anyone have any strategies to use to curb this? He is on Amphetamine and Guanfacine right now.  He told me this morning he doesn't have skills nor knows how to get them/build them. I am not going to be the helper on this one as I'm tapped out and I told him to reach out to his ADHD friend to discuss that.  But I'm feeling overwhelmed, lost, and hopeless.  I don't want to be in debt - not like this.  I just want to live a safe, secure, and comfortable life (i.e. where my amygdala isn't always active perceiving threats to stability).  Is that even possible?  I love my husband. I just don't love the situation we're in and continue to be in no matter how many times I pay things off he just up and spends more.     "], ["My issue with the grab hit boxes", "3", "2", "2023-09-20T12:23:14.780000+0000", "https://www.reddit.com/r/SaintsAndSinners/comments/16njxwf/my_issue_with_the_grab_hit_boxes/", "My main issue with the hit/grab boxes is that they seem so much more close together. this is like one of my only issue of the game as i did quite like it i thought it was challenging and fun. the story kinda sucks but it was light in the first game but these grab boxes are so annoying. i go to grab my katana and i grab my backpack. i go to grab a soda bottle on the floor nope, take a 4th and pain. it's even worse with the flashlight i literally can never grab it, it takes so much work i only ever get it when i'm tracking for bullets but the journal is even worse, i cannot get the journal without emptying my shoulder and right pocket. it's just so frustrating. is there a fix to it?    "], [" Ginger bug drinks /recipes(issue with acidic base)", "4", "1", "2024-03-27T15:14:46.820000+0000", "https://www.reddit.com/r/fermentation/comments/1bp4bzr/ginger_bug_drinks_recipesissue_with_acidic_base/", "I want to start making ginger bug fermented drinks ,already got the bug started and healthy (fizzy and bubbly).What are some liquids that produce good quality drinks .Already made one batch with turmeric lemonade but it didn't taste that good and the fizz was weak(used raw organic cane sugar) after keeping it 3 days on room temp and then refrigerated overnight. Looking forward to your recommendations, tips... Some info I got from friend is that citric acid from lemonade didn't help the fermentation and maybe even halted it .Is that true ?    "], ["Sensory issues with soda", "1", "1", "2023-11-15T13:06:05.764000+0000", "https://www.reddit.com/r/autism/comments/17vt89w/sensory_issues_with_soda/", "Whenever I drink soda with carbonic acid (is that the right term? English is not my first language.) it can be outright painful for me. Sometimes I just end up stimming in discomfort as I try to get the feeling of my mouth burning to disappear. It stops feeling like that after the first few sips but it can still be painful if I drink too much in one sip. Can anyone relate??    "], ["having issues with mountain dew real sugar ", "7", "1", "2024-03-19T04:42:05.224000+0000", "https://www.reddit.com/r/mountaindew/comments/1bic20x/having_issues_with_mountain_dew_real_sugar/", "I have a stockpile of mountain dew real sugar. That's not the issue . I know its been discontinued. I've been doing long trips to buy it since 2020. Here's my issue. During those long trips I've tried to minimize the damage to the cans in order to avoid any problems and changes in taste. I live in western Nevada about 400 miles or more from where the nearest real sugar mountain dew I can buy in person.  I've been buying from Utah since '20, Idaho from '21, ,Montana in '22 and '23. I have even made 2 big trips to Arizona.  Every trip was for the most part successful.  Except for Arizona.  I was able to buy real sugar mountain dew in  Arizona.  The problem is that when I get it home, most of it is undrinkable . why ? sometimes I've had dented cans from the other non Arizona trips , and 99 percent of the soda was great. Almost none of the soda I bought from Arizona is drinkable on both trips.  I had elevation changes and temperatures extremes on every trip not just Arizona. Why did only Arizona give me issues with the soda? I cant tell if the soda is flat or contaminated.  Sometimes it just tastes flat, other times it tastes fermented or just watery or something like that.  If it's flat sholdnt i be able to recarbonate it? Anyone else have this issue? even the cans that don't look dented taste funny. the soda is good until may or July depending on the pack. I have outdated soda from Utah and Idaho that tastes perfect. I  almost wonder if the soda wasn't good to begin with. Of course I forgot to taste test the soda before I left just to give me a better idea.    "], ["Issues with Collins/Highballs", "14", "4", "2023-10-17T21:07:40.702000+0000", "https://www.reddit.com/r/cocktails/comments/17a8r05/issues_with_collinshighballs/", "Hi Everyone, I recently made a Collins/highball style cocktail for some friends and they all had the same reaction when drinking it. They all essentially said it was way too strong at the bottom of the drink. The directions said top with with soda but I ended up doing the bar spoon method of letting the soda water go down the spiral part and carbonate it from the bottom of the glass. I usually don't make this style of cocktail and was wondering if there is a better method? I've tried just topping it with soda water and I've even stirred it. They all taste the same with most of the flavor at the bottom the glass. Any help would be great!    "], ["Does anyone else have issues with TVP, or a way to solve this?", "11", "13", "2024-03-21T20:08:35.879000+0000", "https://www.reddit.com/r/EatCheapAndVegan/comments/1bkg28c/does_anyone_else_have_issues_with_tvp_or_a_way_to/", "Hi everyone! I have a slightly puzzling (and, unfortunately, somewhat embarrassing) problem to solve and I'm hoping someone here may have some answers. Does anyone else get horrible gas/stomach pains from eating TVP? Is there a way to solve this, aside from taking Beano? I'm puzzled as to why I have this issue in the first place, seeing as how I can eat both tofu and whole shelled edamame just fine without trouble. I also eat a consistently high fiber diet and don't have this issue when eating other foods that trigger bloat and gas in others (various beans, cruciferous veggies, etc.) I know some people like to add baking soda to dried beans when they soak them overnight and that seems to help with bloatingâ\u0080¦ is there a similar application I'm missing here? I considered trying to add some baking soda to my next batch to see what happens, but considering the nature of TVP I can't imagine the baking soda flavor would ever go away or be rinsed off. I would love to find a frugal solution to this because TVP is so versatile and affordable as an ingredient, but I'm so tired of the gastrointestinal issues. Thanks in advance for any help or suggestions anyone may have!    "], ["Issues with heavy orders? ", "4", "0", "2024-05-21T00:02:09.717000+0000", "https://www.reddit.com/r/InstacartShoppers/comments/1cwue1a/issues_with_heavy_orders/", "Is anyone else getting batches that are heavy but aren't paid as such? Then call and still no change? Today for example I had 10 x 1 gallon jugs 8.34lbs each and a case of soda. They made me look up all the info on price etc and then said yea it qualifies. But still no change. This isn't the first time.    "], ["Anyone have issues with springtail buys coming thru drains?", "4", "2", "2024-05-09T18:18:14.149000+0000", "https://www.reddit.com/r/CleaningTips/comments/1co3z9g/anyone_have_issues_with_springtail_buys_coming/", "I've been having springtails come up thru my bathtub drain, been using baking soda/ vinegar solutions for weeks with not much luck. Not really sure how to clean a bath tub drain manually. Thank you in advance.    "], ["Issues with natural deodorant", "20", "2", "2024-01-13T03:02:52.591000+0000", "https://www.reddit.com/r/NaturalBeauty/comments/195dtqo/issues_with_natural_deodorant/", "I am on week 2 of switching to natural deodorant. I've tried in the past but can never make it past this point because of issues I have. My arms pits aren't red or have rashes, but they smell, sometimes have a burning sensation and are so sore. It hurts to put my arm down and I sleep on my side and even that causes me pain. I don't feel any major lumps but could I have an infection in my lymph nodes from this? Or even some sort of clogging? The deodorant I have has baking soda in it and I ordered one that does not to try, but I'm in a lot of pain and I really don't want to switch back to original deodorant this time.    "], ["Does anyone else notice stock issues with the Target at Bayshore Mall??", "62", "72", "2023-12-15T16:28:57.565000+0000", "https://www.reddit.com/r/milwaukee/comments/18j3znm/does_anyone_else_notice_stock_issues_with_the/", "We go to the Trader Joes at bayshore weekly to do most of our shopping but we usually need a few random things every week that they don't sell at TJs or that we like better in non TJs brands, and will pop into that target since it's so close. Random stuff like dish detergent, panko breadcrumbs, parchment paper, floss, etc. Usually just 2-3 items a week. And I've noticed that there is like always a bunch of random stuff out of stock there that's always in stock at all the other targets in like a 25 mile radius. Like last week we wanted to try some Olipop sodas and they only had like 3 flavors in stock with the rest just being empty shelves. They don't sell random stuff like woolite detergent that every other target sells, you can see on the app where else it's in stock and it's almost every other one. Sometimes they're just like randomly out of tortilla chips or some other random snacks idk. And then once something is out of stock there it's gone for like 2-3 weeks versus other stores it would be back in a couple days. I don't mind that much, it's just kind of odd and I was wondering if anyone else noticed the same thing or had any idea as to why??    "], ["Do reporting issues with food orders negatively impact drivers?", "5", "2", "2024-03-17T20:44:04.965000+0000", "https://www.reddit.com/r/doordash/comments/1bh833w/do_reporting_issues_with_food_orders_negatively/", "Hi guys, the other evening we ordered some fast food and our dasher messaged us as soon as he picked up the order letting us know that the restaurant's soda machine was broken so no drinks. All good and rest of the food was fine. I went to try to get a dollar or two credit for our missing drinks but my wife chimed in that it may come back as a negative mark against the driver. Is there any truth to this?    "], ["Soda Dungeon 2 Trouble With Progress Past PL 1.5M", "8", "8", "2023-09-02T15:39:17.970000+0000", "https://www.reddit.com/r/sodadungeon/comments/1685ncg/soda_dungeon_2_trouble_with_progress_past_pl_15m/", "false  Hello fellow gamers, Im asking anyone for knowledge in a build/guide for progression in PL's. I'm running NWOJHH and I have all mythics except complete armor sets for some. I used to run this team non-stop from PL lvl 1-1.5M but now for some reason I cannot go for more than 2 hours. Does anyone have a great progression build for PL's past 1.5M? My castle lvl is 1.2M also.    "], ["Trouble with starting fermentationâ\u0080¦", "8", "2", "2024-03-07T03:26:15.206000+0000", "https://www.reddit.com/r/mead/comments/1b8k4vg/trouble_with_starting_fermentation/", "Hello all, Newer mead enthusiast here. I finished one batch at the end of December and everything was by the books easy. However my last two batches have had trouble starting. The first I added an orange with tartaric acid and malic acid based on a recipe I found. Wouldn't start up after adding the activated yeast. So I took out the orange, nothing. Then I added baking soda based on a video I saw from someone else and it started right up. This last batch was the same thing with just honey and water. Nothing until I added some baking soda. Is there something I am missing? I use bottled distilled spring water from Walmart and this last batch I used that 5gal plastic water jug that you can get from Walmart. Any ideas?    "], ["Anyone else have trouble with GF bisquick?", "7", "1", "2024-02-01T15:40:05.784000+0000", "https://www.reddit.com/r/glutenfree/comments/1agduha/anyone_else_have_trouble_with_gf_bisquick/", "My biscuits taste strongly of baking soda. Did I get a bad batch?    "], ["Trouble with Getting the Movie Theater", "5", "0", "2024-05-24T00:21:29.320000+0000", "https://www.reddit.com/r/StardewValleyExpanded/comments/1cz7y6d/trouble_with_getting_the_movie_theater/", "I decided to do my very first Joja run (I want to see Morris' storyline), but I wanted the rewards from the CC, so I completed a few of the rooms for the bundle rewards. When I purchased the last bundle from Joja, I got the Joja cut scene and soda machine, but I can't buy the movie theater! I'm married to Claire and I want to see her 14 heart cut scene, and apparently I need the movie theater for it! Any ideas to fix this situation? (Also if anyone knows if I can somehow get Apples as a character too, that'd be great. All the info I can find about it is from a couple years ago)         "], ["Trouble with water", "7", "5", "2023-09-27T12:15:19.436000+0000", "https://www.reddit.com/r/autism/comments/16tiypx/trouble_with_water/", "Does anyone else have huge difficulty drinking water? I don't know if ARFID can be water too but it is really hard for me to drink water a lot of the time, to the point where I will regularly be nauseous or feel faint from the lack of it. It's both that I forget or am unable to recognize the thirst cue until extreme, coupled with the aversion to the experience of drinking water altogether. I've tried making water flavoured or making water different temperatures, or dying the water different colours or use a different cup but all those things only help a little bit and it always gets bad again. Sometimes I wake up in the middle of the night feeling so terrible and sick and then I realize I'm badly dehydrated and need to drink a bunch of water to try to feel a bit better before going back to sleep. It's so hard I've joked if I could be attached to an IV throughout my days that I would as it would make it so much easier and I would be healthier. I know I could just focus on drinking other things like juice or soda (those are somewhat easier for me) but I wish I could drink water because I don't want my sole liquid intake to be juice and soda if I can avoid it. Does anyone relate or have any tips? Thank you    "], ["Gen Adnive to those struggling with reducing or quitting soda.", "2", "4", "2023-12-23T03:20:23.851000+0000", "https://www.reddit.com/r/ADHD/comments/18owf78/gen_adnive_to_those_struggling_with_reducing_or/", "Invest in a SodaStream. It weened me off of soda AND helped me drink a gallon of water every day over the past 6 months. Just carbonate get some fresh lemon to slice and squeeze into the goodness and enjoy. Best decision ever gave t had an actual soda since August and I'm not missing it either. Only drawback now is that I dislike still water.    "], ["Struggling with this everyday..", "9", "5", "2024-04-30T08:08:17.789000+0000", "https://www.reddit.com/r/Marriage/comments/1cgnhv7/struggling_with_this_everyday/", "So my husband (29M) and I (24F) stay up very late (until like 5:30, 6 am ish) but when I come home early from work he was fine and all cuddly and joking around. However, some, if not most nights, his mood seems to change from relaxed and content, to upset and irritable. For example, today he asked me to get him baking soda for cleaning up around the kitchen, so I went and got a small box. Tonight, he uses it, baking soda everywhere.. him swearing and slamming things. I cleaned up the mess he made. He sometimes gets upset at me for his mistakes when he is this way and it's taking a mental toll on me... Any suggestions on how to cope with this?    "], ["Struggling with liquid stool again, not sure what to do this time. ", "20", "2", "2024-05-16T21:55:29.876000+0000", "https://www.reddit.com/r/carnivorediet/comments/1ctp252/struggling_with_liquid_stool_again_not_sure_what/", "TMI- I don't think the issue is my gut anymore, but this is almost 3.5 weeks now ive had diarrhea. Even though avocados gave me reliable for 4 days I didn't think they would be a long term solution. Granted not having to use the bathroom for days would be amazing again, I miss that. But I don't know how to get back to that point. Sidenote- Avocados are the only \"fruit\" I'm willing to eat, I hate soda.    "], ["Homemade Sinus Rinse - struggling with ratios", "1", "1", "2024-02-28T10:55:47.153000+0000", "https://www.reddit.com/r/Sinusitis/comments/1b23bg0/homemade_sinus_rinse_struggling_with_ratios/", "Recently ran out of my trusty NeilMed sachets so decided to make my own, following the instructions on the NeilMed leaflet (1:1 ratio bicarbonate of soda and non-iodized sodium/salt). Absolutely burned, no matter how diluted it was. Tried adding Xylitol the next time, with the same result. Have tried varying ratios of soda/salt/xylitol, and upping the amount of diluting water, but each attempt feels like I'm waterboarding myself with chlorine. (Still using the same distilled water as before) What am I doing wrong/how do you guys create your mixtures? I'm open to adding baby shampoo/iodine/etc since others seem to use those, but don't want to bother if I can't even nail the original formula correctly. Any advice? Thank you!    "], ["Struggling with fatigue", "3", "2", "2024-06-02T20:41:36.249000+0000", "https://www.reddit.com/r/WegovyWeightLoss/comments/1d6mv0l/struggling_with_fatigue/", "on my 3rd week of 1mg. Very little nausea. No vomiting or diahrrea. But man oh man am I exhausted. Too tired to exercise anymore (I used to enjoy working out a lot so it's a bummer). Now I just walk. I just want to lie in bed all day. After a full work day, I am so fatigued I can go right to bed without eating. I force myself to eat something- focus on protein. Eggs are easiest when I am this exhausted. I cant seem to ingest more than 1 black iced coffee a day anymore. And I used to love diet soda but can't stand it anymore. Energy drinks taste wretched now. Any tips for more energy? My partner is worried that I'm depressed. It doesn't feel like depression to me- it feels more like when I had mono as a teenager. Has anyone else experienced this? Currently lying down after I cleaned my whole house top to bottom.    "], ["Struggling with staying under 1500 on days in the office...", "7", "16", "2024-03-26T01:56:27.892000+0000", "https://www.reddit.com/r/1500isplenty/comments/1bnw10p/struggling_with_staying_under_1500_on_days_in_the/", "Hi everyone! I started counting calories again about a month ago. I've gone through counting cycles at this point probably 4-5 times, and every time I stop counting I gain weight. I've started to realize that I'm probably unfortunately someone who will have to always count to some degree which kind of sucks but it is what it is. Anyway, I've been doing just fine staying at 1500 or even slightly under on days where I'm at home. I WFH on Tues/Thurs so I don't have to worry much on those days, but M/W/F can be very difficult. I work in a corporate office with a laid back atmosphere and there is a kitchen filled with all kinds of crappy snacks. There are some healthy snacks and food items but it's like 70-80% unhealthy or high calorie options. Theres always tons of candy, pastries, and chips. I love the team that I work on but most everyone on my team doesn't eat as \"healthy\" as I do, and I get a lot of comments on how healthy I eat, but tbh I'm pretty moderate in terms of what I eat and wish I had the discipline to eat cleaner. I still eat unhealthy things like french fries, chips, pasteries... etc. on a fairly regular basis but most of it is at the office which is frustrating. Since my co-workers tend to not eat as healthy as I do, it makes it harder for me to make good choices because everyone around me is eating like piles of cookies, drinking soda every day, and stuff like that (I don't drink soda at all). I'm 5'2\" and weigh 137ish (down from 140) and carry most of my weight in my mid section. I do need to loose a bit especially since I have a lower waist to hip ratio so I'm more susceptible to health issues if I'm a bit overweight. I also just look and feel a lot better when I'm more around 125lbs range personally. I'm partially venting and partially looking for support. It's just hard to stay on track because my office caters food often and buys in special treats on a regular basis, and I have a history of binge eating so not being in a controlled environment is very difficult for me. I was doing really well the first couple of weeks but the past couple of weeks have been brought and I'm feeling a bit frustrated. Edit: I also have ADHD so impulse control is quite challenging.    "], ["I need support. Currently struggling with a major sugar addiction", "5", "4", "2023-09-06T04:35:34.828000+0000", "https://www.reddit.com/r/autism/comments/16banmg/i_need_support_currently_struggling_with_a_major/", "I'm a young adult, by sugar addiction I mean sugary foods and carbs (which turn into sugar in the body), not just a bunch of candy or something. I drink a lot of sugar free soda because it tastes sweet. I eat bread with hamburgers, I eat tortillas with burritos, I drink sugary coffee... I need help. I feel like I wouldn't be able to live without chicken nuggets, bread, tortillas, sugary coffee, sodas, sweets.. I'm at very high risk for diabetes and my mom already has it and I basically already have it I'm just not sick enough to be called a diabetic (got diagnosed \"pre-diabetes\" which is just diabetes but your levels arent dangerous) I'm overweight and its miserable. My body is so heavy and I try working out but get depressed and stop. I need help to stop eating so much sugar. I need recipes of healthy snacks and foods and high protein and healthy stuff but my mom wont help me. I mainly starve myself throughout the day but drink soda or coffee and sometimes have noodles or raviolis which are both terrible for me. Someone pls give me some actually diabetic friendly recipes (low sugar, low carb, no bread/tortillas, no starches, no seed oil etc)    "], ["Struggling with tank cycling because we added Fritzyme 7", "17", "1", "2024-01-11T18:58:48.833000+0000", "https://www.reddit.com/r/Aquariums/comments/1949er3/struggling_with_tank_cycling_because_we_added/", "We were letting our tank cycle naturally for 3 weeks and then my order of Fritzyme 7 came in the mail. We added it and it spiked our ammonia to off the charts! We waited 6 days and I finally performed a 25% water change...did nothing. Then I did a 75% water change and now it's finally at 2-4ppm. Has anyone had their ammonia spike to levels like that using added bacteria? The Fritz customer service wants me to add more bacteria to it and I'm like are you kidding me?? I either have a bad bottle or something else is going on. She did send me a good link that let me know I should raise my PH, so I added a little baking soda to it last night. We are trying to get an Axolotl in there, so I want to make sure it's 100% ready. If you look at my numbers in the images (first one is from 4pm yesterday and the second one is this morning at 10am), can you tell me what's happening and if I need to do anything? I appreciate any help offered, thank you!      This is 4pm yesterday       This is 10am today     "], ["Help Needed Baking Soda Hardwood Floors", "3", "0", "2024-02-03T16:43:53.462000+0000", "https://www.reddit.com/r/CleaningTips/comments/1ai0a0d/help_needed_baking_soda_hardwood_floors/", "I used baking soda on hardwood floors trying to at least get odor out.  The floors are very stained from dog urine and other dog stuff. I know eventually the hardwood floors will have to be replaced. The last tenant  must have kept the dogs inside for long periods of time. I am not ready to sell this unit right now. If I decide to put it on the market, will budget for replacement of wood flooring. Is there anything that helps get the dried baking soda of the floors. Have tried mopping but there is still a film of baking soda on floors. As I was mopping, it looked okay, but after it dried baking soda shows. The good thing is the house doesn't smell like dogs but the floors are hazy. Any help is greatly appreciated.    "], ["Seat post shim size help needed", "3", "1", "2024-06-03T19:22:54.497000+0000", "https://www.reddit.com/r/Bikebuilding/comments/1d7czd8/seat_post_shim_size_help_needed/", "Seat post is 27.2,  i ordered a shim but  it was too big. I managed to stick a cut piece.of soda can, and it worked.    "], ["Help needed with Ackerman Nikko G-Nib Fountain Pen", "14", "2", "2024-04-02T15:11:52.749000+0000", "https://www.reddit.com/r/fountainpens/comments/1bu167k/help_needed_with_ackerman_nikko_gnib_fountain_pen/", "It either is super dry and railroads when i flex, or drips ink on the paper. I cant seem to find the sweet spot for it when adjusting nib and feed ( not sure if its plastic or something else). I'm using it with parker quink ink btw Edit: so I've been having more luck by not placeing the feed all the way secured. so I had to play with the placement until I got it where I want. It flexs, just not at max flex. so I'll try making an overfeed out of a soda can later.                        "], ["Seeking a Durable Glass Measuring Cup: Help Needed!", "5", "1", "2024-03-12T23:09:48.533000+0000", "https://www.reddit.com/r/Gadgetry/comments/1bdbopo/seeking_a_durable_glass_measuring_cup_help_needed/", "My partner and I are on the hunt for a high-quality, 2-cup and 4-cup glass measuring cup. We prioritize two key features: Markings that last: We've encountered issues with markings fading after a short period (3 months). Durability: We desire a cup that can withstand the dishwasher, microwave, and everyday use without shattering. Our research: Borosilicate glass: We opted for borosilicate due to its superior heat resistance compared to soda-lime glass (commonly used in Pyrex now). Etched markings: While appealing for longevity, reviews mention these cups shattering easily. The question: Does anyone have recommendations for glass measuring cups (2-cup and 4-cup) that: Have permanent markings: Don't fade or wear off easily. Are dishwasher and microwave safe: Can handle everyday kitchen use. Are resistant to shattering: Offer reliable durability.    "], ["Help needed cleaning out a backpack- please read!", "1", "1", "2023-07-30T18:20:07.556000+0000", "https://www.reddit.com/r/Hunting/comments/15dsehv/help_needed_cleaning_out_a_backpack_please_read/", "I spilled a bottle of fuel stabilizer (stabil) on my kuiu icon pro backpack yesterday. It sat in it for around an hour before I realized what happened. I took it completely apart, washed it in dishsoap, then baking soda. Then ran it through the washing machine. Did nothing but make my washer smell. So I soaked it for a couple hours submerged in white vinegar and water. Still stinks... Should I just keep scrubbing it with baking soda paste and rinse or? Is hope lost?    "], ["Recipe help needed!", "4", "1", "2023-09-28T00:10:06.070000+0000", "https://www.reddit.com/r/culinary/comments/16u0rky/recipe_help_needed/", "Hello. So i use to work at this cafe. When making the banana bread we would add the baking soda to sour cream before adding it to the rest of the ingredients. I am wondering if anyone would know why. I cant remember now and i am at a new restaurant and i am working on new recipes for them. This jumped into my mind and i am hoping someone might know why!    "], ["[Help needed]", "3", "1", "2023-09-16T13:41:44.576000+0000", "https://www.reddit.com/r/manhwa/comments/16k7vz7/help_needed/", "Help for getting sauce please The MC getting isekaid every time he dies. Last time he died was while fighting against some dragon thing. Revived as a prince and the mother is not accepted as a concubine, because she was a maid before. He want a relaxing life but shows off every more and more of his skills from last 100ish rebirths. He created soda, sold it and made a lot of fortune. Magic, Sword aura, alchemy, dwarven blacksmiths. Thank you for your help. Really forgot the name :D    "], ["Help needed for first meeting", "1", "1", "2023-10-21T17:14:45.644000+0000", "https://www.reddit.com/r/acne/comments/17d7fnt/help_needed_for_first_meeting/", "I've a first meeting with my team in person. I've 2 major acne that look like bumps. I've today and tomorrow to treat it before the main day. Please please tell me what I can do to : 1.) treat it and reduce it 2.) cover it with makeup. Any hacks The products I have at hand are :   ordinary salicylic acid 2%   ordinary niacinamide and zinc   ordinary buffer serum   baking soda if that's helpful   Thanks and I really look forward to any kind of suggestions that have worked for you.    "], ["I need help making the decision, Should I buy a SodaStream?", "57", "23", "2023-10-26T18:52:24.889000+0000", "https://www.reddit.com/r/HydroHomies/comments/17h3m6w/i_need_help_making_the_decision_should_i_buy_a/", "Does it taste like water that's fizzy? Does it have that nasty salty sparkling water taste? Ideally I wanna use it with plain water and no syrup since I am trying to lose weight and I want cut down my sugar content. So, If I buy it would it taste like water that is fizzy or will it taste like shit? The SodaStream is very expensive in my country, so I need help making the decision. We drink coke like everyday, So will SodaStream be good? I dislike regular water, I prefer a fizzy drink since it makes digestion easier.    "], ["Need help with housing choice! (ACG hall and SODA dorms)", "10", "5", "2024-05-26T00:06:06.122000+0000", "https://www.reddit.com/r/WWU/comments/1d0p4nd/need_help_with_housing_choice_acg_hall_and_soda/", "Hi all! I'm transferring to WWU in the Fall and am currently trying to get a better idea of which dorm I want to stay in before it's my time for room selection. I'm currently trying to decide between Alma Clark Glass, somewhere else on the ridge (as much as I love the idea of suite, might go for a hall style SODA dorm), and a Birnam Wood apartment. Two things that would really help me pick a more solid direction; (1) Does anybody have any photos they'd be comfortable and willing to share so that I can get a better idea of potential layouts of the ACG rooms? I have looked at the floor plans as well as the 360 room view, but it would help to see some more pictures of how other students have their dorms set! (2) Which of the SODA dorms would you all suggest? They all seem so similar and would like to hear some pros/cons of them to make a more solid choice in case that's the direction I go in. Thanks so much!! Can't wait to meet some of y'all this Septemberð\u009f\u0092\u0099    "], ["First time baking, period, making Irish soda bread, need help!", "3", "0", "2024-05-24T23:13:48.275000+0000", "https://www.reddit.com/r/Baking/comments/1czy54x/first_time_baking_period_making_irish_soda_bread/", "I hope this post is okay, I've removed the affiliate links, but left the attribution because I don't feel right otherwise. tl/dr not a baker, tried the included recipe, crust came out super hard and overcooked, and the inside was still raw.  Don't know if I overworked the dough with the stand-mixer, made the dough ball too big, or one of a hundred other mistakes I don't even know of. I am a fair cook, and tomorrow I'm making my Irish Stew for my gaming group.  I love to have Irish soda bread with my stew, but outside of saint patrick's day, it is virtually impossible to find.  So I looked up a recipe, and chose the following. I measured out all of my ingredients, and started by hand whisking the buttermilk and egg.  I mixed the flour, baking soda, salt, and sugar.  I did not have any of the tools the recipe mention, when I searched the internet I read that it should be okay to use my stand mixer. I added the cold cube butter and began mixing with the coated flat beater.  I added the wet mix to the flour mix, and switched out to the dough hook, and added the raisins. I removed the dough, kneeded it for 30 seconds, formed it into a ball, and x'ed the top.  I used a buttered cake pan, and see it in the oven.  At 45 minutes I checked on it, and the crust was very thick and hard.  The center was still uncooked.  This was my first attempt which I assumed wouldn't work out, so I cut of the edges to taste test, and besides the overdone crust it was extremely tasty. So I've been wracking my brain and I could only think of two mistakes I made, though to a seasoned baker there's probably a lot more. The stand mixture may have overworked the dough. I made the dough ball too thick, which didn't let it cook more evenly. I'm planning on attempt number two tomorrow, any advice you could offer would be greatly appreciated. Grandma's Irish Soda Bread  5 Stars4 Stars3 Stars2 Stars1 Star 4.8Â fromÂ 451Â reviews   Author:Â Sally    Prep Time:Â 10 minutes   Cook Time:Â 45 minutes   Total Time:Â 55 minutes   Yield:Â 1 loaf    Irish Soda Bread is a quick bread that does not require any yeast. Instead, all of its leavening comes from baking soda and buttermilk. This Irish Soda Bread recipe is my grandmother's and has been cherished in my family for years. It's dense, yet soft and has the most incredible crusty exterior.  Ingredients   Â 1 and 3/4 cups (420ml)Â buttermilk*    1Â largeÂ egg Â (optional, see note)   4Â and 1/4 cups (531g)Â all-purpose flour Â (spooned & leveled), plus more for your hands and counter   3 TablespoonsÂ (38g)Â granulated sugar    1 teaspoonÂ baking soda    1 teaspoonÂ salt    5 TablespoonsÂ (71g)Â unsalted butter , cold and cubed*    optional: Â 1 cup (150g) raisins   Cook ModeÂ Prevent your screen from going dark Instructions    Preheat oven & pan options: Â Preheat oven to 400Â°F (204Â°C). There are options for the baking pan. Use a regular baking sheet and line with parchment paper or a silicone baking mat (bread spreads a bit more on a baking sheet), or use a seasoned 10-12 inchÂ cast iron skilletÂ (no need to preheat the cast iron unless you want to), or grease a 9-10 inch cake pan or pie dish. You can also use a 5 quart (or higher) dutch oven. Grease or line with parchment paper. If using a dutch oven, bake the bread with the lid off.   Whisk the buttermilk and egg together. Set aside. Whisk the flour, granulated sugar, baking soda, and salt together in a large bowl. Cut in the butter using aÂ pastry cutter, a fork, or your fingers. Mixture is very heavy on the flour, but do your best to cut in the butter until the butter is pea-sized crumbs. Stir in the raisins. Pour in the buttermilk/egg mixture. Gently fold the dough together until dough it is too stiff to stir. Pour crumbly dough onto a lightly floured work surface. With floured hands, work the dough into a ball as best you can, then knead for about 30 seconds or until all the flour is moistened. If the dough is too sticky, add a little more flour.   Transfer the dough to the prepared skillet/pan. Using a very sharp knife orÂ bread lame, score the dough with a slash or X about 1/2 inch deep. (â\u0080\u009cScoreâ\u0080\u009d = shallow cut.)   Bake until the bread is golden brown and center appears cooked through, about 45-55 minutes. Loosely tent the bread with aluminum foil if you notice heavy browning on top. For a more accurate test, the bread is done when anÂ instant-read thermometerÂ reads the center of the loaf as 195Â°F (90Â°C).   Remove from the oven and allow bread to cool for 10 minutes, and then transfer to a wire rack. Serve warm, at room temperature, or toasted with desired toppings/spreads.   Cover and store leftover bread at room temperature for up to 2 days or in the refrigerator for up to 1 week. We usually wrap it tightly in aluminum foil for storing.   Notes    Freezing Instructions: Â Baked and cooled bread freezes well up to 3 months. Freeze the whole loaf or individual slices. Thaw in the refrigerator or at room temperature, then reheat as desired.    Special Tools Â (affiliate links):Â removed affiliate links    Baking Pan: Â There are options for the baking pan (see Special Tools Note above). You can use a lined large baking sheet (with or without a rim), a seasoned 10-12 inch cast iron skillet, or a greased or lined 9-10 inch cake pan or pie dish. I don't recommend a loaf pan because the loaf may not bake evenly inside. This dough is best as a flatter loaf.    Buttermilk: Â Using cold buttermilk is best. Buttermilk is key to the bread's flavor, texture, and rise. The bread will not rise without it. If you don't have any buttermilk on hand, you can make a homemade â\u0080\u009cDIYâ\u0080\u009d version. Whole milk or 2% milk is best, though lower fat or nondairy milks work in a pinch. Add 1 Tablespoon of lemon juice or white vinegar to a liquid measuring cup. Add enough cold milk to make 1 and 3/4 cups. Whisk together, then let sit for 5 minutes before using in the recipe.    Egg: Â 1 egg adds richness and density. Feel free to skip it to make a slightly lighter loaf. No other changes necessary, simply leave out the egg.    Cold Butter: Â The colder the butter, the less sticky the dough will be. Make sure it's very cold, even frozen cubed butter is great.    Smaller Loaves: Â You can divide this dough up to make smaller loaves. The bake time will be shorter, depending how large the loaves are. An instant read thermometer will be especially helpful. Bake the loaves untilÂ anÂ instant-read thermometerÂ reads the center of the loaf as 195Â°F (90Â°C).    Find it online :Â https://sallysbakingaddiction.com/grandmas-irish-soda-bread/ Grandma's Irish Soda Bread    "], ["This game is freaking hard!!! Need help with the first boss near soda can vending machine", "18", "13", "2024-05-02T00:00:56.917000+0000", "https://www.reddit.com/r/AnotherCrabsTreasure/comments/1ci1g0t/this_game_is_freaking_hard_need_help_with_the/", "I died to this guy 12 times and only got him to half life a few times. I kind of went straight to him and I'm starting to think I might need to farm a bit and level up some? I've only leveled up once so far. Should I go farm or is there a strategy you all can help me with? I knew it was a souls-like but man this mother effer is hard. At least the bosses are so far. My strategy is to use the can to hide or dodge attacks but if he catches me just one time he's killing me in one or two hits. I go through the can so fast that I have to run to find a new can and he usually kills me before I can get into one. I'm excited for the game and I won't quit but if you all can help with some guidance it'll make things a lot easier and better for my health.    "], ["Need help collecting  schematics  I have some but not all need mostly the soda cans", "14", "3", "2024-03-20T01:25:50.864000+0000", "https://www.reddit.com/r/mw3zombies/comments/1bj1ibb/need_help_collecting_schematics_i_have_some_but/", ""], ["Need help to get baking soda off carpet", "7", "1", "2023-10-20T18:26:35.165000+0000", "https://www.reddit.com/r/CleaningTips/comments/17chyfz/need_help_to_get_baking_soda_off_carpet/", "So I had a bit of mold form and used Baking soda. I thought about vacuuming it up but don't want to ruin the vacuum by accident does anyone know if it would work without breaking the vacuum or if I should do it another way cause I'm also going to be using a carpet cleaner    "], ["Iâ\u0080\u0099m addicted to baking soda and I need help.", "1", "2", "2024-01-30T05:34:41.319000+0000", "https://www.reddit.com/r/Advice/comments/1aeh0up/im_addicted_to_baking_soda_and_i_need_help/", "I'm currently trying to find out if it's a drug. My head feels weird, and I don't know if it's because I'm overreacting, activating my anxiety, or if something is wrong. I've taken a hand full of baking soda, and now I feel like this. My eyes feel odd and I feel like I need to blink them. My head keeps hurting for a tiny bit. My mind doesn't feel right. I don't know how to explain it. I've heard something on Google about baking soda being related to crack. Please help me get off baking soda by recommending something. Something to help me to be free from this addiction.    "], ["Needing to buy lots of soda, beer, and wine for wedding. Need help finding affordable options!", "22", "8", "2023-08-03T14:08:48.925000+0000", "https://www.reddit.com/r/SiouxFalls/comments/15h5ac7/needing_to_buy_lots_of_soda_beer_and_wine_for/", "Our wedding is coming up in around a month and our budget is growing pretty thin by now. We are at a venue where we need to supply our own beverages and would appreciate any suggestions on where we could find some affordable options! For beer I was hoping to get a keg of a lite macro like Miller, and maybe something a bit fuller like Shiner or such. I'd have loved to have gotten a keg of something craft from a local brewery but was getting quotes around the $600 range for a keg which is too much for us. Besides a keg or two I was also planning on grabbing a variety of packs of various brands. For the wine we are not looking for anything special really. Boxed is OK, and if we could find some good deals on a sparkling wine of some kind it would be nice to have those for a toast (but it's not going to ruin anything if we don't). Thanks for any suggestions!    "], ["Need help on the best ways to stop drinking Pepsi , or any Soda/Pop", "0", "1", "2024-02-06T14:15:35.374000+0000", "https://www.reddit.com/r/Advice/comments/1akaqg0/need_help_on_the_best_ways_to_stop_drinking_pepsi/", "For any of u guys who used to drink pop like a lot a lot , what did u guys do to help deal with the withdrawals? And how long would the withdrawals last ? And should I just stop cold turkey or slowly drink less over a span of time ?  I won't say how , but I drink a pretty unhealthy amount of pop (mainly Pepsi) each week. And what's the best drink to replace it with during the withdrawals?    "], ["Best help for clogged shower drain. ", "10", "2", "2024-05-19T23:19:47.053000+0000", "https://www.reddit.com/r/QuadCities/comments/1cw1bw4/best_help_for_clogged_shower_drain/", "Looking for some help with a clogged shower drain, tried all the home remedies, plunger, snake, vinegar and baking soda, draino and things like it. Nothing works. Usually could get it fixed. But this seems to be the big one. Located in RI.    "], ["I need help for antiperspirant buildup on shirts. Nothing works!", "9", "2", "2024-03-27T20:15:11.825000+0000", "https://www.reddit.com/r/CleaningTips/comments/1bpbrpk/i_need_help_for_antiperspirant_buildup_on_shirts/", "I realised a couple of my shirts have solidified in the armpits. From what I can gather, they are antiperspirant buildup. But I just cannot get rid of them! I tried everything I found online, soaked it in vinegar, hot water, scrubbed it with baking soda, washed it so many times in the washing machine. I cannot get rid of them! The shirts are also black so I don't want to simply soak them in bleach. One of the shirts was already on its last leg so I don't mind doing experiments on it. I would appreciate any and all ideas! p.s. I think baking soda softened it a little? But it could also be the vigorous scrubbing I did which also tore a hole in the armpit... p.p.s I stopped using the deodorant to prevent this from happening in the future. But I would like to save the affected shirts since I really like them and wear them frequently. Edit: After many chemicals, rinsing, and scrubbing, only to slightly soften the buildup, I have concluded that it would be way more environmentally friendly to just throw them out and buy new ones. I give up. I will try to upcycle them.    "], ["help for art search", "4", "2", "2024-02-19T10:25:39.097000+0000", "https://www.reddit.com/r/honkaiimpact3/comments/1auk6c3/help_for_art_search/", "Looking for the pic where we see kiana smile adn the mei on soda can anyone help?         "], ["Help for Assistance with Offputting Smell", "2", "1", "2024-03-05T18:57:51.881000+0000", "https://www.reddit.com/r/CleaningTips/comments/1b7dazj/help_for_assistance_with_offputting_smell/", "My husband and I live in a building and have a very, VERY smelly neighbour and I'm hoping to get some insight on how to improve the smell in our home. We have 3 large air purifiers (kitchen/living area, bedroom and litterbox area) to try to mitigate the smell but on a regular basis I pick up a whiff of the neighbours smell on my coat or clothes at work - even freshly washed clothes.  I would like to find a solution to freshen up my closets eliminate the clothing smell while we work with the landlord on a higher level to deal with the smelly neighbour (this is ongoing in the courts and we are hoping it will be resolved soon with eviction of the smelly person). I was thinking of placing shaker jars (spice jars with large holes commonly used for parmesan) with baking soda in them in each closet/drawer space and a second jar with a cotton ball soaked in mint or lavender essential oil.  Would that be effective?  I was also looking into activated charcoal mesh baggies from costco, cedar blocks/hangers, air sponges, etc. but have had good luck with baking soda absorbing smells in the past. Any constructive input is most appreciated - thanks in advance! (Sorry for the grammatically confusing title - my brain and fingers were on different pages and Reddit won't let me edit)    "], ["Need some help for first dispute", "6", "0", "2024-02-01T20:36:48.239000+0000", "https://www.reddit.com/r/InstacartShoppers/comments/1agky5n/need_some_help_for_first_dispute/", "So i was recently dealing with a non tipper which said his items is missing i have all of the proofs that i delivered and notified the support about it too since i forgot  her soda and her detergent in my back seat i went back to deliver it and told support too about it when i was doing that how would i know if my dispute is rejected or accepted?    "], ["ELI5: Why does soda help with stomach pain?", "51", "162", "2023-12-16T23:10:35.004000+0000", "https://www.reddit.com/r/explainlikeimfive/comments/18k37p4/eli5_why_does_soda_help_with_stomach_pain/", "I've always recommended people to have soda after eating too much or when their stomach hurts. This is because personally, it works for me. I feel better after soda. I've always wondered why that's the case scientifically.    "], ["does baking soda help with LPR?", "30", "3", "2024-04-17T17:27:25.171000+0000", "https://www.reddit.com/r/LPR/comments/1c6frlo/does_baking_soda_help_with_lpr/", "does balm soda help with LPR symptoms like phlegm?    "], ["Help with my extreme baking soda volcano.", "19", "6", "2024-06-01T21:31:46.374000+0000", "https://www.reddit.com/r/chemistry/comments/1d5xer0/help_with_my_extreme_baking_soda_volcano/", "For my high school chemestry final, we are allowed to do anything chemistry related for our final grade. This final project includes an in class demonstration, and for this demonstration I'm making a ginormous baking soda volcano. My teach has said, offhandedly, that it's okay if my demonstration gets a little messy, so I'm trying to make the most explosive volcano I can. Besides Baking soda and vinegar, what else can I put in my mixture to make it more destructive?    "], ["Help with a soda fountain", "5", "1", "2024-04-25T20:43:07.031000+0000", "https://www.reddit.com/r/Soda/comments/1cd26ii/help_with_a_soda_fountain/", "Hello! I ( perhaps foolishly ) picked up a soda fountain used, and a few of the missing parts. But I'm struggling to get it working properly. Does anyone have loads of experience setting it all up that may be able to give me some advice. And if anyone's local to the ATL area, perhaps come help in-person?    "], ["Help with brewing soda", "5", "2", "2023-12-18T10:15:09.744000+0000", "https://www.reddit.com/r/Homebrewing/comments/18l5ee7/help_with_brewing_soda/", "Hello, I have birch beer extract that I got for Christmas last year. And I want to brew my own birch beer, however I once tried brewing my own cream soda and ended up making booze instead. Does anyone have advice that would be helpful? I don't know how to make non alcoholic beverages through brewing. I know it's possible it's just I don't know where to start.    "], ["Help with Soda Can Tabs (removing the circle piece?)", "5", "0", "2023-11-06T14:58:01.011000+0000", "https://www.reddit.com/r/crafts/comments/17p4leo/help_with_soda_can_tabs_removing_the_circle_piece/", "Obligatory \"I'm not a crafter\" but I figured this might be a good place to ask my question since the more \"recycle-y\" crafters would have probably figured this out already. If this is too irrelevant to be kept here I'd appreciate it if someone could direct me to a better place to ask haha I collect soda tabs. I just have a big jar of them, I don't use them for anything. But I hate it when this circle part in the middle (the hinge that connects the tab to the can) stays on after removal. It makes the tabs get stuck on one another in the jar and it stresses me out. Normally it's not a huge problem for me to remove the part in question, but I recently was gifted a sizable jar full of tabs with the part still on, and removing so many in a row is really hurting my fingers (and I'm out of band-aids haha). Does anyone know of a better way, or can maybe think of one? I want to get through these relatively soon but if I can't find a solution I'll just have to chip away at them little by little so I don't hurt myself.      the beloathed piece in question     "], ["Need tips to help with cleaning the soda stream bottles.", "8", "3", "2023-10-05T01:32:07.201000+0000", "https://www.reddit.com/r/SodaStream/comments/170520h/need_tips_to_help_with_cleaning_the_soda_stream/", "I bought dishwasher safe  bottles  and overtime so much gunk is at the bottom of the  bottle on the outside of the bottle between plastics, I can't clean it. It makes me very uneasy to use as it's hard to tell if it's in the bottle or outside the bottle and just looks nasty. How do I prevent this?  Or how do I clean this?    "], ["Soda Dungeon 2: Help With AutoRun team PL", "1", "3", "2023-09-03T16:54:34.498000+0000", "https://www.reddit.com/r/sodadungeon/comments/1691ykm/soda_dungeon_2_help_with_autorun_team_pl/", "Im having trouble with my autorun team in PL past 1.5 M. Im trying to have them run and get money but they keep dieing wayyyyy to early. Can anyone help me with teams and or scripts?    "]]