[["Struggling with keeping a workout routine ", "9", "2", "2024-06-25T19:24:26.939000+0000", "https://www.reddit.com/r/workout/comments/1doeea6/struggling_with_keeping_a_workout_routine/", "I play volleyball and have been trying to keep a workout routine to help me improve, but I just can't keep it going. I'm wondering if people have any good advice or tips for me to help me keep a consistent schedule. Also if people have good workouts to help with speed and vertical, please let me know!    "], ["Struggling with lower half clothing", "17", "8", "2024-01-28T01:20:13.985000+0000", "https://www.reddit.com/r/paintball/comments/1acqkpq/struggling_with_lower_half_clothing/", "Is there a consensus best slider shorts and knee pads? I tried the Crbn SC Pro bottoms and they didn't fit well (both M and L), so then got typical Nike volleyball knee pads but not sure exactly how they should sit on my knees? Are there definite better knee pads that fit well and don't move? I also tried the Dye and Crbn knee pads and they were way too much and not comfortable. For shorts, I have tried the XS and S/M HK army slider shorts and I'm definitely between sizes but enjoy the pads the shorts have. Does anyone know if they stretch a little after use? The S/M would slide down my legs after a couple seconds and the XS is a tad snug.    "], ["Anyone struggling with ball sports?", "9", "5", "2024-01-27T10:01:16.812000+0000", "https://www.reddit.com/r/aspergers/comments/1ac7la1/anyone_struggling_with_ball_sports/", "Somehow i have a natural jerk reaction when I play basketball. When the ball makes it's way towards me I have a natural tendency to shield myself (more specifically my head) from the ball cause I somehow get intrusive thoughts of my head getting crushed by the ball and massive amount of blood gushing out. Also when I play volleyball i can't get myself to use both hands to play thus I'm restricted to only using one hand. Can anyone relate? Is there anything I can do about it?    "], ["Does God find humor when humans pray to him while struggling with a poop?", "3", "0", "2024-05-16T14:54:03.702000+0000", "https://www.reddit.com/r/Christianity/comments/1ctetql/does_god_find_humor_when_humans_pray_to_him_while/", "Just wondered if these moments are funny  endearing or just neutral by Gods standards. My own thoughts is he has a â\u0080\u009coh those silly kidsâ\u0080\u009d vibe in regards to when you're really struggling after eating some fire chili. In the same house as those shirts depicting Jesus diving for a volleyball and the caption saying Jesus saves!    "], ["Struggling with my decision to get surgery", "22", "8", "2023-10-23T15:25:33.438000+0000", "https://www.reddit.com/r/ACL/comments/17en1nz/struggling_with_my_decision_to_get_surgery/", "I (almost fully) tore my ACL back in 2015. It was only diagnosed a few years later, at which point i was already back to playing sports (volleyball) on a decent level. I never got surgery and always considered my \"ACL Knee\" my good knee to be honest, my patellar tentonidis on the other knee was bugging me more. Towards the end of 2022 i twisted my knee while landing again. It was not very painful but audible and felt like i was walking sideways for a second. After i took a step it snapped back and was a little stiff and painful for a few days. In the last year ive been trying to get back into sports after doing various amounts of rehab. From none at all, to 2 months without volleyball. Physio/only gym, depending on the resources available. I managed to compete in beachvolleyball throughout the summer and didnt have any issues. My problem is this: Doing certain movements causes my knee to slightly twists/lock. It can happen in a milly second when im just skipping or it can get painfully stuck in a slow motion like hip 90/90s. ItÂ´s happened 4-5 times now, everytime (luckily) while doing these low impact things. My MRI scan still shows the barely visible ACL, a small meniscus tear, a zyst and a loose body. Some Orthopedics want to reconstruct my ACL, some fix the meniscus, some both, some tell me not to get surgery because i have no issues whatsoever in everyday life. I can bend, flex, retrain (slowly but it works). But i canÂ´t in good conscience perform my sport. If the twsisting happens again during a landing that might be it for my meniscus - but will a surgery help me with that? Has anyone else gotten surgery after such a long time? Im really scared it wonÂ´t adress my actual problem and just add new ones. Of course I will keep consulting my doctors but I was wondering if anyone was in a similar boat with their ACL journey.    "], ["Struggling with Spread", "18", "16", "2024-06-16T01:41:41.566000+0000", "https://www.reddit.com/r/CRPS/comments/1dgwwcz/struggling_with_spread/", "This is longâ\u0080¦.  And I guess part grief/vent and part asking how those of you that had spread manage the changes? I've had CRPS in my Left foot for almost 17 years.  As far as the left foot I've learned to live with it, adjust, keep up with all my treatments etc. (you name it I tried it, and still do a very aggressive treatment regiment) I went through the grieving process (I was diagnosed at 21â\u0080¦. To say my life changed drastically is an understatement) I had to relearn to walk, give up 5-speed cars, dirt bikes, skiing, adult softball and volleyball.  I gave up a very high stress high reward career and went on disabilityâ\u0080¦ i had to come up with different hobbies, and learn to deal with help where I used to be an extremely independent successful person, and my social life changed and shrank in ways I never expected. Through all that I really thought I was okay, and for the most part managing well. A few years ago I had minor spread to my right foot after a break, but I'd classify it as minimal, my current treatment regiment seemed to work. Well in the last year I've broken and torn everything in my R ankle and gone through 3 major reconstruction surgeries.  Through all that the CRPS in my r leg spread and worsened so so much.  Even with treatment I'm struggling mentally and physically. My care team has been great, and trying to be aggressive with CRPS treatment while giving my ankle time and space to heal. But I feel like I'm right back where I was 17 years ago. Maybe even worse offâ\u0080¦ because this time I KNOW (and my support system knows) what is at stake, and how drastic the changes can and probably will be. There is talk by my OT and PT of not being consistently able to walk, and preparing for that.  (Wheelchair, revoking my licenseâ\u0080¦.  Trying to find physically appropriate hobbies) I know I should dwell on what could be, or what could happenâ\u0080¦ but I can't seem to stop. Bottom line: I'm scared, and I feel trapped and I barely recognize myself from pre and post CRPS diagnosis. I honestly don't know if I can do the adjustments a second time, I lost/changed my whole identity the first time and barely came out the other side. So thank you for reading my pity party essay, and those of you who went from managed to massive spread.  How did you manage? How did you deal with and handle it?    "], ["Need help with Volleyball (and life in general)", "0", "1", "2024-05-12T16:46:14.015000+0000", "https://www.reddit.com/r/Hypermobility/comments/1cqc4te/need_help_with_volleyball_and_life_in_general/", "I was recently diagnosed with bilateral shoulder hypermobility, and, by connecting some dots (half-sprained my knee by shooting a football too hard, always had crazy range of motion in my squats and with my fingers, popped out wrist because my tendons dont support the bone in which affects doing forearm exercises, and random pinching pain in my back) i realized i probably am hypermobile in a lot more joints. I absolutely love and adore volleyball, had i picked it up sooner (im 17, started playing with my friends last year) i would've definitely wanted to dedicate my life to it. Im aware my traumatologist will tell me to quit, but i refuse to give up a dream hobby over something i was born with. I frequently subluxate my shoulder, last time was the most severe one as i usually recover in a couple of weeks but this time it's been almost 2 months and i still sometimes get instability/pain in certain ROM. I haven't reached the point where hypermobility makes my life hell, i can run jump and all of those things just fine, so i want to start working to prevent it from getting worse.  Are any of you dealing/have dealt with similar problems? what measures did you take to imrpove your situation, any certain unconventional muscles trained for stability, form changes, things like those? I wasn't very sporty until last year, when i discovered the burning passion i had for volleyball, so i want to keep practicing sports for most of my life.    "], ["I need help with choosing volleyball shoes", "0", "2", "2024-02-04T20:29:48.945000+0000", "https://www.reddit.com/r/VolleyballShoes/comments/1aixnn8/i_need_help_with_choosing_volleyball_shoes/", "I am thinking of giannis immortality 3 or Mizuno momentum 2 W I am 186 cm and can't jump very high for a middle blocker so I rely on your choice and help.    "], ["Need help finding sponsors to fund Jordan's Women Volleyball Team", "2", "3", "2024-03-01T19:40:03.102000+0000", "https://www.reddit.com/r/jordan/comments/1b43cbo/need_help_finding_sponsors_to_fund_jordans_women/", "Can't believe I am coming to Reddit for this but sports federations in Jordan truly failed us. Basically the Jordan volleyball Federation is refusing (or are unable) to fund the expenses for three university and national team players to participate in the Arab Universities Leagues in Morrocco for Beach Volleyball. The only solution they gave us is to go look for sponsors ourselves even though that is not a player's responsibility. Besides the point.. if anyone knows how we can reach out to companies or what companies we can reach out to or just have any advice in general we would really appreciate it. Thank you.    "], ["Need help finding my teenager \"plus size\" volleyball gear!", "15", "15", "2023-08-08T20:41:20.814000+0000", "https://www.reddit.com/r/PlusSize/comments/15ltqiu/need_help_finding_my_teenager_plus_size/", "Basically the title. My teen daughter is plus size and played volleyball last year and we barely found her volleyball shorts, they basically looked like Spanx on her, and knee pads were a joke. I thought I had found some on Amazon but when I did the measurements her legs were 3inches too wide. Any suggestions?    "], ["Need help with my 7U volleyball team", "5", "2", "2023-09-16T16:57:36.122000+0000", "https://www.reddit.com/r/volleyball/comments/16kcckp/need_help_with_my_7u_volleyball_team/", "Hey guys, I don't really know where else to go with this but I thought I'd ask here first. My wife and I are coaching a 7U girls volleyball team this season, and neither one of us has ever played before. Our team is super talented though -- practices are efficient, girls do really well, have fun, etc. We're all having a blast. Except when it comes to games. For whatever reason, whenever the girls get in front of their parents/friends/randos, they psych themselves out and can't even hit the ball over the net on an underhand serve. Because of that, we're getting smoked every game and the girls are starting to get really discouraged no matter how much we try to encourage them. Anyone have any tips on how to help girls with this at this age range? I don't really think fundamentals are the problem, but the mental game for 7U girls is not something I really know how to handle. TIA! Edit: We finally won today! Thanks everyone for their advice.    "], ["Need help/advice getting my teenage daughter into volleyball (please read entire post)", "17", "0", "2023-09-17T02:45:31.276000+0000", "https://www.reddit.com/r/nova/comments/16kpjip/need_helpadvice_getting_my_teenage_daughter_into/", "I have a 13 year old daughter who wants to start playing volleyball but is too self conscious to play with the kids in her school because she's brand new and when she attempted to play last year with them, the girls were so mean to her, she ended up quitting because she was tired of coming home crying every day.  So I'm trying to figure out how to make this happen for her. Where do I start? I thought about hiring somebody private to start coaching her on the basics and get her in  better shape but I can't find a single person out there that I can afford. Please, any advice is welcome.    "], ["Nose got hit by volleyball after 6 weeks of septorhinoplasty! Need help?", "12", "2", "2023-09-26T06:36:09.071000+0000", "https://www.reddit.com/r/PlasticSurgery/comments/16sg72e/nose_got_hit_by_volleyball_after_6_weeks_of/", "I'm freaking out as I was playing volleyball yesterday as I have stayed in recovery for 6 weeks after my surgery. I got it on the side of my face with no direct contact on my nose. Atleast if it did I didn't feel it. I haven't felt any pain and I am not bleeding. But today I woke up and am finding it hard to breath on the side of my face that got it. Could it just me inflamed or swolllen due to the impact, or did I mess up? Furthermore, I can't see any difference with how my nose looks and I don't see any curve.    "], ["Need help improving my skills", "5", "0", "2024-04-04T22:22:43.880000+0000", "https://www.reddit.com/r/volleyball/comments/1bw0wob/need_help_improving_my_skills/", "Hey guys, This is my first post on r/volleyball , and I have looked around and found out this might be the best online place for beginners like me. I am a beginner in volleyball; I have played volleyball for 2 months in my middle school, and I am thinking of making it a habit now. The past 2 weeks, I have been playing beach volleyball, but I am not really good enough. I am a fast learner and get things quickly. I play throwball with my friends at weekends. I am 5'8\" tall, and I don't want to play volleyball in competitive leagues. I want to enjoy the game. I want you guys to help me get better at the game; I will be uploading my clips soon and also engaging in conversations so that I can learn more about this game and improve. And I wish to make friends too, by the way, I live in Tempe, Arizona, so if anyone resides there, let's play together    "], ["Need help plz", "9", "2", "2024-05-17T08:09:23.241000+0000", "https://www.reddit.com/r/thespikegame/comments/1ctzyif/need_help_plz/", "Soo... I recently started playing the game (loved it) but, I don't know what to upgrade, or how to get good players, or how to even get more volleyballs. I want more coins for upgrades, but I don't know how to get more coins ð\u009f\u0098\u0094. Plz help I also want to know which players are the best for each position, and how to get them.    "], ["I NEED HELP GETTING TO THE BALL", "14", "7", "2024-06-13T19:53:01.834000+0000", "https://www.reddit.com/r/beachvolleyball/comments/1df809t/i_need_help_getting_to_the_ball/", "My friends have always said i look stiff and rigid playing volleyball and I always have the issue of never getting to the ball on time normally the ball is sent behind me and in or just slightly far out from me but I can never recieve those or move to it or read  even when it's short I have to dive. I AM 15 SO THE BALL is not being smashed but I just don't know what to do. What am I doing wrong and how can I improve it? Because I do not lack athleticism wise    "], ["Need help for my mini me", "3", "0", "2024-04-27T22:46:21.299000+0000", "https://www.reddit.com/r/Dolls/comments/1cer855/need_help_for_my_mini_me/", "Hi, i want to make a mini me out of a barbie but am unsure which body type fits me the best. I'm 1.83m (6') tall; would you use a regular or tall body for me?    "], ["Offering Spanish , Seeking Portuguese | Help for my Rio Trip!", "3", "2", "2024-06-14T00:17:30.458000+0000", "https://www.reddit.com/r/language_exchange/comments/1dfdv07/offering_spanish_seeking_portuguese_help_for_my/", "Hi there! I'm Juanpa I'm currently gearing up for a trip to Rio de Janeiro and would love to brush up on my Portuguese before I go. In exchange, I'm more than happy to help you with Spanish! A bit about me: I'm currently studying business management at university, I'm a cat lover, and I have an eclectic taste in music ranging across all genres. When I'm not hitting the books, you can find me hitting the gym or catching up on sports, especially F1, tennis, football, and volleyball. If you're looking for someone to chat with and exchange languages, don't hesitate to reach out! Let's help each other improve our language skills while making new friends along the way. ð\u009f\u0098\u0084    "], ["Help with the volleyball game ", "17", "5", "2024-06-18T00:58:58.613000+0000", "https://www.reddit.com/r/castlecrashers/comments/1die539/help_with_the_volleyball_game/", "Is there a way to beat the volleyball game in the castle roof level  with just 1 player ? I'm playing on ps5 don't know anyone else who plays    "], ["Help with skintone! (#165 & volleyball player)", "2", "1", "2024-06-22T08:21:36.783000+0000", "https://www.reddit.com/r/Barbie/comments/1dlqwua/help_with_skintone_165_volleyball_player/", "Hello! Quick question~ The Barbie Fashionista #165 (wheelchair, standard body) has the same skintone as Barbie Volleyball player (purple & white outfit, tall)?    "], ["Help with volleyball colessuem", "2", "4", "2024-03-28T15:39:00.686000+0000", "https://www.reddit.com/r/thespikegame/comments/1bpylle/help_with_volleyball_colessuem/", "Does fighting the yellow stages give you more currency at the end? I don't see a point in doing some of them if it's boss stages because it's not adding to my count. is it meant to add to the total?    "], ["Help with some volleyball vocab", "1", "1", "2023-11-23T07:02:54.127000+0000", "https://www.reddit.com/r/volleyball/comments/181vdns/help_with_some_volleyball_vocab/", "I have been playing as a setter for a while now and everyone seems to love my sets. I only have one problem. The words for setting a ball to another player. So i learned some ones like 1, which is one meter Quick Pipe, which is back row Can you give as much words you can think of that relate to setting? There are some numbers like 9 or something. Also i just discovered that there are different rotations, how does that work? I thought it was just rotating to one side and thats it. Explain please, thanks :)    "], ["Hey everyone. Can anyone help with our volleyball game for school?", "4", "0", "2023-09-01T09:36:27.420000+0000", "https://www.reddit.com/r/scratch/comments/1672h8q/hey_everyone_can_anyone_help_with_our_volleyball/", "I need for the volleyball start and bounce off an animal on the left hand side back to the goat. If the goat touches it it bounces back to the other animal's side. We don't know how to program this and when we request it to glide to a random position it just stops somewhere random without reaching the animals. Thank you so much    "], ["Help with clearing road to pro", "4", "1", "2024-05-18T08:39:56.042000+0000", "https://www.reddit.com/r/thespikegame/comments/1custfa/help_with_clearing_road_to_pro/", "Basically to get flames and unlock the volleyball colosseum I need to clear road to pro. I beat road to pro with nishikawa (I quit mid game when playing awakened siwoo, idk if this is the issue) but it didn't unlock these things. I then beat oasis once in the final but that still didn't fix the problem. They are still locked. What can I do?    "], ["Help with Hamilton Recreation", "5", "3", "2024-04-12T21:19:27.927000+0000", "https://www.reddit.com/r/Hamilton/comments/1c2km18/help_with_hamilton_recreation/", "I simply want to view and book any available pickleball or volleyball court. Sorry for the rant but the website is absolutely terrible. It might be good to register into the programs but can't view the amenities of different recreation centres. Who is even handling it? I tried filing a bad experience and the page times out. Can someone please help? Is it worth documenting bad experience and flagging everything with the local MP? This is my 8th attempt to simply view, book and use the website. What does the below screenshot mean and how can I book this time?         "], ["Help with clothes", "22", "7", "2024-02-20T09:35:05.745000+0000", "https://www.reddit.com/r/paintball/comments/1avdqh3/help_with_clothes/", "Hey, everybody. I've been playing paintball for a while now and am finally thinking about clothing. First of all, I'm unsure about what kind of clothes to choose. Initially, I considered camouflage, but I liked it the least and would prefer separate pieces rather than overalls. So, I've come to the conclusion that I need both a top and a bottom. However, I can't afford specialized paintball clothes due to budget constraints. Consequently, I'm contemplating whether I can replace them with analogs or clothes from other sports. I'm planning for the spring season, intending to wear thermal underwear and sports pants underneath (even though I'm not particularly fond of them, I understand that paint can wash out?). On top, I plan to layer thermal underwear, and a T-shirt with a sweatshirt, and purchase a tourist fleece jacket. What are your thoughts on this? Additionally, can I use a headband from a sport other than paintball? How about kneepads and elbow pads? Can I substitute them with volleyball kneepads or something similar? Thank you all for your advice.    "]]