[["the problem with Lexi and other weight loss \"influencers\"", "50", "103", "2024-02-05T21:39:00.475000+0000", "https://www.reddit.com/r/fatgirlfedupsnark/comments/1ajsef9/the_problem_with_lexi_and_other_weight_loss/", "huge trigger warning for mention of eating disorders! my mom has been following since around 2016/2017 when she started posting? i began following her in like 2018 because my mom was always reposting her stuff and was doing her DietBets. i found a couple other weight loss influencers through her who's stories were similar to hers, how miserable they were being overweight and had these wake up calls and lost a ton of weight quickly by simply \"changing their lifestyles.\" i see a lot of speculation on here that Lexi did have surgery which i can believe. i just can't see how someone can eat their way to her weight, then just magically start eating less and losing the weight and keeping it off. she had to have been severely addicted to food, it wouldn't have been easy naturally without some sort of therapy, which i have never seen her mention. one of the weight loss influencers i found through her admitted about 3 years ago that she was eating only 400 calories a day and working out 3 hours a day, and would also make herself throw up. i really felt for her, but at the same time she was preaching to her audience about how she was so healthy for losing weight when she literally developed bulimia? and i'm sure a lot of influencers dealt with the same issues but aren't sharing about it, which they aren't obligated to but i don't feel like it's fair to make your audience think they can lose weight as quickly as you just by eating better and working out. i'm not saying weight loss can't be done that way, but most people won't admit those drastic changes (i'm talking 200+ pounds in a year) were made possible by surgery or starving yourself.    "], ["I need help. I have a big problem with overeating. I know CICO is a major component of weight loss. But what I feel I really need to help me is an actual meal plan with portion sizes.", "11", "6", "2023-11-22T05:21:16.176000+0000", "https://www.reddit.com/r/Weightlosstechniques/comments/1811ner/i_need_help_i_have_a_big_problem_with_overeating/", "Can anyone suggest some resources to help me? High volume, low calorie recipes maybe?    "], ["I love food too much lol. I have a real problem with eating. I weight 223 at 5â\u0080\u009910. Iâ\u0080\u0099m not fat but I hate my weight", "48", "35", "2024-01-18T02:46:01.275000+0000", "https://www.reddit.com/r/fasting/comments/199fhu2/i_love_food_too_much_lol_i_have_a_real_problem/", "My true weight is between 175-185. I literally just want to cut the fat off my self. I've been on a weight loss yo-yo for yearsss. I've been in shape ny whole life due to being an athlete. Once I stopped playing sports in 2016 I've just been on a yoyo and I'm sick of it!!!    "], ["Is there a problem with my scale?", "3", "3", "2024-03-08T05:56:26.260000+0000", "https://www.reddit.com/r/loseit/comments/1b9gsbe/is_there_a_problem_with_my_scale/", "I have lost weight in the past but never had this beforeâ\u0080¦I will lose a pound and then stay at that exact weight, including ounces no fluctuations at all for 3 days and then drop a pound but keep the same number of ounces. I used to stay at around the same weight and then have a whoosh but this is the exact weight down to ounces and doesn't change if I weigh in the morning, evening, any time of day. I'm wondering if I need new scales or if this is a common thing I'm not aware of. I know weight loss has plateaus etc and that's not what I'm askingâ\u0080¦I just find it hard to believe that I'm EXACTLY the same weight for an entire 3 days?    "], ["Problem with abs workout ", "3", "1", "2024-06-13T09:03:13.774000+0000", "https://www.reddit.com/r/GymMotivation/comments/1deuig1/problem_with_abs_workout/", "Hi, 30yo male. 17 years of training. Have problems with abs exercises. Every time I train rhe rectus abs part - the \"pacs\" - I have very painful muscle cramps. It's just a self torture. I always do squats and any variations of deadlift without the belt. For some reason, my performance ramps down wwith the belt, and, again, high risk of rectus muscle cramp takes place. Like the only abs exercises I can do without excruciating pain (because of cramps or backpain afterwards) are stability work (like Kb swings, farmer walks, marching with kb, rubber band counter-rotations and so on). But, the crouch variations are big nono for me. I don't have problems with the strength of my abs, but they are flat. You know, it looks like I never ever trained the rects of abs. What can I do to grow some abs? (Dieting and weight loss is obvious to make them visible. Question is about the muscle mass building.) The serrations look like that: 2 smaller triangles on the top, then the big flat all wway to the bottom, with only a \"scratch\" of a insertion.    "], ["Anyone else have a problem with cold sores?", "13", "3", "2024-01-10T17:36:44.622000+0000", "https://www.reddit.com/r/Mounjaro/comments/193dyfj/anyone_else_have_a_problem_with_cold_sores/", "Hi, all! I've been on my Mounjourney (ð\u009f\u0098\u0082) for about 8 weeks now, and everything has gone swimmingly except for one problem: a cold sore. I haven't had one since high school, but the second day after my shot, the side and bottom of my lower lip started tingling and itching, and day four it was a full-blown cold sore on the corner of my mouth. I immediately started taking L-lysine (1000mg/day) and using Abreva, and I have done two rounds of oral valacyclovir (Valtrex). The Abreva takes away the itching and keeps it from blistering. Each round of Valtrex knocked it down for 4-5 days, but it doesn't completely go away. I know it's not dehydrationâ\u0080\u0094ya girl stayed very well hydrated before MJ and I'm even more conscious of staying hydrated now. It's not a reaction to new cosmetics/soap/detergent/etc. I think it is directly correlated to the slight immunosuppressive effect of MJ. Has anyone else had this problem? If so, has anyone successfully healed their cold sore completely? I really don't want to just live with a cold sore for the entirety of my weight loss journey. Thanks in advance!    "], ["Problem with a friendship (partially) based on food enjoying and not being the skinny ones", "2", "7", "2024-03-13T12:55:57.041000+0000", "https://www.reddit.com/r/intuitiveeating/comments/1bdqrlp/problem_with_a_friendship_partially_based_on_food/", "Hi everyone! So I have a friend, a very close friend, with which I have always talked about weight, struggling with body image, being the \"fatties\" of every group of friends we have been into etc... Food has also always been a great source of bonding, for many years we use to go out eat once every one or two months and eat together enjoying the judgment-free moment between us two. This happened regularly some years ago, now it's less often but sometimes it happens. Since then, I've joined intuitively eating, recommended the book to her and we've talked about it a lot. I've realized how our going out and eating was to consider a form of restriction and binging in someway etc... I've made very big progress in this way: stopped yo yo dieting, started exercise for the purpose of wellness and all this has brought some weight loss and better shape (nothing astonishing). My friend has always been bigger than me and, even if she 100% agree to i.e., she hasn't really changed after reading the book. The problem is: when we go out and eat she usually go back to our old track \"do you want icecream too?/ I want another portion/ I know how much you love this so you will surely want more\" etc and its so hard for me to disengage due to the many times she has told me how umiliating it was for her to be the only one eating or taking a second plate. At the same time I don't want to eat if I'm full and I really want to respect and honor my body. What should I do? Should I eat the icecream not to hurt her feelings? Or should I learn to say no? Thanks    "], ["Digestive enzymes seem to help, does this mean I have a problem with my pancreas? Freaking out.", "8", "2", "2023-11-18T04:24:52.747000+0000", "https://www.reddit.com/r/SIBO/comments/17xybw9/digestive_enzymes_seem_to_help_does_this_mean_i/", "My story goes back over a year but I'll keep it short. Highly suspected SIBO by my gastro, but have not tested as he deems it unnecessaryð\u009f\u0098© My main symptoms are malabsorption, especially fat, yellow oily stool, gurgling, extreme bloat, pale skin, fatigue, nausea, feeling malnourished and sickly, stomach aches usually upper towards left and weight loss, I'm quite thin. I tried a round of antibiotics and they worked, I was good for 3 months and after the flu symptoms came back. I was convinced I had something wrong with my pancreas, maybe cancer (I have massive health anxiety). Had all these tests done: Fecal elastase normal above 500 All pancreatic enzymes tested through blood and all normal, liver was normal, crp was normal, a Ct scan of abdomen showed normal pancreas and gall bladder, colonoscopy totally normal, gastroscopy showed mild esophagitis from reflux. My gastro said it's not my pancreas or gallbladder and said it's most likely SIBO. Why then, when I take digestive enzymes it seems to help with SIBO symptoms? Does this mean I could have issues with my pancreas? Thank you for taking the time to reply! From and anxious, exhausted and defeated mom ð\u009f¥¹    "], ["Problems with Expenditure and weight loss", "20", "0", "2024-06-01T05:48:37.934000+0000", "https://www.reddit.com/r/MacroFactor/comments/1d5g40x/problems_with_expenditure_and_weight_loss/", "I've come back to macrofactor after being away a bit. I'm tracking everything I eat and weighing myself daily. I also track all my exercise but I know MF doesn't use it. The problem I have is that MF keeps reducing my expenditure. I think because my weight hasn't been going down. It's at the point where it's estimating my expenditure is about 2100 where it's actually about 3100 (according to apple watch and oura ring). So the 1750 calories or so it wants me to eat is just two little for me. I also say this just intuitively.... I'm 6'2\", weight 2017, and am exercising 2-3 hours a day or more, burning   an average of 1,292 in active energy per day, with a resting energy of 1822, yet my MF expenditure is 2109 kcal and it's suggesting I eat 1750. To add insult to injury, I totally see why MF is doing what it's doing based on my weight trend and calorie intake. I've only lost about 0.4 lb in the past week despite an on paper deficit of over 10,000 calories. The last time I used MF I didn't have this problem and it estimated my expenditure at like 3500. Part of the issue may be that I started taking creatine soon after I went back to using MF, so I probably put on some water weight while only eating about 2100 calories per day. But that started nearly two weeks ago so I would have thought my expenditure would have turned around by now. I'm concerned MF is suggested too few calories for me and it's hurting my metabolism and overall something seems off since 2109kcal is basically my resting metabolism and I exercise a massive amount. Thanks for your thoughts!    "], ["Skins problems with no weight loss", "3", "1", "2024-06-17T15:36:27.925000+0000", "https://www.reddit.com/r/WegovyWeightLoss/comments/1di11wu/skins_problems_with_no_weight_loss/", "I started with zepbound which worked great and I lost 16 lbs. I continued to eat healthy and exercise with heavy lifting 4-5 x per week. Had great results with no side effects. Then I couldnt get it anywhere and I switched to wegovy bc it was what I could get. There was 3 weeks in between and I maintained the weight loss. Fast forward 3 weeks on wegovy and I gained some weight back, only about 4 lbs which could be water etc but my skin is like rubbery. I've continued to work out. I am baffled. I want to get back on zepbound but it's so damn hard to find. Anyone else have skin issues with no weight loss? I did read losing muscle mass was possible but I work out I don't understand    "], ["gall bladder problems and other problems with rapid weight loss", "3", "0", "2024-06-17T02:50:45.545000+0000", "https://www.reddit.com/r/intermittentfasting/comments/1dho1l8/gall_bladder_problems_and_other_problems_with/", "If you have a lot of weight to lose look here: https://www.drberg.com/blog/gallbladder-problems-and-prolonged-fasting     "], ["More problems with weight loss", "19", "5", "2023-07-07T11:38:31.490000+0000", "https://www.reddit.com/r/Hypermobility/comments/14t4stv/more_problems_with_weight_loss/", "I need to lose weight.  But every time I do I find that is when I get the pain and fatigue and my joints feel unstable. I know I have seen one research article about this but it was after bariatric surgery , but nothing else. Does anyone else have this problem?    "], ["Problems with weight loss on Topiramate", "12", "6", "2023-10-26T02:58:57.669000+0000", "https://www.reddit.com/r/Epilepsy/comments/17gmrm3/problems_with_weight_loss_on_topiramate/", "I've been taking Topiramate (150mg 2x daily) along with Kepra (1000mg 2x daily) for about three years now.  I know it's also used off label in addiction treatment and weight loss but never thought much about it until I obviously started losing weight. For context, I've lost about 120lbs in two years without really trying.  I have no appetite.  Great news except now I'm at that point of being almost under weight and worried what may happen. I'm on a wait list for a neurologist but it will take up to two years, not sure what to do? Will it stop once I don't have excess body weight to lose?  Will it balance out? I stress a lot and it makes things worse. Any advice will help.    "], ["Sudden hair loss and problems with weight gain on Creatine", "6", "3", "2024-02-26T16:37:41.322000+0000", "https://www.reddit.com/r/Supplements/comments/1b0lx63/sudden_hair_loss_and_problems_with_weight_gain_on/", "Hello, I want to share my experience with creatine, weight gain, hair loss and get some recommendations if that's possible. (Male, 18) I started working out around a year ago. I was extremely skinny (55kg) and it's hard for me to gain weight, even though I consume enough calories, even more that I should. That's what basically lead me to taking creatine, as I've read it can help you with muscle gain (I understand it's not a permanent solution). I started somewhat over a month ago, before taking creatine I already managed to go up to around 67 kg (but ideally I want 75-77). I took it every day around 5-7g (no loading phase). And been working out 2-3 times a week. And the thing is I haven't noticed much change. I wasn't more energetic or lifting significantly more. I haven't noticed much muscle gain as well. Visibly my muscles doesn't look bigger. I did gain maybe like 2kg since i started taking creatine (now I'm around 69kg, but it's hard to track, since I can get different measures even thoughout the day). And now it's the hair loss problem. I went to the shower a few days ago and noticed 4-5 times more hair loss than I usually have. I have a long hair, so it's obviously noticeable. Anytime before it wasn't like that. I shower every second day, I would've noticed that. These 4 days my hair is shedding like crazy. If I run my hand though my hair, I will have like 5-10 pieces of hair on my hand. I think it's getting more thin as well. I'm really stressed out and getting depressed now. Obviously, I don't want to lose my hair. I have NO history with baldness in my family. Even at elderly age my relatives can grow hair. And people usually compliment my hair and say it's full and thick. I only did some surface level research on creatine beforehand (yes, it's rather my fault). But obviously it was some bs about that \"it's well studied and there is actually no scientific proof that creatine can cause hair loss, so it's safe\". Now I understand that it causes high DHT levels which can lead to hair loss. Sure, I can't be 100% that it's creatine causing it in the first place, but I never had anything like that before. And I haven't added anything new to my routine besides creatine. I'm never touching that thing again. I'd rather stay skinny (even though creatine didn't help me to gain weight anyway) than lose my hair and damge my mental health. And wouldn't even touch that stuff If I knew before. I don't know what to do now. Visually it's not that visible, cuz long hair, but shedding like never before. I've read it takes 4 weeks for creatine to leave your body. But is there anything I can or should do now? I been using rosmery oil a few times a week, but I've been doing it even before I used creatine (for my eyebrows mostly, but I applied on my hair as well), I think it darken my eyebrows a bit but rather then that not much (I'll still continue to use it anyway). And after all I still want to gain muscle weight and hit the gym. I'm not sure if I should now. Honestly, hair might be my first priority. I've been feeling a bit down that I couldn't achive much success in the gym when I started taking creatine in the first place (yes, I understand that over a month is not that long) and now it's the hair loss. So did anyone had simular experience? I'd really appreciate your support. Also I hope this post can be a warning for those who think about taking creatine. I will try to keep it updated.    "], ["Problems with weight years after going off of invega?", "6", "4", "2024-06-15T12:25:56.523000+0000", "https://www.reddit.com/r/CrazyNicePeople/comments/1dggu2d/problems_with_weight_years_after_going_off_of/", "(This post will be talking about weight, weight loss, and numbers will be involved, as well as doctors dismissing symptoms. If you aren't in the headspace to read it that's okay, go take care of yourself <3) Hi! It's been awhile. I wanted to see if anyone else had experiences like I have with invega. Any advice is welcome and appreciated! Whenever I was first diagnosed with schizoaffective disorder when I was 16 I was put on invega (paliperidone). I had a lot of horrible side effects, and I gained 50 pounds over a few months. My psychiatrist at the time didn't listen to me, and kept me on invega till I swapped psychiatrists whenever I was 18. My new psychiatrist immediately took me off of invega, but the weight gain never went away. I'm 22 now, and no matter what I do I can't lose weight. I haven't been able to lose weight since being on invega. I'm not eating much, I have a large calorie deficit, but I still am not losing weight. It's been years of me trying, but I haven't lost any weight. I've tried talking to doctors and my psychiatrist about it, but I keep getting told I need to eat less. I think there is something wrong with my body, and I don't know what to do.    "], ["Has anyone lost a lot of weight in a short time before travel and had problems with their passport?", "36", "0", "2024-02-28T15:01:29.098000+0000", "https://www.reddit.com/r/travel/comments/1b282jw/has_anyone_lost_a_lot_of_weight_in_a_short_time/", "We just are getting passport photos done and I need to lose like 100lbs in the next 10 months to be able to fly comfortably. Has anyone ran into problems using their passport due to weight loss or is it not really an issue? Edit: The thing that made me think of it is that once I got hassled at the post office picking up a package last time I lost 100lbs after being sick. I know that post lady very well now, lol, but when I first moved here she made me turn my head side to side and junk when I gave her my ID. She is really nice, but she takes her job very very seriously and puts her all into whatever she does.    "], ["Had my initial intake at a eating disorder clinic for problems with food aversion", "19", "8", "2024-04-23T18:02:34.061000+0000", "https://www.reddit.com/r/adhdwomen/comments/1cbbbuf/had_my_initial_intake_at_a_eating_disorder_clinic/", "Since my Dad died almost two years ago I have struggled with frequent episodes of food aversion. Sometimes I can be eating something that I enjoy and want in that moment but then suddenly my brain tells me it is gross and I can't put it in my mouth anymore. Other times when I feeling overwhelmed and am hungry I will try to look for something to eat but all food becomes gross to me. I spiral more and don't eat. Or what can also happen I can be fine but then realizing I need to make a food choice and make something overwhelms me and food becomes gross. Normally I do not avoid any food. I don't have any texture issues. I'm not trying to starve myself. I'm not binging and purging. I just get sensory overload and don't find food appealing. I am consistent with my meds and DBT therapy but it's not enough. So I made the call to my local eating disorder clinic to see if they could help me. I wasn't sure if my issue would be a big enough issue for treatment. I had to fill out like 8 different forms before my appointment. At your appointment they take your vitals, weight, height, EKG, and blood work. They don't show you the scale at the first appointment. Then you need with the medical doctor. I talked about my history of eating behaviors, mental health,  physical health,  childhood, family health, and reasons while I was there. She did not like that I don't eat breakfast and thinks I should change that. I don't want to. I don't want toneat breakfast as I'm not hungry in the morning. I'm not a breakfast person and I hate the feeling of being forced to do something. So this is definitely going to cause tension. I might just tell them yes I did eat something when in reality I ate at 11. I did not tell her that I am trying to lose some pounds (nothing drastic or anywhere near being underweight. ) as I don't see that being a fruitful conversation. Not sure how I will explain weight loss later on but that's a problem for another time. She thinks I fall under  ARFID and explained that there are different subsets of ARFID and that mine sounds like a sensory issue. I tried to talk about how women with ADHD can often struggle with food aversion. That didn't really produce much of a conversation. The treatment plan for me is meeting every three weeks with the .medical doctor and then weekly appointments with a dietician and a therapist. Thankfully the dietician and therapist I can do virtually so I won't have to use a lot of my earned sick leave and can use my break time for appointments. I don't know how I will handle weight loss goals with them or if I even bring it up. I'm not starving myself. I eat enough calories to match my activity levels. I am having  very complicated feels right now. I did use cope ahead DBT skills. Last night I bought myself my favorite sandwich to enjoy at lunch today. Then after my appointment I picked up ice cream I liked. Took the day off as I didn't want to deal with coworkers after this appointment. A good friend is coming over tonight to just hang out with me. Feeling complicated and glad my dog is extra snuggly right now. Covering myself up with an 18 pound weighted  blanket    "], ["Has anyone has problems with gas?", "8", "6", "2023-10-28T14:10:55.721000+0000", "https://www.reddit.com/r/Mounjaro_ForType2/comments/17ielo1/has_anyone_has_problems_with_gas/", "This is my second week on the drug. No weight loss, sugar is better controlled. Lower glucose readings daily but I am having lots of gas. Just wondering if others are having issues like this?    "], ["I have an issue with my therapist.", "92", "111", "2023-07-26T22:44:25.485000+0000", "https://www.reddit.com/r/MaintenancePhase/comments/15akb7k/i_have_an_issue_with_my_therapist/", "I've been grappling with this for a little while and I just realized this might be a good place to get some feedback. I've been seeing a therapist via Zoom since January. She is the third therapist I've had since Covid started, and I chose her because, like me, she's around menopause age, and that's something my other therapists couldn't relate to. One of the things we often talk about is my issues around food and exercise. Something my therapist will do is if I bring up an issue, she will immediately throw out an idea that is very wacky. Such as, when I told her I was having financial problems, she suggested I could start an OnlyFans and post feet pics. When I tell her I don't want to do the thing, she immediately refocuses and we talk about options I can take, but one thing really has me wondering. I have physical pain brought on by my body size. I have trouble walking because of my extra weight. I have mental blocks around buying and preparing food, and I gravitate towards junk food. When we really started talking about this, my therapist was very excited to tell me all about her upcoming weight-loss surgery. She did ask, \"Do you want to hear about it?\" and I was curious just to find out how it worked. But I have never, nor would I ever, want to get an elective surgery. When the topic came up again later, she asked, \"Ok, so you wouldn't get weight loss surgery?\" and I said, no, absolutely not. So the next suggestion was, I should talk to my doctor about other weight loss options. What seems apparent is that my therapist isn't at all familiar with the concepts of HAES, Intuitive Eating, or anything in that realm. I detest diet culture, I hate the idea of working with my doctor because my health-plan has a deal with Weight Watchers, and I've already availed myself of all the various weight-loss support groups my plan offers--but there are times when I feel like my foray into HAES has actually hurt me, rather than helped me. The last \"diet\" book I read was \"The Fuck It Diet\", which really leaned hard into \"eat whatever you want to\", and after I read it, I did just that, and quickly ballooned up (transitioning to permanent work-from-home didn't help). I'm close to crippled when I try to move around. So I'm still on the fence about what approach to take to return myself to a state of being able to walk more than a couple of blocks without serious back pain and shin splints. The question is, is my therapist doing more harm than good? I like her a lot. She is very supportive and understanding of trauma and how that informs our coping strategies, but I worry that I should have put more effort into finding someone who understands HAES. (I am stuck with choosing providers from a limited list, due to my insurance; I cannot afford to see just anyone.) Thoughts?  ETA: You guys really came through. I have more clarity on what's up. I'm seeing this person more as a friend (and I think she is encouraging that) and that's why I'm sad about losing her, but I think she is undermining her attempts to convince me of my worth by injecting her own insecurities. I plan to stop seeing her but will have one last talk to express my problems with her approach. Thank you.     "], ["Rosa / my biggest issue with this", "49", "80", "2023-07-26T19:28:56.831000+0000", "https://www.reddit.com/r/AlexeeTrevizo/comments/15af87p/rosa_my_biggest_issue_with_this/", "Of course my biggest issue is the loss of that innocent baby.... But something I have to get off my chest that absolutely repulses me about all of this.... Is that Rosa says \"I'm coming for all of you, the hospital, police, etc\", in the body cam footage at the house... and a WRONGFUL DEATH LAWSUIT has been filed????? Like this has all gone down, somehow you managed to not only miss that your 19 year old daughter was pregant, you also failed to cultivate an enviroment where your daughter feels safe, able to communicate and have options.. Alexee was gaining weight, noticably in photos and to classmates. Stopped taking birth control, started taking weight loss medication. Ends up in the hospital, the rest y'all know of course. But how the FUCK, can these disgusting waste of life human beings, after doing all of this..... Literally traumatizing cops, staff of the hospital, probably the boyfriends family, and you have the audacity to come after the hospital after the lifelong TRAUMA you have forced upon these healthcare workers.... A full term baby, in a trash can. And still after was denying she had sex. And the Mom is so god damn annoying. Your daughter is 19, and commited a crime. As her mother, you don't have rights to warrants and all this bullshit because she is a legal ADULT. You argued and questioned cops, you are saying all this digusting, untrue, deflective shit..... At the end of the day, Alexee should be arrested. 100%. Therapy, classes, etc. The mother, should be charged with interferance or as an accomplice. Your daughter pushed a baby out in a hospital bathroom, somehow managed to rip the umbilical cord apart to where staff said it looks like an animal ripped it apart, flushed a million times, refused to come out. Flushed the placenta, covered the bathroom in blood and then put your baby that you grew and just birthed, under mulitple bags and allowed him to suffocate. The mother is so distgusting and I truly hope they have no moment of peace left in their lifetimes for what they did and the way they're conducting themselves and acting. \"Please put her in solitude because if they find out what she did, what they think she did*, i dont want her to get hurt*..... yeah..... because she did something absolutely repulsive and shows zero remorse and its concerning. I don't think she should get hurt, I dont believe in eye for an eye stuff, but like what the fuck. Hold somebody accountable. God.    "], ["The issue with higher kit in higher elo", "71", "53", "2023-12-23T11:30:27.313000+0000", "https://www.reddit.com/r/EscapefromTarkov/comments/18p3sg1/the_issue_with_higher_kit_in_higher_elo/", "Let me explain myself. I was in top 400 of arena player, i was playing a lot of big streamer. Sometime i won sometimes i didn't. I was grinding the CQB tree for the G36 with M85A1, i manage to get to MCX with AP ammo, i was finally getting to the last one !!! or so i thought. That MCX kit price is 250k and when u win (even when i hard carry) i win close to 100k roubles per win. SO i need to win 3 games just to bounce from one loss. As u can guess, i went from 6M roubles to 100k real fast. Now, i am a dead weight for my team since i play with no armor and sp8 ammo. All i can do is pray that ennemy team has someone in my situation. I hope this will ring some bells to nikita but i hardly think it will.    "], ["Potential GAAR issue with CDA and new capital gain rules", "7", "4", "2024-06-12T13:25:07.541000+0000", "https://www.reddit.com/r/cantax/comments/1de6laf/potential_gaar_issue_with_cda_and_new_capital/", "Thought I would throw this out there: Corporation realizes $1M of capital gains and adds $500k to CDA prior to June 25th. Corporation elects before June 25th to pay out a CDA dividend where the calculation at that time was a balance of $500k. On July 1, the corporation realizes a capital loss of $750k. For the year ending December 31, the income inclusion should be: ((1M x 50%) - (750k x 66%)) = nil (roughly) However, in reality, only 50% of that loss is usable due to the weighted average gain rule. But for CDA calculations, you will Now have negative $250k CDA afterwards, effectively monetizing the CDA account and incurring a tax benefit. Any thoughts?    "], ["Weight Paint Issue with Auto Rig Pro", "2", "1", "2024-03-29T16:18:23.468000+0000", "https://www.reddit.com/r/blenderhelp/comments/1bqt9ac/weight_paint_issue_with_auto_rig_pro/", "I'm new to animating meshes and I'm trying to fix some issues with the Auto Rig Pro jawline, but I can't seem to be able to edit the jawbone weight paints? When selecting another piece of the armature, I'm able to see the weight paint and how it affects the mesh...      However when I select the jawbone (where I want to make changes) nothing is weight painted?      This made me think that the bone doesn't affect any part of the mesh, however when moving it - it behaves (almost) as intended...      So clearly the bone DOES work but isn't affected by weight painting? I'm at a bit of a loss and would appreciate an explaination of how it's affecting the mesh, seemingly without weight paints and how can I edit the weighting of this bone.    "], ["I have an issue with the ultra only â\u0080\u009cmental strengthâ\u0080\u009d vibes in ultramarathon culture", "206", "46", "2023-10-18T17:11:16.928000+0000", "https://www.reddit.com/r/Ultramarathon/comments/17avvzn/i_have_an_issue_with_the_ultra_only_mental/", "Hear me out. This is an outsider's perspective so I hope I'm wrong and missing something. Tell me if I amâ\u0080¦. I come from a different endurance world and recently helped my friend crew for an ultra. In my world and my perspective, it's on the other side of the spectrum with full of transparency on training volume, diet/careful nutrition/eating enough, focus on sleep and recovery, everything measurable is measured; basically every little detail in creating an effective powerful machine out of the human body is accounted for and we all talk about it from pros to amateurs. I know exactly how much I need to drink and eat for every hour of activity I do based on my weight, vo2 max, sweat loss and effort. Now, I'm witnessing my friend attempt to do an ultra, and she has a moderately good running background but seems she wants to complete these ultras on â\u0080\u009cpositive vibesâ\u0080\u009d only, mental strength and a good attitude. Don't get me wrong, that's important too, but it's not the full picture. This whole â\u0080\u009cpush through toughnessâ\u0080\u009d and David Goggins mentality is so prevalent in this sport that you have anyone thinking they can do it without the proper preparation and training. In learning more about my friend's prep, I was pretty shocked how little she prepared to venture for 200+ miles and how undisciplined the sleep and fueling plan was. Now, maybe she is just my sample n of 1, but I've started looking at social media of these ultramarathoners and it's ALL FULL of this mental strength crap and NOTHING about the loads and loads of prep and discipline that's obviously needed to accomplish an elite human task. These elite runners make it look like they just get out of bed and decide they are going â\u0080\u009cto be toughâ\u0080\u009d today and I have an issue with the lack of transparency in their prep and self-knowledge from the top athletes in ultras. Regular people are watching them and they should lead by example. Otherwise you have people like like my friend spend thousands of dollars, recruit a gaggle of people, travel cross country, to basically decide â\u0080\u009cshe's not tough enoughâ\u0080\u009d once she inevitably dnfs. Why am I just seeing smoke and mirrors from the outside y'all?    "], ["Numpy numerical issue with softmax regression implemetation on MNIST dataset", "0", "1", "2023-10-29T03:40:28.128000+0000", "https://www.reddit.com/r/MLQuestions/comments/17iuilf/numpy_numerical_issue_with_softmax_regression/", "I'm having numpy numerical issues with my implementation of softmax  regression/multiclass logistic regression on the MNIST dataset. The numpy exp and log numerical issue goes away when I divide the x  values by 255 (normalization). I'm confident that I'm correctly  implementing the lost and gradient functions. I tried writing my softmax as np.exp(z - max(z)) / np.sum(np.exp(z - max(z)), axis = 1, keepdims=True) but it was still giving errors in with np.log dividing by 0 in cross-entropy error. Is there something I'm missing that is causing the softmax regression  to fail when running MNIST data with x values ranging from 0 to 255 but  works on x values ranging from with 0 to 1.  My Code is: import numpy as np\nfrom urllib.request import urlopen\nimport gzip\n\n\n#[['http://yann.lecun.com/exdb/mnist/train-images-idx3-ubyte.gz', 'http://yann.lecun.com/exdb/mnist/train-labels-idx1-ubyte.gz'],\n# ['http://yann.lecun.com/exdb/mnist/t10k-images-idx3-ubyte.gz', 'http://yann.lecun.com/exdb/mnist/t10k-labels-idx1-ubyte.gz']]:\n\ndef getMNISTXData(url):\n  streamed_file = urlopen(url)\n  with gzip.GzipFile(fileobj=streamed_file) as f:\n    # first 4 bytes is a magic number\n    magic_number = int.from_bytes(f.read(4), 'big')\n    # second 4 bytes is the number of images\n    image_count = int.from_bytes(f.read(4), 'big')\n    # third 4 bytes is the row count\n    row_count = int.from_bytes(f.read(4), 'big')\n    # fourth 4 bytes is the column count\n    column_count = int.from_bytes(f.read(4), 'big')\n    # rest is the image pixel data, each pixel is stored as an unsigned byte\n    # pixel values are 0 to 255\n    image_data = f.read()\n    #reshape the values to between 0 and 1 instead of 0 to 255\n    #divide by 255 is done for numerical stability, otherwise numpy exp will overflow\n    images = np.frombuffer(image_data, dtype=np.uint8).reshape((image_count, row_count *  column_count))\n    return images\n\n\n\ndef getMNISTYData(url):\n  streamed_file = urlopen(url)\n  with gzip.GzipFile(fileobj=streamed_file) as f:\n    # first 4 bytes is a magic number\n    magic_number = int.from_bytes(f.read(4), 'big')\n    # second 4 bytes is the number of labels\n    label_count = int.from_bytes(f.read(4), 'big')\n    # rest is the label data, each label is stored as unsigned byte\n    # label values are 0 to 9\n    label_data = f.read()\n    labels = np.frombuffer(label_data, dtype=np.uint8).reshape((label_count, 1))\n    return labels\n\nx_train_url = 'http://yann.lecun.com/exdb/mnist/train-images-idx3-ubyte.gz'\ny_train_url = 'http://yann.lecun.com/exdb/mnist/train-labels-idx1-ubyte.gz'\nx_train = getMNISTXData(x_train_url)\ny_train = getMNISTYData(y_train_url)\nprint(x_train.shape)\nprint(y_train.shape)\n\nimport matplotlib.pyplot as plt\nplt.imshow(x_train[1].reshape((28,28)), cmap='gray_r')\nplt.show()\n\n\nx_test_url = 'http://yann.lecun.com/exdb/mnist/t10k-images-idx3-ubyte.gz'\ny_test_url = 'http://yann.lecun.com/exdb/mnist/t10k-labels-idx1-ubyte.gz'\nx_test = getMNISTXData(x_test_url)\ny_test = getMNISTYData(y_test_url)\nprint(x_test.shape)\nprint(y_test.shape)\n\nimport matplotlib.pyplot as plt\nplt.imshow(x_test[0].reshape((28,28)), cmap='gray_r')\nplt.show()\n\n#Indicator fuction\n#returns array with index y being 1 and 0 for all other\ndef indicatorFunc(y, size = 10):\n  indicatorArray = np.zeros(size, dtype=np.uint8)\n  indicatorArray[y] = 1\n  return indicatorArray\n\n#Gets the 1{yi = k} vector for each y, final result is matrix.\n#each row is the 1{yi = k}\ndef oneHotEncodeMatrix(y_data):\n  OHTResult = np.zeros((len(y_data), 10))\n  for index in range(len(y_data)):\n    OHTResult[index] = indicatorFunc(y_data[index])\n  return OHTResult\n\n#gets the WX+b value\ndef calcZ(x_data, weight, bias):\n  return np.dot(x_data, weight) + bias\n\n#calculates softmax for values for each xi\ndef softmaxMatrix(z):\n  #numerator is the exp(wx+b) for each class for each data\n  #denom is the sum of exp(wx+b)\n  #dividing them we get softmax for each class in for each x\n  return np.exp(z - np.max(z), dtype=np.float128) / np.sum(np.exp(z - np.max(z), dtype=np.float128), axis = 1, keepdims = True, dtype=np.float128)\n\n#calculates the gradient of W and b used for gradient Descent\ndef calculateNLossGradient(x, error):\n  #first element of the tuple is the gradient of weight: Summation i=1 to n 1/n * xi(P(yi=k|xi,w,b) - 1{yi = k})\n  #second element is the gradient of bias: Summation i=1 to n  1/n * (P(yi=k|xi,w,b) - 1{yi = k})\n  return (1/x.shape[0] * np.dot(x.T, error), 1/x.shape[0] * np.sum(error, axis = 0, dtype=np.float128))\n\n\ndef calculateNCrossEntropyLoss(yOneHotEnc, softmax, z):\n  #calculates the cross entropy loss for current weight and bias on training data\n  #return np.mean(-np.sum(yOneHotEnc * np.log(softmax, dtype=np.float128), axis = 1, dtype=np.float128), dtype=np.float128)\n  return np.mean(-np.log(np.sum(yOneHotEnc * softmax, axis = 1, dtype=np.float128), dtype=np.float128))\n\ndef MulticlassLRGradientDescent(x_data, y_data, learning_rate = 0.5, min_tolerance = 0.6):\n  #create weight and softmax values\n  modelWeight = np.zeros((784,10), dtype=np.float128)\n  modelBias = np.zeros(10, dtype=np.float128)\n  yOHE = oneHotEncodeMatrix(y_data)\n  zVal = calcZ(x_data, modelWeight, modelBias)\n  softmaxVal = softmaxMatrix(zVal)\n  errVal = softmaxVal - yOHE\n  #calculate initial Cross entropy loss\n  lossValue = calculateNCrossEntropyLoss(yOHE, softmaxVal, zVal)\n\n  print('Starting Fitting Model')\n\n  #loop until min_tolerance is reached on cross entropy loss\n  while (lossValue > min_tolerance):\n    print(lossValue)\n\n    #gets gradient for weight and bias\n    weightGradient, biasGradient = calculateNLossGradient(x_data, errVal)\n    #update weight and bias\n    modelWeight -= learning_rate * weightGradient\n    modelBias -= learning_rate * biasGradient\n    #calculates softmax for next iter\n    zVal = calcZ(x_data, modelWeight, modelBias)\n    softmaxVal = softmaxMatrix(zVal)\n    errVal = softmaxVal - yOHE\n\n\n    #calculates new loss on updated weight and bias\n    lossValue = calculateNCrossEntropyLoss(yOHE, softmaxVal, zVal)\n\n\n\n  return (lossValue, modelWeight, modelBias)\n\n#predicts the integer based on 28x28 MNIST data\ndef predict(x_data, weight, bias):\n  zVal = calcZ(x_data, weight, bias)\n  softmaxVal = softmaxMatrix(zVal)\n  return np.argmax(softmaxVal, axis=1)\n\n#calculates the correct prediction rate of the model\ndef calculatePredictError(y_data, predictOutput):\n  correctNum = 0\n  for index in range(len(y_data)):\n    if y_data[index] == predictOutput[index]:\n      correctNum += 1\n  return correctNum / len(y_data)\n\n#doing some test\nprint(MulticlassLRGradientDescent(x_train, y_train))\nresult = MulticlassLRGradientDescent(x_train, y_train)\nprint(calculatePredictError(predict(x_test, result[1], result[2]), y_test))     "], ["You guys were so helpful yesterday. Iâ\u0080\u0099m back for some more help! ð\u009f\u0098\u0082 So I see lack of bowl movements are an issue with a lot of people as well. What are some things that helps to move it along?", "12", "1", "2023-10-25T14:09:01.814000+0000", "https://www.reddit.com/r/Semaglutide/comments/17g5ogq/you_guys_were_so_helpful_yesterday_im_back_for/", "Once again my husband is on like his 4th week (I think) on the shot. And he just recently started having side affects (weight loss included), like it literally just started messing with his appetite so this is all new to us. He has went from regular bowl movements (more than once a day) to not going in a few days and when he did it wasn't much. So we are looking for stuff that could help best with that! Thanks.    "], ["Having issues with cutting and weight loss ", "10", "1", "2024-05-09T19:11:30.677000+0000", "https://www.reddit.com/r/loseit/comments/1co59m2/having_issues_with_cutting_and_weight_loss/", "I used to weigh around 200 pounds before I got into lifting and stopped playing sports which made me interested in lifting. I didn't want to be the skinny kid anymore and I definitely accomplished that goal Now I weigh around 268 and I'm 6'2 and I've bulked to my max I believe. I didn't even want to be this big but life issues have resulted in this weight. I do have a decent amount of muscle but I also have a good amount of fat on my body. I've obviously got the bulking part down but I've had so many issues with cutting. I don't really understand how I eat in a deficit and I will lose alot of weight quickly but then it all just comes back so I tend to then get upset and binge and that cycle repeats. When I'm â\u0080\u009ccuttingâ\u0080\u009d I tend to eat one big meal and a protein shake because all I was taught was be a deficit. Obviously this isn't working and I just keep putting weight back on and it just makes me look like a bloated mess. I have a end goal of 225 which Ik is far away but even starting with 5 pounds but doing it the correct way is what I need. So if anyone could help or at least point me in the right direction how to go about cutting I would be appreciate it as I cannot go through this cycle anymore. Any help or tips would be appreciated.    "], ["Having some issues with weight loss", "4", "2", "2024-04-03T17:14:22.453000+0000", "https://www.reddit.com/r/loseit/comments/1buy7p0/having_some_issues_with_weight_loss/", "Hey everyone! 26M. I've been currently trying to lose some weight. Looking for some helpful tips on how to get back on track In back  2017 I was about 280 (20M). Over the course of a year and a half I lost about 100 lbs, got down to ~180. I was able to maintain this weight loss for about 2 years, and then during covid, I had some pretty bad mental stuff happen, started grad school, entered a long term relationship. I gained it all back and got up to 310 lbs. I've been losing weight again, and I've lost about 16 lbs, down to 295. But I've been at this weight for 3 weeks. I'm following a strict 2000 calorie diet and I'm doing an hour long walk every day, so I should be below deficit. I'm also wondering, is this just normal as you get older? I know I'm not â\u0080\u009coldâ\u0080\u009d but I hear from people that your metabolism slows down.  It's so crazy last time I basically just cut out sugar and dropped 30 lbs. Thanks!    "], ["Issues with weight loss on Xyrem?", "2", "1", "2024-04-18T22:22:39.542000+0000", "https://www.reddit.com/r/Narcolepsy/comments/1c7gi8h/issues_with_weight_loss_on_xyrem/", "I'm a type 2 narcoleptic, diagnosised 6 years and have been on Xyrem for a year now. When I started taking it, I started to drop in weight after about a month and haven't been able to gain any back, in fact I keep losing more. I eat 3 regular sized meals a day, every day. I pretty much each eat the same things in various combinations: beef, chicken thighs, bacon, sausage, eggs, fish, cheeses, fruits, green vegetables, rice, potoes, whole grain breads, tortillas (I hate candy, and I don't like sweets or junk food). I take 7g (3.5g/3.5g) a night instead of the full dose because that works better for me. My sleep doctor said go see your GP....my GP said blood work/thyroid are all normal ð\u009f¤·ð\u009f\u008f»â\u0080\u008dâ\u0099\u0080ï¸\u008f, even my gyno said go see your sleep doctor...but everyone keeps pointing a figure at someone else... Has anyone else experienced issues with gaining weight/maintaining a healthy weight on Xyrem? What was the issue? What helped? Any input is appreciated! I'm having the best results with Xyrem than I have had with any other medication and would like to stay on it.    "], ["discipline issues with weight loss", "1", "1", "2024-03-02T23:11:28.343000+0000", "https://www.reddit.com/r/WeightLossAdvice/comments/1b51pii/discipline_issues_with_weight_loss/", "40male, 140kg, 1.73m I started my weight loss journey years ago, and it has been going on off and on. I already lost like 20kg. But my resolve always erodes after a time, and I relax my weight loss, and while I don't gain everything back, I don't continue loosing and sometimes I gain a little back. Part of the problem is that I am on medication that is known to cause increased appetite / weight gain. Sadly, this medication is non negotiable. I already brought it up with my doctor. I don't do much exercise, and I'm a little afraid to try and start doing it both because I'm afraid of undue strain on my joints and such, and because most forms of exercise are very uncomfortable or straight up painful. Even just going for a walk quickly becomes painful as I have malformed feet. I recently even tried to hire a nutritionist to help and coach me during weight loss, but after like 3 weeks I feel the coach isn't doing a very good job of motivating and helping me. And it is a fairly expensive service, so I'm tempted to discontinue it. My food tracking has improved though. My chosen method of weight loss is counting calories and then aiming for a 500 calorie deficit based on the TDEE. I know that eating lots of protein and fibre help keep me full. I use a website that has a database of most foods included and weigh pretty much everything I eat. Or take the numbers from the packaging if it comes pre-packed. If any of you have hints, let's hear them. Especially about keeping up motivation and improving willpower/discipline.    "], ["Any issues with me doing daily 24 hour fasts for weight loss?", "15", "9", "2024-04-09T22:54:38.937000+0000", "https://www.reddit.com/r/intermittentfasting/comments/1c05x8s/any_issues_with_me_doing_daily_24_hour_fasts_for/", "I am 1 month into my diet eating 1300/ 1500 calories a day. I have basicly naturally fallen into eating once a day at lunch time. I have not made a decision to fast for any weight loss benefits it just works for me. If I eat all my calories I know thats it, no snacking. Sometimes ill eat some fruit in the afternoon but not always. Are there any reasons that I should not be doing this? It seems to work for me and I don't really feel hungry untill the lead up to lunch time the following day. I am 33m currently 224 pounds, 5FT 6 inches.    "], ["Have you had gall bladder issues with rapid weight loss from rolling fasts?", "10", "1", "2024-03-20T18:02:27.735000+0000", "https://www.reddit.com/r/fasting/comments/1bjjxwx/have_you_had_gall_bladder_issues_with_rapid/", "I'm doing 48 48 72 and am worried about having issues with doing that for about 2 months.  which of you have done and lost 20lbs in 1 month or 40lbs 2 month etc and are fine with no issues? Thinking about eating an egg with some butter on fasting days to just keep things moving? Idk please give advice lol    "], ["issues with bone on my inner left elbow preventing weight lifting for weight loss", "1", "1", "2024-01-22T14:49:32.672000+0000", "https://www.reddit.com/r/WeightLossAdvice/comments/19cxajl/issues_with_bone_on_my_inner_left_elbow/", "I have had an issue for years now, where if i lift or curl anything, even if it is a weight i am capable of lifting, a bone on my inner elbow will pop in and out and make my arm â\u0080\u009cgive wayâ\u0080\u009d. has anyone experienced this or have any tips and tricks around this? I would like to implement weight training in my weight loss but unable to with this being an issue    "], ["Did anyone else have issues with CGM readings following weight loss?", "2", "1", "2023-12-30T01:41:46.530000+0000", "https://www.reddit.com/r/diabetes_t1/comments/18u3lug/did_anyone_else_have_issues_with_cgm_readings/", "I've noticed that the more weight I lose the more often my CGM just randomly stops working/ being able to read my bg & idk if it's because of that or just coincidental & if anyone else has had any experience    "], ["Questions for anyone that my have issues with Genesis after significant weight loss.", "3", "0", "2024-01-10T20:47:14.018000+0000", "https://www.reddit.com/r/AirForceRecruits/comments/193ipe6/questions_for_anyone_that_my_have_issues_with/", "So I was supposed to go through MEPS last week and on the first day I managed to take my ASVAB and do pretty well, but on my way to the hotel my recruiter told me not to go to the hotel. Basically he rattled off a bunch off issues I had due to being overweight (which I have since lost 105 pounds so I could rejoin the military). Of course it bugs the hell out of me because I put in all the work since last June to get where I am now and then to be completely dismissed over something I didn't expect to actually be an issue. One was gerd and the other being hyper tension. The gerd I never thought anything of, but I do get the hyper tension. Well, with the weight loss, those two things went away. I never thought to mention the gerd just because that was two years ago and I went to the doctor one time. I was just wondering if anyone else has had a similar experience and how long it could possibly take to get the ball rolling again? It doesn't help that I haven't heard back from my recruiter yet with the next steps to take to get things going again after I've texted and called. Any advice would help greatly!    "], ["Anyone else having issues with weight loss while sick?", "1", "5", "2023-07-27T22:39:28.538000+0000", "https://www.reddit.com/r/loseit/comments/15bfuj9/anyone_else_having_issues_with_weight_loss_while/", "So my issue is that I have a rather weak immune system and I keep getting colds all times of the year. I noticed that I eat more during these and while I don't really gain weight back (and if I do it's only 1 or 2 lbs) they tend to completely halt my weight loss. I walk less, don't do workouts (due to feeling too sick) and for some reason I feel hungrier. It just seems much harder to focus on weight loss while you're sick and tired. Does anyone else have that issue/noticed that? I try to focus on getting well again during these times over weight loss, but it still annoys me as I feel that the constant colds have cost me 5 to 10 lbs weight loss since I began my journey.    "], ["Having trouble with weight loss...", "11", "4", "2024-05-17T23:48:46.078000+0000", "https://www.reddit.com/r/WeightLossAdvice/comments/1cujvhu/having_trouble_with_weight_loss/", "(27M) I've found a way to put on 10lbs even though I work 6am-3pm at a restaurant where I generally walk a minimum of 12k steps, lift heavy stuff, eat a healthy meal with protein and veggies, and don't snack on much other than fresh fruit or some vegetable at home (grape leaves with quinoa and chickpeas have been my obsession lately). The main unhealthy thing I eat/drink is a couple of beers before bed most nights and even that is usually Truly, Simply, etc... Is it the beer, something I have to see a pro to figure out, or am I just missing something? I don't do much actual cardio, so that's probably it, right?    "], ["Has anyone had trouble with weight loss since being on bc?", "3", "2", "2024-06-28T22:23:52.789000+0000", "https://www.reddit.com/r/Endo/comments/1dqw0yh/has_anyone_had_trouble_with_weight_loss_since/", "(30F) I've gained weight in the last year (like 20ish lbs). I started on the depo shot because I couldn't stand the pain anymore and my periods were getting HEAVIER. I've been thinking of switching to an IUD but that comes with a whole different level of side effects. Help ð\u009f\u0098­    "], ["Has any of you had trouble with weight loss due to dymorphia/dysphoria?", "5", "3", "2024-06-11T15:49:20.581000+0000", "https://www.reddit.com/r/gender/comments/1ddhfiy/has_any_of_you_had_trouble_with_weight_loss_due/", "Im a tall (6'4\") 30 yr/old AMAB person. I' currently male presenting, but possible closeted trans woman. At my heaviest(before I realised I was dealing with gender dysmorphia) I was at approximately 320 lbs. I've spent the last two years working on losing weight, and i made it down to about 200lbs, the skinniest I've ever been as an adult. I was able to experiment with more femme clothing, and was able to feel as close to androgynous as I can get. But life happens, and long story short I've gained 90 lbs in the last 8-9 months. My body still remembers what  it feels like to be smaller. I desperately want to return to that, but my dysmorphia is making it difficult to find the motivation. I didn't really like my body, even when it was skinny. I was still tall and  masculine, and I'm treated as such. However, an unexpected side effect of the weight gain is that I have the closest thing to breasts that I've ever had. I almost wish I could lose weight everywhere else and just keep those, but that's not how it works. I know this is kind of rambly, my apologies. I'm just feeling like a sack of skin who doesn't like the state of there body. Has anyone else dealt with this before?    "], ["Trouble with #2", "19", "7", "2024-03-03T20:37:59.398000+0000", "https://www.reddit.com/r/keto/comments/1b5rc60/trouble_with_2/", "Hi everyone! New to this community (love it here btw) and would love some advice. I (37F) don't have much weight to lose (low/no carb for about 5 weeks, down 8#, only maybe 5ish to go) but am interested in the keto way of life. I love not feeling bloated, not craving sweets, and the overall feeling of being â\u0080\u009ccarb free.â\u0080\u009d  For the record, I don't track whatsoever, so I'm not as elite as most of you here (those of you who track, weigh, etc are very impressive), I solely avoid carbs. And it's working but I'm not in it for extreme weight loss. I'm a former D1 athlete, 5'9â\u0080\u009d 152# CW and I exercise 4-5x a week. My problem is I can't poop! I've never had this issue before minus when I was pregnant, and it's been a consistent issue for the whole 5wks of carb restriction. I eat vegetables. I eat meat and cheese. I definitely could drink MORE water. I take a magnesium supplement. But I hear you talking about electrolytes a lot. Here's where I'm uneducated yet curious. Should I be mixing in an electrolyte? Forgive me if this is naive, but can I just add a liquid IV to a glass of water a day? (Is that even keto friendly lol don't come at me I admitted I'm not an elitist!!) Thank you for reading and for any advice you have. Thanks for welcoming me to this community!!    "], ["I'm having trouble with overeating/bingeeating", "1", "2", "2024-04-15T12:57:42.965000+0000", "https://www.reddit.com/r/WeightLossAdvice/comments/1c4lk7r/im_having_trouble_with_overeatingbingeeating/", "Hello everyone! Info, I'm 13, 150lb, 5'1or5'2 and afab I was 140 pounds around 2 weeks ago and I hate how fast I regained it. I'm possibly depressed so I do overeat a lot and I binge eat from really bad stress, and I also have low vitamin D so losing weight is kind of hard. I was thinking about buying a fitbit watch and walking 10,000 steps per day, so that next year I'd lose 48 pounds just by walking, but I still need help with eating too much. It happens without me fully aware and I hate it a lot.  Also, if theres a weight loss exercise video on YouTube you might think I could benefit from, I'd love it if you could just give me the name of it  Thank you very much!!    "], ["I have trouble with confidence ", "1", "1", "2024-04-14T22:29:57.938000+0000", "https://www.reddit.com/r/AdviceForTeens/comments/1c467uw/i_have_trouble_with_confidence/", "I've always had problems with confidence due to past bullying and shaming from family memes and still struggle with the same issues. I've always been self conscious of my face and weight/body. I gained weight since 8th grader (im a sophomore now) and it makes me feel SO MUCH worse about myself, I look gross and I feel gross, I hate looking in the mirror and seeing a chubby face looking back at me. I've been doing workouts for over a month and no changes have seem to be made yet for others they get automatic changes. And on top of that I've actually started to want to date people but no one is interested because all they see if a fat girl and of course no one is interested in me because of that and won't even consider giving me a chance. I don't know if I should give up on working out because it does nothing for me, im shorter so I've heard it takes longer but there are woman shorter than me who lose weight fast. I just hate how I look I wish I was a different person and I don't know how to get out of that mindset, I hate being the only one never complimented for looking beautiful or looking beautiful in a dress, I hate being overlooked by guys just because of my weight even though I'm TRYING to fix it, I hate being shamed by my own mother because of it or being looked at weird by people at school. I just need help to boost my confidence so I KNOW I can do this and actually believe that I have to keep trying to get the outcome I want. It'd also be helpful if I had weight loss tips.    "], ["Trouble with binge eating", "2", "1", "2024-02-18T19:33:28.428000+0000", "https://www.reddit.com/r/WeightLossAdvice/comments/1au2ka8/trouble_with_binge_eating/", "I am 19 years old ans 165 Pound, 5ft 10in male. I have recently started losing weight since January, (originally 186 lb) and eat on average 1500 calories a day, but have been recently binge eating during the weekends. Keep in mind that i am a college student and work at a restaurant on the weekends, so i usually end up snacking during my entire work day. Any advice on how to not binge during or after my shifts? Should i raise my calories? I also burn about 450 calories a day through exercise, if that helps. I know my weight loss is faster than normal since ive lost 20 pounds in a month and a half, but i want to get down to 150 before summer vacation. And then ultimately put on 5-10 pounds of muscle in the long run so im back up to 160 lb. Edit: forgot to mention that all of my calories come solely from food. I do not drink my calories.    "], ["Trouble with training GAN", "2", "2", "2024-06-07T22:39:13.689000+0000", "https://www.reddit.com/r/MLQuestions/comments/1danx8z/trouble_with_training_gan/", "I am trying to train a GAN and this is my first time. I am training a time series GAN where both the generator and discriminator are LSTMs. I am using binary crossentropy loss for the discriminator and MSE for updating the generator weights. While training, the discriminator loss sometimes explodes, sometimes goes to 0 and remains there and sometimes oscillates between very high values and 0. This behavior is different every time I train the model from scratch. How do I interpret this behavior and what direction should I move in to begin to see better results? I know training GANs can be tricky. Is there a good source to understand GANs better?    "], ["We need more empathy for people struggling with aesthetic weight loss concerns.", "114", "224", "2024-02-14T11:05:15.181000+0000", "https://www.reddit.com/r/loseit/comments/1aqkctq/we_need_more_empathy_for_people_struggling_with/", "First off, I've lost a 154 pounds. I've got very bad loose skin. In the past I made a loose skin and dating thread that got over 900 comments. I was okay for a bit after, now I've spiralled again a bit and I made a thread saying looking for support as I felt I'd wasted the best years of my life being obese, that topic got over a hundred replies. A lot of the replies on both topics  were helpful, but a lot were aggressive and felt like an attack. I got told I was uploveable because of my negativity. I was told that no one would want to be around me because of pessimism. I was told it certainly wasn't my looks that made me lonely. Essentially by a lot of people I was told to shut up and get therapy, as if that's a sure fix. I've been in therapy for years, it's not a pill you take where you suddenly become all better. I see on the top of the loseit page a thread ranting at people who are scared about loose skin. A lot of people in that thread are saying how that fear is just an excuse not to lose weight and they're being lazy. I'm a little shocked to see a sub that's meant to be supportive be so vitriolic to people struggling with certain body issues. You'd think struggling with weight would lead to an empathy but it's almost like if you're not entirely positive and optimistic about every aspect of losing weight you're the enemy. I wanted to create a thread offering a different view point about loose skin and aesthetic concerns about losing weight. I wanted to say as someone who's lost the weight and is struggling mentally with how I look, it's okay. If you're a the start of your weight loss journey are terrified of loose skin, that doesn't mean you're lazy, or looking for excuses to lose weight, or you're insulting people who've put the time in. It fucking sucks weight loss is a ramifications of obesity, its a consequence I wasn't aware of when I first got obese, people don't talk about it much. Maybe you weren't aware of it either, it's okay to be horrified about the idea of it. I was, I'm living with it and still am. I think one thing people don't understand for obese people, when they say oh you can hide loose skin with clothes, as if that's a fix all, like you're never gonna take clothes off. The thing that really sucks, and really scare me at the start of my weight loss journey was if my loose skin is bad thats it, I'm fucked. Obesity you can fix, loose skin, if it's bad you're stuck with. Saying we'll it's better to have loose skin than be obese is probably true, but obesity you always know with enough work and mental dedication you can  beat, you can't beat loose skin. That's terrifying. You shouldn't feel judged for feeling that way. I personally as someone who's been obese, was terrified of loose skin, and lost weight and now have loose skin feel you should lose the weight. It breaks my heart daily how I look, how I feel ill be single for the rest of my life because of it. It breaks my fucking heart, and you're allowed to feel that pain too. You don't have to, but I won't judge you. Having said all of that I'd rather have a broken heart and get to sit and read comfortably and get to walk without breaking into a sweat, and go to the gym and not fear a heart attack. It's hard to live like this, it's better, but it's still hard. I feel like we need to sympathise with people who are struggling with pessimistic thoughts more on here. Not attack then for challenging the belief that everything about weight loss is always, in every way positive. We need to give space for people spiralling into the places of the mind that are filled with monsters hiding in shadows. We need to not judge then and be patient. I say this as someone who lives in those dark placed of the brain a lot and I can tell you people telling me to grow up and loose skin is a badge of honor that I'm a bad person for not being proud only forces me, and probably others, down into the abyss more. Look if you're reading this and you have loose skin or are scared of getting it, I'm just saying I'm here for you. You're allowed to struggle, you're allowed to feel sad, you're allowed to want to cry and beat up a pillow (which I've done) but I think you should still try to get you're goals, whatever they may be. Don't be paralyse yourself with misery if you can help it. And if you can't help it then know there's one person (me) who doesn't judge you because I'm paralysed with misery myself. Stand tall if you can, crawl if you have to, claw if you must, just try to keep moving  and if you can't then know there's  other people out there who aren't moving and they don't judge you and don't think less of you because of that. Edit: a few people have did dm'd me seem to think I'm a woman, I'm not, I'm a man.    "], ["Struggling with weight loss and mental health ", "53", "62", "2024-03-08T15:44:28.402000+0000", "https://www.reddit.com/r/PCOS/comments/1b9r4ck/struggling_with_weight_loss_and_mental_health/", "Ive never made a post like this, mostly out of fear of mean comments. I'm a 25 year old female and was diagnosed with PCOS when I was 20. I've spent my entire life doing fad diets, binging, and just gaining weight. My highest was 235 in April 2020 and I'm 5'4. Since then I've done multiple restrictive diets, â\u0080\u009clifestyle changesâ\u0080\u009d, and did ozempic, mounjaro, and wegovy. I lost about 30 pounds with the weight loss medicine however stopped after having bad side effects in November 2023 with wegovy. I've gained back everything and weighed in at 228 this morning. It feels soul crushing. It feels like a constant struggle because I know what I should be doing; eating healthy and exercising. But I struggle so much. I feel anxious and sad all the time, either because I'm weighing myself every day or anxious about what I could weigh when I don't check. I know it's my fault for not â\u0080\u009csticking to itâ\u0080\u009d. Whenever I try to eat well and exercise it always feels like life gets in the way like not having enough money for healthy groceries or just feeling so exhausted from other obligations outside work that I can't make it to the gym ( I know this one I can hold myself accountable for, I really should be making a bigger effort). I can't ever tell if I'm just making excuses or need to be easier on myself My plan is to start journaling to see if it will help me figure out the mental health aspect around this. To make matters worse, I slipped on my deck and fell earlier this week and may have fractured my tailbone so I haven't been able to sit, lie down, or really anything involving my lower body due to pain. Does anyone have any advice or tips?    "], ["Struggling with Weight loss", "17", "6", "2024-05-08T10:33:55.449000+0000", "https://www.reddit.com/r/postpartumprogress/comments/1cn1br7/struggling_with_weight_loss/", "I'm 10 months pp and I've gained weight since giving birth (30lbs). I weightlift 4 times a week (I did so during my pregnancy too) and run 3 times a week. I just won't to be able to look at myself in the mirror again. I've been working out consistently for 6 months and haven't seen any results. Not a single pound down on the scale. My clothes don't fit different. If anything, I've had to buy more because nothing fits. I'm not breastfeeding and I've had my thyroid checked. I just don't get it. I eat in a deficit and track my calories. I'm 5'2 so 30lbs extra (I was never the skinny to begin with) is definitely noticeable and I just don't know what else to do anymore. Any suggestions ?    "], ["Struggling with weight loss", "22", "8", "2024-04-02T05:00:40.808000+0000", "https://www.reddit.com/r/PetiteFitness/comments/1btqe84/struggling_with_weight_loss/", "So I'm just starting to plateau after a 3 week deficit. I thought that 1500 cal would be enough of a deficit for me but the scales have started to go up again. For context, I am 5 ft 3, CW is 71.4kg and GW is around 60-65kg, honestly I don't mind how much I weigh I just want nice lean muscle, not a skinny fat look. I exercise around 4 days a week strength training and 1 day of cardio cycling (but sometimes I don't mange the cardio). Other than that my step count is pretty low. I'm tracking all my food and hitting 1500 or a little less but I'm not actually too hungry, which could be a bad sign? I'm also fasting until 11am which is my first meal. I'm kind of sick and tired of not reaching my goals, and being unhappy in my body. So just wanted a bit of advice from anyone else who struggled in the past with weight loss and excess body fat. I train with my bf and he is great but he's a large guy so the weight just falls off if he cuts the slightest amount of food out, so he's not the most sympathetic ear atm haha. Should I go lower than 1500? I need to up my steps for sure, so what would be a reasonable goal for that? (Not trying to burn myself out). How long should the deficit last and can I expect the scales to always fluctuate? Thanks for any help.    "], ["Dads struggling with weight loss, have you tried sending your toddler to daycare?", "35", "143", "2024-05-30T12:09:23.057000+0000", "https://www.reddit.com/r/daddit/comments/1d42hv7/dads_struggling_with_weight_loss_have_you_tried/", "My 2yr old has been more or less continually sick since March, when we started sending him to daycare. I've lost 25 pounds from getting knocked completely on my ass for weeks by every plague he brings home that only gave him the minor sniffles or mild crankiness. -25/10. Do not recommend... but since I can't work out to maintain weight, this'll have to do.    "], ["STRUGGLING WITH WEIGHT LOSS", "3", "4", "2024-05-31T05:05:15.993000+0000", "https://www.reddit.com/r/WeightLossAdvice/comments/1d4ntd7/struggling_with_weight_loss/", "Hey guys so I know it may sound like I'm whining and shxxt but honestly I'm tired guys and could use some advice and help I'm 22 obese I believe I'm anywhere between 350 - 400ibs. Some backstory since childhood when I was skinny and fit I was always called fat, made fun of etc and due to that and the emotional abuse etc I've never once looked at myself in a good way and during those times I would eat till I can't but mainly Chocolates, Candy just anything sugar would make me feel good and get rid of the stress at times where I noticed I've gained weight I would try dieting etc but would fail but for the past 2 years it's I've just lost control with myself not finding motivation in life or anything and just the weight has been killing me in every aspect of life and I know that if I do lose the weight everything will fall in place but I'm at a point where I can't find the will power/discipline to even try for a week and I can't keep going like this and it's messed up because I know I need to do something about it but I don't have motivation but I also want too which is weird. I want to do intermittent fasting workout 2x a day etc but it's just like I don't have motivation or discipline I guess no more and I'm just tired of living like this. Any tips or advice I can take from anyone that has experienced something similar. I'd appreciate it Thanks    "], ["Struggling with weight-loss ", "2", "1", "2024-06-02T13:41:26.318000+0000", "https://www.reddit.com/r/WeightLossAdvice/comments/1d6dkp5/struggling_with_weightloss/", "Hello, im 19 and i am 66kgs. I used to weigh 80kgs but i was able to shed off that weight in like 6 months but then it got extremely stagnant for like a year or 2 and ive been stuck in the 62-66kg window. It is the heaviest ive weighed for a while and i feel pretty insecure and would like to lose around 4-5 kgs in a month in time for my boyfriend's birthday. I also suffer from hormonal imbalance and pcos but it has been controlled after my weightloss. I am 5'4 ft. Can i please get some stern advice because i have been pretty lazy ð\u009f\u0098­    "], ["Weight loss help needed", "2", "1", "2024-05-03T00:41:31.056000+0000", "https://www.reddit.com/r/WeightLossAdvice/comments/1civlzy/weight_loss_help_needed/", "I need help figuring out my calorie deficit! I'm currently at 1600 but not sure if it's accurate. I'm 170 pouds, 5'7 and 23 female. I want to get down to 130 as soon as possible. I don't work out that often but I'm pretty active, daily steps at around 12,000 to 20,000 based on my Oura ring. Is my calorie deficit correct?    "], ["Help needed. 2 year long weight loss plateau :-(", "10", "13", "2024-06-27T14:36:00.347000+0000", "https://www.reddit.com/r/PetiteFitness/comments/1dpssvl/help_needed_2_year_long_weight_loss_plateau/", "Hello everyone First time posting in this sub and would love to hear your recommendations. I'm getting quite frustrated now and thought maybe you could help me out.. I'm a 33 year old female, 5'2 (158cm), 161 lbs (73 kgs). In 2021 I weighed around 220 lbs (100 kg) and started my weight loss journey. Within 7 months I lost 66 lbs (30 kg). I did this following a Ketogenic diet, no exercise/very very very sedentary. Then in July 2022 I started going to the gym, weight lifting, 5 day split. I put on quite a nice amount of muscles, but the scale did not go down any further, and I even, over the course of 2 years (!!), I am now at a stall being around 161 lbs (73 kgs) - gained around 13 lbs (6 kgs) from my lowest weight since then. My TDEE is around 1620 according to online calculator and my watch. 4-5 times a week I hit 10.000 steps. However, last January I had to stop lifting due to an injury (shoulder tendon tear + scapula dyskinesia), which I'm now getting physiotherapy for. The 'recovery' is going to take quite some time. I can't do any lifting, and even leg workouts hurt (holding myself on the chair handles doing leg extensions/curls etc). I eat around 1200 a day, what I typically eat per day: Breakfast : (+/-250 kcal)   Mix of berries/forest fruit with whipped cream unsweetened or full fat Greek yoghurt OR   Spinach almond milk smoothie with scoop of whey, and unsweetened whipped cream    Lunch : (+/- 300 kcal)   Salad with cucumber, tomatoes, can of tuna or chicken, light mayo (15 grams) OR   2-3 fried eggs with salad and +/- 150 gr full fat Greek yoghurt and drizzle of honey    Dinner : (everyday between 400-600 kcal, depending on the meal)   Usually 200 gr beef, chicken or fish and 200-400 grams of veggies   2x per week homemade creme brÃ»lÃ©e dessert (120 kcal)   I feel like I'm not losing anymore, and only slowly gaining.. I tried incorporating carbs again/lowering fat intake (didn't work), eating more protein/lower carb/moderate fat (didn't work)... Anyone ever been in the same situation and how did you break your stall? Thank you in advance for your advice/help. Much appreciated! Edit: blood work checked, everything comes out perfect. â\u0080\u009cProgress pictureâ\u0080\u009d since last year: IMG-5730.jpg     "], ["Help Needed on Preventing Loose Skin After Significant Weight Loss", "6", "4", "2024-04-12T21:37:06.983000+0000", "https://www.reddit.com/r/loseit/comments/1c2l14q/help_needed_on_preventing_loose_skin_after/", "Hi everyone! I'm planning to lose around 20kg over the next 6 months, and I'm concerned about the possibility of having loose skin, especially around my belly. I'm 43 years old man, and understand that skin elasticity might not be as good as it used to be. Does anyone have tips or experiences they could share on how to minimize loose skin during and after weight loss? Also, if you've tried any treatments or products that helped, I'd love to hear about those as well. Thanks in advance for your help!    "], ["Weight Loss Help needed + IBS and Food Allergies", "22", "2", "2023-07-17T06:01:24.180000+0000", "https://www.reddit.com/r/loseit/comments/151taot/weight_loss_help_needed_ibs_and_food_allergies/", "Ok so I'll make this really easy to digest (have a pun.) I am 6'2, weight 280lbs. I work out maybe 3-4 days a weight. It's hard to shed the weight because I know I'm lacking in nutrition. I've started making fruit smoothies in the morning with what I CAN eat + a Rice/Marine Collagen Protein Blend (30g,) and that's usually my breakfast until I eat again usually 11 hours later because of my job. I've been struggling with my weight management/loss due to having IBS plus a very tedious fucking list of foods I cannot eat, which I'll list below.   Eggs - Allergic   Dairy - Intolerant   All nuts - Intolerant   Onions/Garlic - IBS   Tomatoes/Basically anything acidic   Tuna Fish (causes a scombroid reaction)   Process/Frozen meats (not always, but most things.)   I can mostly have potatoes, but I have to limit the intake/cooking   Red Meat (most of the time.) Even Frozen meatballs screw me over.   High Fiber foods so no Broccoli, Kale, Beans, etc,.   Acai/Blueberries don't always mesh with me    I mostly am just subsisting off Sourdough, Guacamole, and chicken breast with carrots but I'm starving a majority of the time because I have very little I can snack on. I can have MOST other fruits, especially bananas/mango/strawberry. Sweet potatoes are ok but last time I tried having them on a regular basis, my stomach was not about that. I drink Kombucha now on the reg, and I seem to be at my best when I have Rice/Chicken/Bell Peppers with maybe SOME sauce (as long as I make it my-self.) Pork seems to generally be ok, but it's so high in sodium AND fat. Pork Loin is amazing, but I'm not really convinced it is appropriate for weight loss. The Low FODMAP is applicable to some, but definitely not to me. If anyone here has had similar struggles or has any thoughts or suggestions to help me meal prep, or just find a way to deal with this. It's very stressful, I don't have sugar, maybe coffee in the morning, but being at war with my body over this has caused some very rough nights lol. Anyways, thanks everyone, in advance.    "], ["Help needed! Bib sizing during weight-loss - better to have them too big or too small?", "10", "1", "2024-06-20T09:25:17.890000+0000", "https://www.reddit.com/r/cycling/comments/1dk7evx/help_needed_bib_sizing_during_weightloss_better/", "Hi there, I've recently gotten really in cycling and with some dietary changes, I've lost a bunch of weight as well. Now my shorts are getting a bit too big for me, they still hang on but are loose and will def be too big for me in a month if I continue on the same path. It's already getting a bit uncomfortable. Now I know that ideally they should fit like a glove, but I'm not super excited about the idea of buying a new pair every couple of months. If you had to choose, would you rather wear a pair that's a bit too tight or a bit too loose? Also, is there something else I should take into consideration, fit-wise? I think my first pair fitting reasonably well was just beginner's luck as I had no clue what I was doing :D    "], ["Help needed! How much weight loss, if at all can I expect with this change in my lifestyle?", "9", "0", "2023-09-19T18:24:24.162000+0000", "https://www.reddit.com/r/WeightLossAdvice/comments/16myejl/help_needed_how_much_weight_loss_if_at_all_can_i/", "I'm 21 M, with a little tummy that I've gained in the last year or so. I have been skinny all my life so I didn't really keep a check on whatever I was eating. But recently, I've started keeping a check on everything I'm eating, cut down on fried food and sugars. Also, I try to skip a meal everyday. But the thing is I replace the skipped meal with roasted peanuts. I don't know if that's healthy or not. I generally eat around 100 gram of peanuts at once, really seem to love them. For the exercise part, I go for running everyday and try to complete 3 km within 20 minutes. That is all, no weight training. So I'd like to know what additional changes I can make to my lifestyle, considering I'm a medical student with a lot of time constraints. Also, how much weight per month can I lose with the above mentioned changes? It'd be great if someone could help    "], ["Is it worth the money??? HELP NEEDED", "22", "0", "2024-05-26T18:28:55.792000+0000", "https://www.reddit.com/r/Zepbound/comments/1d17r8x/is_it_worth_the_money_help_needed/", "Hello all I have been going back and forth for months and months over weather the cost of medicine is really worth it. Some background on me. I'm 26yo with a current weight of 345 lbs. Biggest iv ever been. About a year ago I was given a sample pen of ozempic and worked great but when the sample ran out my insurance refused to cover it. I jumped thru all the hoops and finally got a PA for saxenda. Unfortunately insurance would only pay half. Over $500 a month is just insane and not possible on my budget. I started going to a weight loss clinic and was getting what I'm assuming was a salt version of semaglutide. The weight loss I seen with the compound was just not worth paying 35 a week for so I stopped. At the beginning of this year I found the discount card for zepbound and got it. Called my insurance to verify out of pocket price but the medicine had not been added to the formulary. I have been checking about every month with insurance and finally today I found out it's been added. Insurance will still only pay half around $470  and the discount card will take off $150 a month. So is it worth spending $320 a month? Or am I better off trying another weight loss clinic. Thanks in advance for any help!    "], ["Urgent help needed. Scientific Wonder!? Can't lose weight after SSRI.", "88", "0", "2023-07-02T22:03:49.457000+0000", "https://www.reddit.com/r/loseit/comments/14p0nf5/urgent_help_needed_scientific_wonder_cant_lose/", "Edit for clarity/TL;DR: Has anyone seen or experienced something like this before (SSRI related weight gain that isn't impacted by diet/movement) ? If yes, do you have any ideas on solutions?  _____________________________  8 month update: (3/4/2024) - 34/F/5'3 - Current weight: 183lbs (lowest weigh-in on the journey)   Jan 2023: Cut out alcohol - Result: Alcohol consumption does not seem to be impacting weight (190-193 lbs)  Feb 2023: Reduced portions and movement - Result: portion control, calorie restriction, and moving more showing no impact on weight loss  (190-193 lbs)  April - May 2023:  Reduced portions - eating once a day on aderall with no appetite - Result: first week of Adderall showing no impact on weight loss  (190-193 lbs)  June - July 15th 2023: Liquid protein shake diet - Result: Adderall + severe calorie restriction, supplements, and moving more are showing almost no impact on weight loss (191-190 lbs) *** CONCERN no carb + 600-800 cal a day =  *Lost my period and had super low energy*   July 15th - Aug 5th 2023 - (*Vacation) post vacation weigh in at 190 - no change  Aug 5th - October 11th 2023: Debilitating depression over thoughts about weight: most days spent in bed - drank a lot of alcohol - in 24 hours would drink a bottle of wine. Had cake for breakfast several days - Result: Weight loss, body composition decrease: weigh in at 184 lbs \"down 2 lbs of fat and down 8 lbs of muscleâ\u0080\u009d - Obesity specialist  serious  depression leads to loss of muscle (??)   October 11th - Nov 20th 2023: Weight training 3X a week: Result: Working out and eating small portions is making weight increase, not decrease; Weight: 186 lbs  November 20th - December (*Vacation) - ate a diet of mostly cheese and cookies (like... A LOT of cheese and cookies) - post vacation weigh in at 186 - no change  January 2024: Result**:** Eating more veggies, more protein, getting more sleep & getting more movement is making weight increase, not decrease. Weight: ~188 lbs no fat loss (Weight 1/23/24: 187 lbs - Weight 1/30/24 ~188 lbs)  February 2024 : Started Metformin - Result: Metformin + Eating veggies & protein, no alcohol, getting regular sleep, getting more movement (7-15K steps a say - average of 10K) makes no impact. ***Weight fluctuated between 188-183lbs depending on the day! - no discernible change From my specialists scale: \"you gained a pound of muscle, lost a pound of fat\" - Obesity specialist 2/28/24  Conclusion: I am able to gain and lose muscle, but movement and diet have no impact on my fat composition. If I binge eat/drink cheese/cookies I gain nothing, if I take in as little as 600 cal of protein shakes a day and work out, I do not lose anything.  Overall results:  Putting my life on hold and obsessing over weight loss with constant movement, eating well under maintenance:  I lost no more than 1-3 lbs fat in a year.   March 2024 : Starting Zepbound 2.5 ______________________________________ Original Post:  33/F/5'3 - Current weight: 190lbs  Age 20-31: Maintained 125-150lbs depending on sickness/activity level. Usually stayed around 135lbs.  Background:   1.)  2005-2006: *Took an SSRI* and gained up to 20lbs per month after stopping an SSRI with no change to my diet and gained a total of 75lbs.  ****Then, after 3-4 years off of the SSRI - the weight literally FELL off without me trying.   2.) 2021-2022: *Took an SSRI* and gained by 50 lbs in 4 months even while literally starving self (one-0 meals for days on end) while taking/after stopping Fluoxetine (Prozac). _____ Pre-obesity doctor_____     Diet: Intermittent fasting: Eating whatever, but usually a balanced & veggie focused 2 meals a day (12-2pm then dinner at 7-9pm)  with Coffee (no or VERY low sugar) for breakfast. Snacks whenever, but not a lot.    Water: 12-20oz of water per day.    Alcohol: 0-4 times a week 3-8 drinks. Usually just tequila and soda, but sometimes balanced mixed drinks.   **Activity:** 3k steps a day on a normal day.    _____After Obesity doctor: (2+ months)_____     Diet: Up to 2 meals a day: fish or chicken & veg. 0-1 teaspoon of oil when cooking. 8oz of food or less per meal. A couple weeks ago, after realizing I was starving myself and almost passing out durring workouts (400 cal by 5pm and doing cross fit), I switched to protein shakes and 1-2 SMALL meals a day (a cup or less of food). (800-1K calories a day - tracked)   note* I have a 2 vacations durring this time and I've maintained this diet, except 4 days I had 2 \"normal\" size meals.     Water : 40-80oz a day    Alcohol: ( drank 7 days total in 2 months)     4 days: Had 2 drinks or less, tequila and seltzer.   2 days: 2 mixed drinks with veggies blended in: all sugar removed.   1 day: 5 glasses of wine      Activity: 6-10K+ steps a day (up to 17K) - I integrate swimming and cross fit as well. I usually have 2-3 lower activity days a week.   _______________*Edited & Updated* Literature Section ______________  *If* you feel the need to share a boiler plate weight loss recommendation based on CICO or feel like accusing me of lying about my experience -  I request you read these Medical research articles BEFORE REPLYING*:     https://www.eatingrecoverycenter.com/conditions/atypical-anorexia     https://bmcmedicine.biomedcentral.com/articles/10.1186/s12916-022-02433-x     https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5439472/     https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4850471/     https://www.bmj.com/content/361/bmj.k1951    Obtained from a genetics company I contacted about this issue: https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8215694/     **Weight gain regardless of CICO** : Serotonin transporter deficiency drives estrogen-dependent obesity and glucose intolerance  https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5430688/     ________________________________________________________________________________   *** My Ask ***   Has anyone seen or experienced something like this before (SSRI related weight gain that isn't impacted by diet/movement) ? If yes, do you have any ideas on solutions?     "], ["Help Needed! - Slow Progress on Zepbound", "54", "3", "2024-02-19T14:24:15.207000+0000", "https://www.reddit.com/r/Zepbound/comments/1auoh6z/help_needed_slow_progress_on_zepbound/", "Hello Everyone! I am a 35M, Height 6'1\", SW 315.8lb, CW 301lb, GW 180lb I started my Zepbound journey on 01/09/2024 and am currently taking the 5mg dose. Tomorrow will be my 3rd injection. Fortunately, i have had 0 bad side effects. I sleep fine, no headaches, no nausea, no stomach pains, no rash at injection site - only very very mild constipation due to lack of eating. That said, I feel like my progress is a bit slow? I will be starting week 7 tomorrow and I'm only down about 15lbs - in the grand scheme of things this is great, however I have been struggling with eating. I barely eat all day - i confine myself to basically one meal a day and a protein shake in the morning. I am not exactly calorie counting but I am definitely eating much much less than I used to. For example, i cant even finish a full chicken breast. I can't finish a salad serving (half a plate). My diet consists of mostly vegetables and protein, i have almost entirely cut out carbs (rice, breads, etc). My single biggest weakness right now is..... ice cream lol. About every other day I end up having like 2/3 cup of Haagen Dazs ice cream. Is this what's destroying it? I am also not working out at all - have little to no energy left when i get done from work. What can i do to speed up my weight loss in a healthy way? I am pretty much maxed out in the amount of food i can eat (1 small meal a day with no munching or snacks in between). Thank you for reading and thanks for any help!!!  Edit: Forgot to add that almost all of that weight loss was when i was at 2.5mg. I haven't lost much while on 5mg even though the appetite suppression is much stronger. Past 3 weeks i've lost like 2lbs...    "], ["Need help with my wife's weight loss...", "76", "0", "2024-06-08T01:37:29.599000+0000", "https://www.reddit.com/r/Biohackers/comments/1darizy/need_help_with_my_wifes_weight_loss/", "Hello everyone, I would appreciate it if you guys can chime in please. My wife is about to turn 30 and since we got married, she has gains 25 to 30 pounds. Because she is short (5 feet 1), it shows and it bothers her. She was ok before marriage but after marriage she has gained this weight. She has had her medical tests done. All the tests came out fine. She doesn't have any condition. She doesn't have PCOS. Her tests suggest that she is very healthy. All the doctor recommended is that she should take iron supplements because her iron was low and she has been doing it. She doesn't eat more than 1500 calories a day. She has been going to the gym but nothing seems to be working. We are really at our wits end here so I would really appreciate it if you can please tell me what she can do to lose those 25 to 30 pounds. Thank you!    "], ["Need help with weight loss plan", "25", "12", "2024-06-14T16:54:11.118000+0000", "https://www.reddit.com/r/Weightlosstechniques/comments/1dfvjm6/need_help_with_weight_loss_plan/", "I am a 25 year old female. I'm 5'6 and 160lbs, my goal is to be around 135-140lbs. What is the best way to achieve this goal? I used to be really small, so I never had to think about weight loss before.  I know nothing about it and have no idea what I'm doing. Any help and advice is greatly appreciated!    "], ["Need help with my weight loss journey ", "48", "13", "2024-02-18T03:05:03.832000+0000", "https://www.reddit.com/r/WholeFoodsPlantBased/comments/1atk15o/need_help_with_my_weight_loss_journey/", "I've been doing this diet now for about 2 months. And yes, I know this is a lifestyle change and not just a diet to lose weight. But my weight makes my pain (chronically ill) a lot worse so I really need to lose it. I follow Dr Michael Gregors advice for losing weight on a wfpb diet. I'm doing everything right and I haven't lost anything. I also do aquaa aerobics every single day. It's the only physical activity I can do. I spend most of my time in a bed. Not by choice. I'm hoping eventually this new lifestyle will improve a lot of my symptoms. Anyway, before I started the wfpb, I spent about 2 months only eating vegetables and a little fruit. I lost 10 kilos in the first 2 weeks but then it stalled. I thought it must have been because I wasn't eating enough. Now I eat properly and I still can't lose anything. I don't understand what's going on. I'm eating all the right things and none of the wrong things. I only have a small amount of nuts. I work out for at least 2 hours a day. My blood work is fine. So I don't think it's a medical thing. I couldn't possibly do more. I just keep waiting for my plateau to be over but I don't think I'll ever lose this weight. I've googled this but couldn't really figure it out. I thought maybe someone here could offer some advice. Thanks in advance â\u0098ºï¸\u008f Edit: I forgot to mention, I also take a bunch of different natural weight loss supplements. I started buying them because I couldn't lose weight. But they've made no difference even though I've taken them as directed for months. Edit 2: I just wanted to thank everyone for all the amazing advice. I have learnt so much more than I ever thought I would. I honestly thought I was already doing all the right things. But I see now that I have to work extra hard for my weight loss. I'm cutting out nuts and most grains/seeds. I'm going to try my best to eat my greens raw. And I'm going to increase my flax intake for the omega 3's. Such great advice! Can't wait to see how I go. Thank you! ð\u009f\u0098\u008a 7 day update: I've lost 6kgs since I posted this! I'm so happy to be over my plateau. Thanks again for all the great adviceð\u009f\u0098\u008a    "], ["13 and need help with weight loss", "22", "3", "2024-06-29T00:40:06.513000+0000", "https://www.reddit.com/r/FTMFitness/comments/1dqytt2/13_and_need_help_with_weight_loss/", "I'm doing the BMI and it shows I'm overweight, and I don't really know how to lose weight, because I'm trying to work out more but the fact that I'm overweight is distracting me I'm 130.6 pounds and 5'0 I'm trying but I feel like giving up, I need tips, I have no idea how to start a calorie deficit either because it's super confusing, but all I'm getting is I'm supposed to burn more calories than I eat? How am I even supposed to burn that many calories? Need advice or tips on how to lose weight    "], ["I need help with my weight loss.", "15", "4", "2024-06-15T16:12:17.904000+0000", "https://www.reddit.com/r/WeightLossAdvice/comments/1dglewl/i_need_help_with_my_weight_loss/", "Hi, I 16f am overweight. I weigh around 270 and it's really disappointing to me because I try to lose weight, I go on diets and it'd be good but the I'd stop them so fast. How do I change that? What can I do to make me focus on my diet and lose weight?    "], ["Need help w/ Weight Loss", "3", "5", "2024-06-24T20:00:13.648000+0000", "https://www.reddit.com/r/PCOS/comments/1dnmu7p/need_help_w_weight_loss/", "So I got diagnosed with PCOS back in January 2024. I am 20F, 230 pounds and 5'7. I've always been overweight a while and my gynecologist that diagnosed me just suggested weight loss and birth control. So for the past couple of months, (mind you I'm in college) , I've been making smarter choices with my food like incorporating more protein and fiber, and always cook majority of my meals at home. I do love sugar and desserts so I allow myself to have a sweet treat each day but have a healthier dessert such as a fruit crisp, smoothie, or dark chocolate. I would allow myself to have an actual dessert once or twice a week. In May 2024, I visited the endocrinologist and I notice I just maintained my weight. Glad I didn't gain any but I am wanting to loose. Same thing said, just loose weight and birth control. I got lab work to see if I have IR and I don't but my cholesterol is high but improved since I last got tested back in January. I don't track calories because years ago I did and binge. I am trying to walk 3x a week for 30 minutes because I enjoy it. What are options I should do? Feeling sad that I feel i'm not making the best improvement after it being months. I know people suggest calorie deficits but how do I go about that without calorie counting? And how do I stick with this plan throughout college as well?    "], ["Need help with weight loss", "3", "0", "2024-06-25T20:50:26.469000+0000", "https://www.reddit.com/r/weightlossdiets/comments/1dogg65/need_help_with_weight_loss/", "I need to lose weight and wondering what the best way is. I have started working out and using resources like Peak Potential to help get workout plans and diets, but wondering what the best advice is. I try and working out 4-5 times per week and have been trying to eat less and do more cardio (running/walking). I have been doing this for about 2 week and haven't seen much progress. Any help is greatly appreciated Thanks    "], ["need help kickstarting weight loss", "8", "0", "2024-05-15T00:25:43.507000+0000", "https://www.reddit.com/r/PetiteFitness/comments/1cs7p4t/need_help_kickstarting_weight_loss/", "30f 5'2â\u0080\u009d CW: 118 lbs. GW: 110-113 lbs. (where i feel best). gained a few pounds over the last year and i look extremely bloated and puffy and just don't feel great. i've been trying to eat in calorie deficit and working out but i don't think i'm doing enough. any advice for me to help kick start losing a few pounds? my weight has not budged!    "], ["Help for weight loss meal prep", "22", "19", "2024-04-19T07:32:44.801000+0000", "https://www.reddit.com/r/EatCheapAndHealthy/comments/1c7qy05/help_for_weight_loss_meal_prep/", "I'm trying to lose weight, unfortunately I don't have much time to exercise or money to pay for a gym membership, and I feel like I'm not eating healthy, even if I eat at least 1 fruit a day. I have been working/studying every day and I can't always prepare the healthiest meal to take to work and I end up eating natural sandwiches or fast food.  I have no idea what to do and I'm starting to feel like I'm going to stay like this forever. Can someone help me please?    "], ["Healthy Mutton (3alouch) Recipes for Eid? - Need Help for Weight Loss!", "5", "4", "2024-06-07T15:07:44.724000+0000", "https://www.reddit.com/r/Tunisia/comments/1dad2dt/healthy_mutton_3alouch_recipes_for_eid_need_help/", "Hey everyone, Eid is coming up, and I want to enjoy some mutton (3alouch) dishes while staying on track with my weight loss goals. Do you have any healthy mutton recipes? I'm looking for:   Low fat and calorie options   High protein   Veggie-packed   Healthy cooking methods (grilling, baking, steaming)   Also, any general weight loss tips would be amazing! Thanks, and Eid Mubarak to all celebrating!    "], ["Help for weight loss/muscle gain", "2", "0", "2023-11-22T20:07:45.826000+0000", "https://www.reddit.com/r/loseit/comments/181icxd/help_for_weight_lossmuscle_gain/", "my info: 25 m 6'0 200lbs At my biggest i was 245 and my lowest was 180ish. I have a physical job where I also stand for 12 hrs but my diet/drinking habits have always been pretty crap. Even after getting to 180 and wanting to be proud of myself, I still had moobs,gut, and love handles. Too me, I notice I always lose weight from my face and have skinny arms but everything else seems to stay the same. I've went back to bad eating and drinking habits again but I'm wanting to get back into the grind! (after thanksgiving of course) I guess this post is to ask for advice, certain meals I should be eating, workouts for chest and stomach fat loss, cardio or weight training? I wanting the \"lean\" look and not just a skinny or skinny fat look. Maybe someone can give me a routine/personal experience with weight loss.  Last thing! I've gotten many mixed answers on how many cals I should be eating a day. When I was losing weight I tried to stay under 2k cals daily but I have no idea if that's too low. PLEASE HELP    "], ["Plateau After Initial Weight Loss, Despite Strict Calorie Deficit and New Exercise Regimen. Help for reliable tracker?", "8", "0", "2024-06-16T00:32:33.393000+0000", "https://www.reddit.com/r/loseit/comments/1dgvo2o/plateau_after_initial_weight_loss_despite_strict/", "Hi everyone, I've been on a weight loss journey since March 1, 2024, and I could use some advice. Here's a bit about my situation: â\u0080¢ Starting Weight: 132 kg â\u0080¢ Current Weight: 121 kg â\u0080¢ Height: 185 cm â\u0080¢ Age: 39 years old â\u0080¢ Initial Caloric Intake: 1500 calories/day â\u0080¢ Current Caloric Intake: 1750 calories/day  https://imgur.com/a/NyXlQNN  Background: â\u0080¢ Initial Success: I lost 11 kg over three months and I'm very happy about that. But most of it at the beginning was likely due to water weight loss and stopping creatine (which holds water). â\u0080¢ Recent Slowdown: Over the last month, I've only lost 2 kg despite maintaining a significant calorie deficit. â\u0080¢ Activity Level: Recently introduced strength training and cardio. Previously, I was more sedentary. â\u0080¢ Calorie Tracking: I use a Fitbit to track calories burned and have been meticulous with logging my food intake. Current Approach: â\u0080¢ Daily Intake: Currently consuming 1750 calories/day. â\u0080¢ Exercise: Strength training 3-4 times a week and incorporating both steady-state cardio and HIIT. Concerns: â\u0080¢ Despite what should be a substantial calorie deficit (1000 cal per day) my weight loss has slowed considerably. â\u0080¢ According to the scale I haven't  lost muscle mass (150 grams of protein daily) but I wonder if the slowing down has to do with metabolic adaptation. â\u0080¢ I compared calories burned on my fitbit with actual calories in food and fitbit must be off of 700 calories daily. But I used the tdee calculator for  sedentary lifestyle  (before I started training in the last two weeks) and things still don't add up. Questions: â\u0080¢ Caloric Intake Adjustment:  Is it possible that if my metabolism has slowed down 1500 calories are too much and I should go lower? Now that I started training I'm at 1750. â\u0080¢ Smart watch: Are there more reliable trackers than Fitbit that don't overestimate this much your activities? â\u0080¢ Metabolism: Is it possible my metabolism has slowed down so much that the tdee calculator is overestimating my daily calorie intake and would training start helping reigniting it? â\u0080¢ General Advice: Any other strategies to counteract metabolic adaptation and continue losing weight effectively? I appreciate any advice or insights you can offer. Thanks in advance for your help! Feel free to share your experiences, tips, or suggestions. I'm open to adjusting my plan and trying new strategies to achieve my weight loss goals while maintaining muscle mass and overall health. Thanks again!    "], ["Graves disease, needing some macro help for weight loss", "1", "1", "2024-01-05T16:09:28.912000+0000", "https://www.reddit.com/r/IIFYM/comments/18zafoj/graves_disease_needing_some_macro_help_for_weight/", "I was recently diagnosed with Graves disease and started on PTU for treatment. For reference, the idea here is not to drop me hypothyroid, but instead get me just within the normal range. My understanding is there is some expectation that my metabolism will slow with medication. I have not yet gone for labwork to check how my levels are looking, this will be done in 2 weeks. This recent diagnosis has inspired me to get fit and try to lose some stubborn weight. I've signed up with a personal trainer and have been tracking the macros she has given me for the last 3 weeks. Despite working out daily (3 days strength x 45-60min, 4 days cardio x 45-60min) the scale has increased 3 lbs in 3 weeks. This is beyond frustrating. Here are my stats: 30yo Female, 5'11.5\", Starting weight 186lbs, Goal weight 160lbs. Now 189lbs. Current macros: 1800 cals, 172g carbs, 72g fat, 116g protein Anyone see any glaring abnormalities with my macros that should be adjusted?    "], ["GYM- in need of help for starting out with Fat/Weight loss as I have 0 endurance", "6", "0", "2024-06-04T00:23:58.319000+0000", "https://www.reddit.com/r/WeightLossAdvice/comments/1d7jyvw/gym_in_need_of_help_for_starting_out_with/", "Hi everyone! I am looking to burn fat/lose weight as I have gained about 40 pounds of fat. I just started keto and signed up for Equinox last week. I feel like when I go I have NO idea what to do! I just wind up walking briskly on the treadmill. Any tips on beginner classes or the videos on the app that will help? Simple work outs for beginners that are overweight? I'm extremely out of shape, I cant do a single push up. I can do sit ups and low weight lifting with free weights. I'm F/31 and currently at 170 pounds and I USED to be 120. I got up to 200 IBS during covid. Any help or suggestions when it comes to classes for beginners or easy workout routines that you started doing when you first started to get active and had no endurance would be amazing. Thank you guys!    "], ["Weight loss + management help for a mini.", "4", "3", "2023-08-02T08:22:20.102000+0000", "https://www.reddit.com/r/Dachshund/comments/15g2yoj/weight_loss_management_help_for_a_mini/", "I need weight loss advice for Beenie, she is a four year old (Mini) dapple saus and recently we've ran into an issue that has me stressed; her weight. All of her life she has had a healthy weight, a nice slim sausage she was until I had a few health issues that landed me in hospital for a long while. I was in there for basically a year- this meant I had to leave my girl at the only place I knew she would be loved and cared for as much as I would've while I was away: My parents house. They adore her- she's their favourite four legged friend and while I was in hospital they treated her like gold- HOWEVER, they also fed her a ridiculous amount of food (My parents are euro so every time they'd see herâ\u0080¦ queue the â\u0080\u009c She's too skinny! â\u0080\u009c because she was slim & healthy.) in the time she was with them she's gained about 3-4 kilos & has gone from 5/6 kilos to 9/10 kilos (roughly estimating) So now, I have to try and get her back down to a weight that won't affect her bones. I take her for walks twice a day & play with her during the day as well as try and keep her on a new diet. They were feeding her boiled sausages & dry food. The dry food was one for big dogs ( they have a amstaff) and they leave a full large bowl out for her to constantly graze on which she never had before so she just gorged herself until she became a kransky. ( I was absolutely mortified when I found out her food regime at my parents but they took her in with love & she was happy so as much as I suggested to please feed her less or give them what I would feed her they refused because â\u0080\u009c she is happy eating that and Manfried (their dog) eats it too.â\u0080\u009d ) I've started her new diet which consists of; DINNER: 1/2 cup of science diet kibble for weight loss (Dachshund specific) with omega 3 oil & fish oil mixed with 40 grams of wet food (Royal canin dachshund specific) and an egg cracked on top. Breakfast: 1/2 cup of the same kibble with omega 3 & fish oil and 40 grams wet food. Constant access to fresh clean water changed 2/3 times a day. ( this has always been the same since she was a pup) No treats throughout the day. Is this too intense or relaxed of a diet? What can I do to improve? I just want my pup to be the healthiest she can be so any suggestions are welcomed. We are in Aus btw.    "], ["Some help for encouraging my bf with his weight loss", "6", "4", "2023-07-26T13:26:46.125000+0000", "https://www.reddit.com/r/WeightLossAdvice/comments/15a5vby/some_help_for_encouraging_my_bf_with_his_weight/", "So, my long distance bf has been actively trying to lose weight for ~3 months now, and is getting nowhere. His main issue is food, he enjoys the actual workouts, but has something of an addiction to drinking sweet stuff and a lot of fried food. Hes getting progressively sadder about his lack of progress (he has depression, medicated. It still affects him though.) My issue is that I don't know how to motivate him without making him feel bad, and it kinda breaks my heart to do that. I'm not forcing him to do this, I told him my preference and he is doing this himself, but I don't know how to motivate him. Any suggestions are really welcome! (For clarification, he's seeing no progress in that he isn't losing weight. He seems to be trading fat for muscle pretty well; he is seeing strength improvements but weight is the big issue for him. Thank you!)    "], ["I need help for my daughter", "171", "556", "2023-12-07T04:40:51.831000+0000", "https://www.reddit.com/r/loseit/comments/18cnmy7/i_need_help_for_my_daughter/", "Okay my daughter has slimmed down a lot. Like she lost 45 pounds or so. I knew she was eating less but I thought it was in a healthy manner. For example if we got fast food she would get a burger and either not get fries or share them. Come to find out she has only been eating a 1000 calories or so a day for months according to what she was tracking in the Fitbit app. I don't know how accurate she has been tracking either because I didn't know she was until today. She weighs 116lbs and is 5'4â\u0080\u009d. I am going to talk to her tomorrow about how eating so little is not healthy but I need some info. According to a tdee calculator she should weight between 120 and 130 and consuming 1600 calories. Is this accurate? Also my worst fear is she might have an eating disorder and I don't know how to tell. Do I call her pediatrician tomorrow? Do I address her calories with her and see if it was just ignorance? I don't want to give her a complex and I feel like I got to be careful in how I approach this. Also if there is a better sub for this please let me know. Edit. She is 14. We are going to talk to her and come from the side of giving her information. Meaning there are healthy and unhealthy ways to lose weight, be into fitness, etc. I just wanted to get a better understanding of what a healthy weight range was so I could show her the correct calories via a tree calculator. I understand 1000 calories too low. If she is combative I am scheduling a doctor visit right away. Edit #2 We have never criticized her weight. Both my wife and I had parents that were critical of our weight for different reasons growing up. She was 160 last year at her checkup and she was 130 this year at her checkup. The doc asked her about her weight loss and she said she was making better choices. Drinking water instead of soda. If she got a treat, instead of getting a shake she would get an ice cream cone. She wanted to go on walks and be a little more active. None of that screamed a problem. To us at the time we didn't think that was bad. We didn't know she was counting calories until recently and we didn't know she was trying to stick to a 1000 calories. We want to approach this a loving caring way. Hence why I asked about tdee and what is a healthy weight range. If 115 is okay for her gender and age that is fine but she needs to eat more and do this in a healthy manner. Final update. We have an appointment to talk to her pediatrician tomorrow(not with her) to get some advice on how to move forward and approach this. We were going to talk to her tonight but decided to wait until we talk to her doctor. Appreciate the input from you guys.    "], ["Help for a teen", "4", "0", "2024-01-22T14:18:26.981000+0000", "https://www.reddit.com/r/WeightLossAdvice/comments/19cwn9y/help_for_a_teen/", "Help on Loosing weight as a early teen? Can't go to gym legally so I'm stuck. Also love mountain biking and hikes. Always struggled with weight arfter Covid. I'm 5 foot 8 and scale batteries are out but can't find any. How to do this on no money ? Questions:   Is mountain biking good for weight loss?   How to weight loss in a mountain bike?   Exercises to loose weight?   Do dumbbells loose weight?   Dumbbells I'm shower?   Can't cook dinner for myself soâ\u0080¦?   Diet ?   Does loosing body fat loose thigh or leg fat?   How to loose leg fat?   Is Skinny not buff possible and healthy?   Keeping it a secret?   Does the gym help with weight loss?   Eating too much fruit?   Not eating enough sugar?   How to loose leg and thigh fat and width?   At home weight loss?   Where to start?   Weight loss apps?   When to start weight loss is the best?      "], ["Free help with weight loss!", "73", "14", "2024-03-14T19:30:44.096000+0000", "https://www.reddit.com/r/Weightlosstechniques/comments/1betqkz/free_help_with_weight_loss/", "I'm a nutritionist and I love answering people here on Reddit. A few days ago I made a post on this page helping some people with weight loss doubts. I'm once again taking time to answer questions about weight loss, muscle mass gain and physical and mental performance!    "], ["Help with weight loss ", "17", "3", "2024-06-07T23:58:36.692000+0000", "https://www.reddit.com/r/AnimalBased/comments/1daplz3/help_with_weight_loss/", "I've been at this whole animal based thing since Easter of this year. I'm trying to heal PCOS and lose over 100lbs and have yet to lose any weight or inches. People say \"you might have to heal first\" but I'm also having more heartburn than ever and it doesn't seem that any of my PCOS symptoms are improving in the slightest, I'm just not seeing anything after such a drastic diet change. I am a 28 year old, 5'5, female (idk if that's even helpful since most people say calories don't matter on animal based). My day of eating usually looks like this: Breakfast: 3 eggs, half pound 85% 15% ground beef, coffee with 1tbs honey, 1/2 cup raw milk - 1 tbs butter Lunch: half pound 85% 15% ground beef with a banana and slight drizzle honey (not even a teaspoon) Dinner: ribeye or New York strip - 1/2 tbs butter Nighttime Snack: serving of fruit I posted in a fb group asking the same question while listing my daily meals and got yelled at for eating fruit at night so today is my first day not doing that. But..what do I do? I lost 100lbs before and I was eating oatmeal for breakfast and then processed food the whole time so idk what's going on here. And again, people say calories don't count with this way of eating but I tracked my typical day of eating at 2,400 calories, but this is how much I have to eat to not get hungry. Help!!!    "], ["Does swimming help with weight loss?", "71", "43", "2023-09-07T14:59:48.162000+0000", "https://www.reddit.com/r/Swimming/comments/16ci1s3/does_swimming_help_with_weight_loss/", "I've been trying to lose weight. I've sorted my diet out and looking into the fitness side of it. I was going out for runs and using the treadmill in the gym but running just isn't for me and already pulled a muscle in my calf a few months back. I've swam since I've been little and even swam competitively in my teens and I can still swim 60 lengths in 30 minutes and I've been enjoying getting back into swimming I was recently telling a friend who use to be a personal trainer and said he had diplomas in fitness and was telling me swimming will do nothing to help with my weight loss and I should go back to running (my calf has healed now) EDIT: Thanks everyone for the replies! I can't reply to all but I have read every single one of them. I'll ignore my friend and his advice and carry on with the swimming, I'll keep the diet going strong and carry on swimming 3x a week!    "], ["Help with weight loss", "14", "0", "2024-06-04T20:06:32.252000+0000", "https://www.reddit.com/r/TherapeuticKetamine/comments/1d86ppm/help_with_weight_loss/", "Hi, I have had major depressive disorder for many years, diagnosed 2011. I have tried every antidepressant out there and am starting Joyous tomorrow.  I have been overeating in general and indulging in comfort foods and have gained a lot of weight. If ketamine works for me to relieve depression and anxiety will my cravings for comfort food and overeating go away. I realize most will be me  focusing on less food, will k make it easier?    "]]