[["Problem with wine on chromebook.", "3", "1", "2024-06-13T19:32:43.707000+0000", "https://www.reddit.com/r/linux4noobs/comments/1df7jja/problem_with_wine_on_chromebook/", "I'm trying to run exe files on my Chromebook using Linux and Wine but I keep getting this problem please help! sudo apt-get update Hit:2 https://deb.debian.org/debian bookworm InRelease Hit:3 https://deb.debian.org/debian bookworm-updates InRelease Hit:4 https://deb.debian.org/debian-security bookworm-security InRelease Hit:5 https://dl.winehq.org/wine-builds/debian bullseye InRelease Ign:6 https://storage.googleapis.com/cros-packages/126 bookworm InRelease Hit:7 https://storage.googleapis.com/cros-packages/126 bookworm Release Hit:1 https://packages.microsoft.com/repos/code stable InRelease Reading package lists... Done W: https://dl.winehq.org/wine-builds/debian/dists/bullseye/InRelease: Key is stored in legacy trusted.gpg keyring (/etc/apt/trusted.gpg), see the DEPRECATION section in apt-key(8) for details. N: Skipping acquire of configured file 'main/binary-arm64/Packages' as repository ' https://dl.winehq.org/wine-builds/debian bullseye InRelease' doesn't support architecture 'arm64'    "], ["Problem with update with wine", "1", "2", "2024-06-19T12:24:12.234000+0000", "https://www.reddit.com/r/kdeneon/comments/1djhv0c/problem_with_update_with_wine/", "Hello. I got problem with my kde neon after update yesterday. I think it's problem of libsdl2-2.0-0:i386. or libfaudio0:i386 Is their my source.list prolem? i only can get libsdl2-2.0-0:i386 2.0.20+dfsg-2ubuntu1.22.04.1 even amd64 lib has 2.28.5+dfsg-2+22.04+jammy+release+build2 deb install cannot resolve dependency... now i can't use wine... Is there any body can help me?    "], ["Problem with wine and nividia driver", "2", "1", "2024-06-19T11:16:14.077000+0000", "https://www.reddit.com/r/linux4noobs/comments/1djgmry/problem_with_wine_and_nividia_driver/", "./setup.exe 0138:err:winediag:is_broken_driver Broken NIVIDIA RandR detected, falling back to RandR 1.0 Please consider using Nouveau driver instead (Same with wine setup.exe command) Then wine windows pops up with title language in upper case, but with no actual language to choose, no options. Clicking next just leads to empty untitled window. How to make them work?    "], ["Problem with wine", "2", "2", "2023-12-27T21:14:03.731000+0000", "https://www.reddit.com/r/archlinux/comments/18sbdwr/problem_with_wine/", "Good morning, I come from Fedora and there I could play PES 2011 without any problem and with the highest quality. Now that I'm on Arch and I installed wine, I can't even open the game. Why don't I meet the requirements?    "], ["Problem with some games after updating wine", "0", "3", "2024-03-03T22:12:17.089000+0000", "https://www.reddit.com/r/Lutris/comments/1b5tp7o/problem_with_some_games_after_updating_wine/", "After updating wine some games start partially off screen: the game display is not centered and part of it is out of the screen boundaries. Any idea why this is happening?    "], ["A weird problem with Wine and Proton", "4", "10", "2023-12-24T06:52:22.008000+0000", "https://www.reddit.com/r/kde/comments/18ppqla/a_weird_problem_with_wine_and_proton/", "I don't know if this is a Wine or KDE issue. In Wayland session, if minimize a game that is running in the full screen mode (not borderless window one), the game hangs up. Just black background, and some sound ambient after restoring. It won't accept any input anymore. In X11, I could disable the compositor, but for Wayland I haven't found workarounds yet.  Is there any way to fix that? Many old games (and some new ones) don't have the borderless window mode. I use Plasma 5.27.10 with Qt 5.15.11.    "], ["Problem with running wine", "3", "2", "2023-09-17T12:16:02.548000+0000", "https://www.reddit.com/r/wine_gaming/comments/16kz6wd/problem_with_running_wine/", "Hello! today i tried to install wine on my pop os, and then wanted to configure it, but cfg or any .exe apps won't open. when trying to open it with terminal it gives me this error: helltina@pop-os:~$ winecfg 0084:fixme:hid:handle_IRP_MN_QUERY_ID Unhandled type 00000005 0084:fixme:hid:handle_IRP_MN_QUERY_ID Unhandled type 00000005 0084:fixme:hid:handle_IRP_MN_QUERY_ID Unhandled type 00000005 0084:fixme:hid:handle_IRP_MN_QUERY_ID Unhandled type 00000005 002c:err:winediag:nodrv_CreateWindow Application tried to create a window, but no driver could be loaded. 002c:err:winediag:nodrv_CreateWindow L\"The explorer process failed to start.\" 00d4:err:winediag:nodrv_CreateWindow Application tried to create a window, but no driver could be loaded. 00d4:err:winediag:nodrv_CreateWindow L\"The explorer process failed to start.\" 00f4:err:winediag:nodrv_CreateWindow Application tried to create a window, but no driver could be loaded. 00f4:err:winediag:nodrv_CreateWindow L\"The explorer process failed to start.\" 00fc:err:winediag:nodrv_CreateWindow Application tried to create a window, but no driver could be loaded. 00fc:err:winediag:nodrv_CreateWindow L\"The explorer process failed to start.\" 0110:err:winediag:nodrv_CreateWindow Application tried to create a window, but no driver could be loaded. 0110:err:winediag:nodrv_CreateWindow L\"The explorer process failed to start.\" wine: configuration in L\"/home/helltina/.wine\" has been updated. 0130:err:winediag:nodrv_CreateWindow Application tried to create a window, but no driver could be loaded. 0130:err:winediag:nodrv_CreateWindow L\"The explorer process failed to start.\" Do anyone knows how to fix it?     "], ["Problem with Quake 1 on WINE on Linux", "4", "4", "2023-12-14T14:14:55.260000+0000", "https://www.reddit.com/r/quake/comments/18i9j65/problem_with_quake_1_on_wine_on_linux/", "Hello, I was curious if anyone could help. So I have purchased Quake1 from GOG, including the enhanced version. It runs trough WINE. The enhanced version runs, but upon exit from the game the screen still shows the last game screen (with the menu) and that's it - frozen. The OS itself is not frozen, I can jump into another console (ctrl-alt-f4 for example) and restart the desktop environment via bash, but I was trying to find a better solution. I am on Lubuntu 22.04 LTS (therefore I have LXQT), Dell Vostro laptop with some Nvidia graphic card. Thanks!    "], ["Problem with wine prefix drive", "3", "3", "2023-08-14T17:39:56.073000+0000", "https://www.reddit.com/r/LinuxCrackSupport/comments/15r1f46/problem_with_wine_prefix_drive/", "First i tried to make my wine prefix location run on my harddrive instead of ssd but no luck. I am still not even sure where my wine prefix is located and i want to find out how to 1: Change wine prefix to hard drive. I did research and found no method i understood on how to do it. i think i know how to do it in lutris, but theres a bug the installer on fedora 38 so i need to use bottles. 2: Fix this issue of no space                   "], ["Anyone else have this problem with their wine?", "11", "0", "2023-08-21T00:01:41.853000+0000", "https://www.reddit.com/r/wine/comments/15wrb0i/anyone_else_have_this_problem_with_their_wine/", "Anyone else have this problem with their wine? I like to collect California and old world reds in the $40-100 range for nice dinners with friends and family but recently I've noticed that about 25% of the wines that i open that I've let sit in my closet for the last 3 to 5 years taste either horribly acidic or have absolutely no notes on the finish, when the tasting notes I read online describe a much more complex wine. Am I aging them too long? Is it possible they got exposed to too much heat on the process of going from the vineyard to my closet? The wines range from so many different regions and grapes and vintages that it makes it hard for me to determine any consistency with the bottles that have this issue.    "], ["Very specific problem with Flashpoint/Wine-Staging", "0", "1", "2023-11-13T03:13:43.444000+0000", "https://www.reddit.com/r/ManjaroLinux/comments/17u1iq3/very_specific_problem_with_flashpointwinestaging/", "Very specific problem but I don't know where else to ask for this, but did something break with Wine-staging at all in the repos? One issue I ran into revolves around the Flashpoint project. If I update to Wine-Staging 8.18, then for some reason, it no longer allows for loading browser games using their project via Basilisk/FPNavigator, it just hangs with this error â\u0080\u009cwine: Unhandled page fault on read access to 00007FFEFFFFFFFF at address 00006FFFFFF791A0 (thread 0058), starting debuggerâ\u0080¦â\u0080\u009d as before though after that.\" Updating to Wine 8.19 did not fix that at all either, but if I downgrade to Wine-Staging 8.15.2, then it works fine, me and Maoijoon spent an hour troubleshooting that and narrowed it down to this. Even trying fresh installs of Flashpoint, since that uses it's own prefix. Basilisk opens like normal on double clicking through normal Wine Staging too, but something about the update just doesn't work with how the scripts interface with it for some reason. They mentioned that it didn't happen on their end using the same Wine Staging versions, so I don't know if something went wrong here or not. EDIT: Tested this on an EndeavourOS laptop I have and didn't run into this issue either.    "], ["Driver/firmware problems with Wine", "8", "1", "2024-05-06T02:15:25.825000+0000", "https://www.reddit.com/r/NobaraProject/comments/1cl80hw/driverfirmware_problems_with_wine/", "Hello, I've been having an issue since I started using Nobara, and it's that I can't install a program that is necessary for the use of my mouse. It's from the brand Elecom, and for now, it's the only mouse I use, so I'm not sure what to do. I tried installing the driver with Wine and Bottles, but it doesn't work. It's supposed to look like this:      But it appears like this, as if my mouse isn't connected:      I have another program called Xpadder, which is for game controllers, and it's experiencing the same issue. If you have a solution for this, it would help me a lot if you could tell me, thanks in advance.    "], ["Problems with wine", "4", "4", "2024-01-21T16:08:58.166000+0000", "https://www.reddit.com/r/voidlinux/comments/19c6pe8/problems_with_wine/", "When using wine it gives an error: MISSING: wine-common>=9.0_2 Transaction aborted due to unresolved dependencies. I am kinda new to void linux , I was trying to also install 32bit packages or wine devel packages , but nothing worked. Anyone has a solution to this problem?    "], ["Wine problems with Ampero 2 Software", "7", "0", "2024-03-24T08:30:27.111000+0000", "https://www.reddit.com/r/linuxaudio/comments/1bmfxsl/wine_problems_with_ampero_2_software/", "Hi all, this is a bit loosely connected to linux audio, but I haven't managed to get an answer yet. Maybe someone of you had seen this problem with another software already. I'm using a Hotone Ampero Stage and want to connect it to my linux system to edit patches, maybe do firmware updates with it. However, I'm unable to get the UI properly running. I'm using the latest version of wine, the software detects the connection of the device, but the UI is either black (dxvk) or with a lot rendering artefacts. The message I get is  012c:fixme:vulkan:X11DRV_vkCreateWin32SurfaceKHR Application requires child window rendering, which is not implemented yet!  Anybody has seen this already and might have a fix?    "], ["Problems with wine AGHHHH", "21", "2", "2023-08-24T16:23:02.236000+0000", "https://www.reddit.com/r/linux4noobs/comments/1606l6p/problems_with_wine_aghhhh/", "Hello guys, Im very new to linux so pls help So im using Zorin os (the latest version), I installed several windows games with the help of wine and i have all libraries and everything to get wine running. The games itself runs perfect but the audio starts to crackle after several minutes (approx. 4 mins) of gameplay I also have Pipewire and it works too, the native Linux games work perfectly but now Im trying to run Saints row 4, Gta sa, Firewatch etc. without audio crackling (gta 4 is the only game that works without audio cracking)  THESE ARE THE THINGS I WANTED TO POINT OUT- the reduce latency option is greyed out in lutris and im using PULSE_LATENCY_MSEC command in environmental variables and set the value to 60 tried to change several configurations in terminal with the help of many forums tried different versions of WINE PROTON tried to use different audio pipelines like alsa, pipewire, oss etc. and much much more but none of the solutions worked for me  Kindly help and ill forever be grateful to you and also sorry for the bad english (my mother tongue is not english) Thanks in advance<3    "], ["Problems with Emerging virtual/wine", "7", "2", "2023-12-15T18:45:25.255000+0000", "https://www.reddit.com/r/Gentoo/comments/18j74ox/problems_with_emerging_virtualwine/", "Hi! A package I want to use a package that depends on virtual/wine, I would like to use wine staging, I have already set the staging use flag for virtual/wine, accepted the ~amd64 for wine staging, virtual/wine, wine gecko and wine mono, but it insists in emerging virtual/wine-0-r10, which apparently is a empty package, because running wine --version states the wine command doesn't exist.    "], ["Problems with Wine and GPU switching", "0", "1", "2024-03-03T08:50:10.428000+0000", "https://www.reddit.com/r/Fedora/comments/1b5cmgf/problems_with_wine_and_gpu_switching/", "Hello, so I've been googling this problem for 2 days now and I found some similar problems but no real fixes to this. Please keep in mind im newbie at Linux so I might've missed something. I have asus g14 zephyrus 2020 model. I followed this tutorial to setup fedora https://asus-linux.org/guides/fedora-guide/ . I installed supergfxctl-gex (I've installed fedora 2 times) and one time i got 3 options to switch between integrated, hybrid and dgpu. Second time i installed fedora and supergfxctl-gex i got only options hybrid and integrated. (a week in between installations). I would like to have the third option again, but i cant seem to fix this       So this brings me to my other problem. When i try running game with command \"wine game.exe\" (as for some reason i cant get it to work through lutris or bottles). It runs the game on integrated gpu. How do I run it with dgpu? Even if i have it set as hybrid, it doesnt \"recognize\" or something idk. Third problem is how do i run games that have been zipped?So basicalpy games that dont have installer. I unzipped it and tried to \"connect\" .exe file in bottles, but it doesnt run, in lutris i did the locally installed game, connected the .exe file and it doesnt work either Thank you so much    "], ["Problems with wine settings window not opening", "1", "2", "2023-12-20T02:02:55.516000+0000", "https://www.reddit.com/r/macgaming/comments/18mj0ho/problems_with_wine_settings_window_not_opening/", "Hi guys ! :) I bought an m3 MacBook last week and I'm setting it up to use. But I had a problem following the guide to use the game porting toolkit. The problem seems to be the wine setting.  WINEPREFIX=~/my-game-prefix `brew â\u0080\u0094prefix game-porting-toolkit`/bin/wine64 winecfg   when I used this command line an error has occurred. Here's what the error is about  002c:fixme:actctx:parse_depend_manifests Could not find dependent assembly L\"Microsoft.Windows.Common-Controls\" ( 6.0.0.0 )   wine: could not open working directory L\"Z:\\\\Users\\\\joe\\\\\", starting in the Windows directory.   wine: could not load kernel32.dll, status c0000135   I've tried several times clean format. but it is same resultCan anyone have similar experiences or help. OS : Sonoma 14.2 / m3 max 14\"    "], ["Problems with getting wine running on a Chromebook", "0", "0", "2023-12-25T16:49:52.379000+0000", "https://www.reddit.com/r/winehq/comments/18qm6xx/problems_with_getting_wine_running_on_a_chromebook/", "I don't know if I'm just being a moron but whenever I click the 'Open with Wine Windows Program Loader' for a .exe file it sort of opens and loads eternally. I have no idea what's going on. Send help. Preferably a tech support guy. Ok but seriously, I have no clue and would appreciate help. Thanks.    "], ["[Ghost of Tsushima] Ghost inputs and problems with PS4/PS5 controllers", "45", "8", "2024-05-17T09:28:11.066000+0000", "https://www.reddit.com/r/LinuxCrackSupport/comments/1cu10bm/ghost_of_tsushima_ghost_inputs_and_problems_with/", "Workaround found!  Name of game: Ghost of Tsushima CPU: AMD Ryzenâ\u0084¢ 5 7600 Ã\u0097 12 GPU: AMD Radeonâ\u0084¢ RX 6800 Proton Version: wine-ge 8-26 (+ others, see below) Game Launcher: Bottles OS: openSUSE Tumbleweed Release Info: Ghost.of.Tsushima.Directors.Cut-InsaneRamZes OR Ghost of Tsushima: Director's Cut (v1053.0.0515.2048 + All DLCs + Bonus Content + Online Multiplayer + MULTi26) (From 32.7 GB) [DODI Repack] (behaves the same way on both releases, no difference) Logs: I wasn't able to gather any relevant logs. Has anyone had an issue with ghost inputs? When I connect either my DualSense or DualShock, the controller is detected, but there are ghost inputs, as if the controller is sending both the XInput (ABXY) and DInput inputs, and the game is spazzing out trying to accept both set of inputs. What I've tried:   Turn off Steam (to prevent SteamInput from being difficult)   Tried connecting with Bluetooth, no difference   Tried RUNE PROPER crack (supposed to have controller fixes, already applied to the DODI repack, but tried anyway with both DODI and InsaneRamZes)   Tried different versions of Wine-GE and Proton-GE (with Steam runtime), makes no difference   Tried Proton with Dualsense patches (to support haptics and resistive triggers), crashes on launch, but last version I could find is fairly old, so not looking too much into this, I'm fine with normal controls without DualSense triggers and haptics   Tried overriding dinput8 to native, no effect   What seems to have had effect, but hasn't fixed:   Going in the WINE control panel interface, and overriding the 'Wireless Controller' entry disables Xinput and stops the game from spazzing out, but the controller mapping is now wrong, with CIRCLE being X and SQUARE being CIRCLE. The game does not support remapping, and I'm not sure if it is possible to remap in WINE/Proton.    EDIT: Workaround found!  If I add the GhostOfTsushima.exe as a non-Steam game to Steam, disable Steam Input, and select a recent version of Proton, the game starts, and the DualSense works correctly. I have no idea what black magic is Steam doing, but it works. EDIT2: For anyone who might find this via search or something, you can get all the haptics and adaptive triggers by using this version of Proton which enables it: https://github.com/ClearlyClaire/wine     "], ["Problems with opening the game", "0", "2", "2024-05-28T18:24:18.645000+0000", "https://www.reddit.com/r/PokemonInfiniteFusion/comments/1d2qgsp/problems_with_opening_the_game/", "I finally decided to play the game via linux, got it to install, but when i try to open it i get an error      The erroe  What did I do wrong? EDIT: I followed the Linux guide to install it    "], ["Issue with wine", "4", "0", "2024-06-25T21:32:41.256000+0000", "https://www.reddit.com/r/SteamDeck/comments/1dohgqg/issue_with_wine/", "I'm trying to run Minecraft on the deck. After a lot of fenangling I now have it in Lutris on wine, and have the .exe file in executable. But when I play it, it closes itself and says played less than a minute, no error message or anything to help me know what's wrong. Can anyone help here? Also, it's the Minecraft installer, to be clear.    "], ["Question regarding Mac install issue with Wine", "9", "3", "2024-02-10T04:39:31.286000+0000", "https://www.reddit.com/r/aurora/comments/1an8355/question_regarding_mac_install_issue_with_wine/", "Hello, I am trying to get Aurora running on a Mac using Crossover which is the paid Wine app. So far it is far easier than the latest instructions I could find which are not for C# and are 6+ years old. I just install the full version (Aurora1130Full), specify the .exe in crossover and then tell it which bottle I would like to run it in (Windows10 32-bit). The game opens immediately but I immediately noticed that the buttons at the top of the screen and in the menus are all white and impossible to read. See screenshot.       Screenshot  Does anyone know of a fix for this? Am I using the wrong wine bottle?    "], ["Issue with wine d3d shader", "0", "1", "2024-01-11T11:40:18.071000+0000", "https://www.reddit.com/r/linuxquestions/comments/193zqdy/issue_with_wine_d3d_shader/", "Recently, everytime I tried to install windows game, wine will start to spam log output 0324: fixme: might be use 0(27): warning C7050: \"vs_out[9]\" might be use to the point it freeze my laptop. Is there anyway i can fix it?    "], ["Issue with Wine (new user)", "1", "3", "2023-11-18T18:32:22.879000+0000", "https://www.reddit.com/r/winehq/comments/17ycqpy/issue_with_wine_new_user/", "I keep trying to use Wine but it always comes up with \"64-bit only\" I am using macOS High Sierra with Intel Core 2 Duo. I haven't found anything online and you guys seem very proficient. Thanks a lot!    "], ["Could someone else confirm this issue with WINE", "13", "0", "2023-10-26T06:29:37.358000+0000", "https://www.reddit.com/r/linux_gaming/comments/17gq64s/could_someone_else_confirm_this_issue_with_wine/", "I have reported a bug in WineHQ Bugzill specific to KDE Plasma Desktop, and that was more than 3 years ago, and one of the developers asks me if this issue still exists, and I do not use KDE Plasma Desktop anymore, so could anyone else confirms this issue? Thanks in advance. https://bugs.winehq.org/show_bug.cgi?id=48550     "], ["Issue with Anvil Studio in Wine not being able to output audio", "0", "0", "2024-02-25T04:53:07.270000+0000", "https://www.reddit.com/r/linuxaudio/comments/1azfh2b/issue_with_anvil_studio_in_wine_not_being_able_to/", "I'm on Mint 21.2 Cinnamon using Wine 6.0.3. I installed Anvil Studio using Wine, and it almost completely works. It does what I need it to do, except for the fact that I can't hear any audio. Attempting to play a midi yields this message: The MIDI Out port \"PipeWire-System - input\" cannot play MIDI tracks (Instrument/Rhythm). It might be in use by another application - try again after quitting other programs.  You could select the View/Synthesizers menu and select a different MIDI Out Port. The closest I got to fixing it was by installing QJackCtl. After staring it and switching Anvil to using that output, it stopped throwing errors, but I still couldn't hear the audio...    "], ["Using Scrivener with Wine almost works, except for an issue with dotnet 4.6.2", "0", "1", "2024-03-29T18:33:38.664000+0000", "https://www.reddit.com/r/linuxquestions/comments/1bqwkh6/using_scrivener_with_wine_almost_works_except_for/", "I am attempting to install Scrivener on a new installation of Linux Mint 21.3. I used Wine 9 to do this, and after getting some extra items like Winetricks I can get the program to start up fine. However, when attempting to register Scrivener using my information, the registration fails. This fail comes with a popup saying that dotnet 4.6.2 is not installed. This is true, but that is because I have dotnet 4.8 installed and for whatever reason Scrivener is unable to see that I have any dotnet installation as a result. I attempted to force an install of 4.6.2 just to see if that would work, but dotnet would not allow me to install 4.6.2 because it recognized that a more recent version of dotnet was installed. I wasn't able to find anyone who had this issue and posted a solution online, and I was directed here instead. Is there any fix that will remove this issue, and cause Scrivener to recognize that I have dotnet installed?    "], ["So I want to run Starcraft in linux, but got a massive issue with Battle.net (Wine).", "1", "1", "2024-01-26T05:16:18.562000+0000", "https://www.reddit.com/r/linux4noobs/comments/1abaoxq/so_i_want_to_run_starcraft_in_linux_but_got_a/", "So hence the title I got a massive issue with Battle.net! Look at Neofetch for more info about stuff like my hardware if you want I guess. (I also tried with Proton from steam and still didn't work) I want to get some help from this about wine.      Running Battle.net under wine 8.0.1     "], ["Why do people take issue with Childfree Disney-loving adults??", "299", "910", "2023-10-09T20:52:36.500000+0000", "https://www.reddit.com/r/childfree/comments/1742pdr/why_do_people_take_issue_with_childfree/", "Genuine curiosity on this one. Some parents get super gatekeeper-y about Disney. More than once, I've seen that screencap from a breeder that was HOT AND PISSED over an adult without children at Disneyland in front of them in line because that childfree adult got the last treat that the breeder's child wanted. Sadly, that infamous screencap isn't hyperbole. People really do be like out there. And it is WEIRD.  If they didn't like Disney, it would make more sense to have a bug up their arse about people who DO like Disney. But that isn't the case. They love Disney â\u0080\u0094 and think that ONLY THEY have the rights to enjoy Disney as an adult because they have kids. Because their mindset is: â\u0080\u009cDisney is JUST FOR KIDS! â\u0080\u009d Yeah, okay, it is made with kids in mind, trueâ\u0080¦â\u0080¦ but then why do these parents get to like it and flaunt being a Disney fan? They're not kids, EITHER. Technically, by their rules, they're not even allowed to like Disney or Disneyland and other theme parks becauseâ\u0080¦â\u0080¦.. they're adults. I dunno. You just cannot make this make sense. The only lesson to learn from parents who get pissed off at childfree fans of Disney: Those parents are quite unhappy at heart, need therapy, and don't even realize it.    "], ["Fable III: Issue with music & dialog?", "0", "2", "2024-05-05T04:21:29.129000+0000", "https://www.reddit.com/r/linux_gaming/comments/1ckiynn/fable_iii_issue_with_music_dialog/", "Hello, everyone! I managed to make the game work with the help of Lutris and Proton GE 9.4, I don't have the games for windows issue, the game runs smoothly at 60fps and it looks beautiful, but for some reason the characters don't have dialog audio whatsoever, is there a solution for this....? (The game audio works fine, even the intro video has full audio, music and dialogue, but the game itself doesn't have any dialogue or music, I also tried all the audio settings in-game) I have tried using multiple iterations of Wine & Proton (System 9.0 Wine, Wine GE 8, Proton 7, Proton 9, Proton Experimental, Proton GE 8.3, Proton GE 9.4), and have used it with compatibility for Windows 7 & Windows 10, and the result is the exact same. I use Linux Mint Cinnamon 21.3 and have a Gigabyte Radeon RX 5700 with the Mesa drivers. Here's the log file of the last run i made: https://pastebin.com/ddnBwmvh  Please, LMK... Thanks!    "], ["Issue with Anno 1602 History Edition", "4", "1", "2024-02-23T22:35:22.693000+0000", "https://www.reddit.com/r/linux_gaming/comments/1aydxft/issue_with_anno_1602_history_edition/", "Hi guys! I've been a Linux gamer for past few years and I've been using Linux daily for almost 10 years. Still, this is the first time I'm completely out of ideas and maybe somebody here could help me.  Issue:   https://imgur.com/a/2Xdc7q9   https://imgur.com/a/ocLTuDa  Everything is pink when opening up options menu in the Anno 1602 history edition. This is with Ubisoft Connect running through Wine-GE (installed through heroic). Options are completely pink when entering through main menu and from gameplay. Everything else works great but I want to scale the UI just a bit. https://imgur.com/a/gkf0BPZ   What I tried:    Proton 5 -> 8   Proton Experimental   GE-Proton   Wine-GE   Plain system Wine 9   Switching between RADV and amdvlk   Enabling and using GalliumNine inside Wine   Trying to play on another computer (Laptop is RDNA3, PC is 6800XT with RDNA2)   PROTON_USE_WINED3D=1   Nothing helped. Options menu is always pink and doesn't respond to input (so I can't even changing anything by guessing where the options are). I guess I could ask my friend to test on his laptop with intel SoC. EDIT For posterity, I fixed this by adding d3dcompiler_47.dll through winetricks.    "], ["Issues with installing Wine 9", "4", "2", "2024-06-19T08:11:54.874000+0000", "https://www.reddit.com/r/tuxedocomputers/comments/1djdx25/issues_with_installing_wine_9/", "Sorry, I wanted to create a comment but I guess I couldn't post it because it was too large. But basically: I'm having issues installing the latest version of Wine using the guide on their website. And I think it could be related to an outdated Tuxedo mirror? Maybe? Not sure. In order to try and fix any dependency issues, I've added the following apt repos: sudo add-apt-repository ppa:sane-project/sane-release\nsudo add-apt-repository ppa:ubuntu-desktop/ppa Apart from that, I've followed the official install guide (for Ubuntu 22.04):  https://wiki.winehq.org/Ubuntu  Using this guide, I've enabled 32 bit with the command:  sudo dpkg --add-architecture i386sudo dpkg --add-architecture i386  But when following this guide, I now get the following error (sorry it's German): â\u009e\u009e Â sudo apt install --install-recommends winehq-stable Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â \n[sudo] Passwort fÃ¼r bruno: Â \nPaketlisten werden gelesenâ\u0080¦ Fertig\nAbhÃ¤ngigkeitsbaum wird aufgebautâ\u0080¦ Fertig\nStatusinformationen werden eingelesenâ\u0080¦ Fertig\nEinige Pakete konnten nicht installiert werden. Das kann bedeuten, dass\nSie eine unmÃ¶gliche Situation angefordert haben oder, wenn Sie die\nUnstable-Distribution verwenden, dass einige erforderliche Pakete noch\nnicht erstellt wurden oder Incoming noch nicht verlassen haben.\nDie folgenden Informationen helfen Ihnen vielleicht, die Situation zu lÃ¶sen:\n\nDie folgenden Pakete haben unerfÃ¼llte AbhÃ¤ngigkeiten:\nwinehq-stable : HÃ¤ngt ab von: wine-stable (= 9.0.0.0~jammy-1)\nE: Probleme kÃ¶nnen nicht korrigiert werden, Sie haben zurÃ¼ckgehaltene defekte Pakete. When trying to install wine-stable, I get: â\u009e\u009e Â sudo apt install --install-recommends wine-stable \n\n[...]\n\nDie folgenden Pakete haben unerfÃ¼llte AbhÃ¤ngigkeiten:\nlibsane1:i386 : HÃ¤ngt ab von: libpoppler-glib8:i386 (>= 0.85.0) ist aber nicht installierbar\nE: Probleme kÃ¶nnen nicht korrigiert werden, Sie haben zurÃ¼ckgehaltene defekte Pakete. And then I get into this circle conflict that wine-stable depends both on libpoppler-glib8:i386 and also libpoppler-glib8 but they both will uninstall each other. I can not install them both at the same time. â\u009e\u009e Â sudo apt install libpoppler-glib8:i386 libpoppler-glib8 Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â \nPaketlisten werden gelesenâ\u0080¦ Fertig\nAbhÃ¤ngigkeitsbaum wird aufgebautâ\u0080¦ Fertig\nStatusinformationen werden eingelesenâ\u0080¦ Fertig\nlibpoppler-glib8 ist schon die neueste Version (24.02.0-0xneon+22.04+jammy+release+build30).\nlibpoppler-glib8 wurde als manuell installiert festgelegt.\nEinige Pakete konnten nicht installiert werden. Das kann bedeuten, dass\nSie eine unmÃ¶gliche Situation angefordert haben oder, wenn Sie die\nUnstable-Distribution verwenden, dass einige erforderliche Pakete noch\nnicht erstellt wurden oder Incoming noch nicht verlassen haben.\nDie folgenden Informationen helfen Ihnen vielleicht, die Situation zu lÃ¶sen:\n\nDie folgenden Pakete haben unerfÃ¼llte AbhÃ¤ngigkeiten:\nlibpoppler-glib8 : BeschÃ¤digt: libpoppler-glib8:i386 (!= 24.02.0-0xneon+22.04+jammy+release+build30) aber 22.02.0-2ubuntu0.4 soll installiert werden\nlibpoppler-glib8:i386 : BeschÃ¤digt: libpoppler-glib8 (!= 22.02.0-2ubuntu0.4) aber 24.02.0-0xneon+22.04+jammy+release+build30 soll installiert werden\nE: Probleme kÃ¶nnen nicht korrigiert werden, Sie haben zurÃ¼ckgehaltene defekte Pakete. Inspecting these two dependencies and where they come from, I get two different sources with two different versions. And I guess this is what causes the issues. And this is about where my Linux knowledge ends. :) â\u009e\u009e Â sudo apt policy libpoppler-glib8:i386 libpoppler-glib8 Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â \nlibpoppler-glib8:i386:\nÂ Installiert: Â Â Â Â Â Â Â Â Â Â (keine)\nÂ Installationskandidat: 22.02.0-2ubuntu0.4\nÂ Versionstabelle:\nÂ Â Â Â 22.02.0-2ubuntu0.4 500\nÂ Â Â Â Â Â Â 500 https://mirrors.tuxedocomputers.com/ubuntu/mirror/archive.ubuntu.com/ubuntu jammy-updates/main i386 Packages\nÂ Â Â Â 22.02.0-2ubuntu0.3 500\nÂ Â Â Â Â Â Â 500 https://mirrors.tuxedocomputers.com/ubuntu/mirror/security.ubuntu.com/ubuntu jammy-security/main i386 Packages\nÂ Â Â Â 22.02.0-2 500\nÂ Â Â Â Â Â Â 500 https://mirrors.tuxedocomputers.com/ubuntu/mirror/archive.ubuntu.com/ubuntu jammy/main i386 Packages\nlibpoppler-glib8:\nÂ Installiert: Â Â Â Â Â Â Â Â Â Â 24.02.0-0xneon+22.04+jammy+release+build30\nÂ Installationskandidat: 24.02.0-0xneon+22.04+jammy+release+build30\nÂ Versionstabelle:\n*** 24.02.0-0xneon+22.04+jammy+release+build30 500\nÂ Â Â Â Â Â Â 500 https://plasma6.tuxedocomputers.com jammy/main amd64 Packages\nÂ Â Â Â Â Â Â 100 /var/lib/dpkg/status\nÂ Â Â Â 24.01.0-0xneon+22.04+jammy+release+build27 500\nÂ Â Â Â Â Â Â 500 https://plasma6.tuxedocomputers.com jammy/main amd64 Packages\nÂ Â Â Â 23.10.0-0xneon+22.04+jammy+release+build24 500\nÂ Â Â Â Â Â Â 500 https://plasma6.tuxedocomputers.com jammy/main amd64 Packages\nÂ Â Â Â 23.09.0-0xneon+22.04+jammy+release+build22 500\nÂ Â Â Â Â Â Â 500 https://plasma6.tuxedocomputers.com jammy/main amd64 Packages\nÂ Â Â Â 23.04.0-0xneon+22.04+jammy+release+build15 500\nÂ Â Â Â Â Â Â 500 https://txos.tuxedocomputers.com/ubuntu jammy/main amd64 Packages\nÂ Â Â Â 22.02.0-2ubuntu0.4 500\nÂ Â Â Â Â Â Â 500 https://mirrors.tuxedocomputers.com/ubuntu/mirror/archive.ubuntu.com/ubuntu jammy-updates/main amd64 Packages\nÂ Â Â Â 22.02.0-2ubuntu0.3 500\nÂ Â Â Â Â Â Â 500 https://mirrors.tuxedocomputers.com/ubuntu/mirror/security.ubuntu.com/ubuntu jammy-security/main amd64 Packages\nÂ Â Â Â 22.02.0-2 500\nÂ Â Â Â Â Â Â 500 https://mirrors.tuxedocomputers.com/ubuntu/mirror/archive.ubuntu.com/ubuntu jammy/main amd64 Packages    "], ["Wine issues with joystick", "6", "1", "2024-05-09T09:43:53.924000+0000", "https://www.reddit.com/r/batocera/comments/1cnt9yz/wine_issues_with_joystick/", "I'm using a windows pc for batocera on an arcade machine with dragon rise usb encoders. On ver 38 I was using proton and it eliminated and issue that caused my joystick input to stick in one direction. On ver 39 wine options have changed and I'm not sure what I'm doing on how to go back to proton or to eliminate the input error ( whatever it is ) for reference it's pinball fx3 but if I remember correctly it did it on most windows games  installed unless on proton. Any help would be much appreciated â\u009d¤ï¸\u008f    "], [" WINE issues with the standalone launcher ", "24", "0", "2024-02-28T05:25:24.243000+0000", "https://www.reddit.com/r/sto/comments/1b1y5vb/wine_issues_with_the_standalone_launcher/", "Help me STO community. I can't seem to get the STO launcher to properly run on Linux. Yes I've heard the \"use Windows or Steam\" bullshit. Well I DON'T LIKE WINDOWS AND STEAM SUCKS. Please do not suggest either changing my OS or using Steam. Anyways, for the past year I have been unable to login due to issues with WINE and STO's launchers. Steam works just fine but I have a seperate account there. I am greeted with a black window with the cursor changing over links. It could be an OpenGL issue perhaps? Either way I could probably login with a screenshot of the standalone. If it is necessary my OS is Gentoo Linux and I run it on a Hewlett-Packard 15t-dy100. I have 12GB of DDR4 RAM  of unknown frequency and configuration. She also specs a 10th gen i7 mobile processor. Anyone who uses WINE and has STO working, please share your workarounds or point me to someone who can help. WINE's own forums were unable to help and so were Gentoo's (surprisingly). I may find the same issues here, but it's worth a shot.    "], ["Network issues with wine on nixos", "4", "1", "2024-06-01T09:34:22.823000+0000", "https://www.reddit.com/r/NixOS/comments/1d5jaan/network_issues_with_wine_on_nixos/", "Hi there Since the new nvidia drivers released I am now finally able to play games on linux more comfortably. Unfortunately, I came across a new issue. I experience that in some games (running with wine or proton) the network connection partially works. What I mean by that is that for example the multiplayer works totally fine but the game is not able to make certain API calls. The games I currently have issues with is Guild Wars 2 and Star Citizen. Guild Wars 2: The multiplayer and everything works just fine but the \"black lion trading post\" menu doesn't work since I believe it communicates with a different API. I get the error \"Err:Aborted\" or sometimes \"Err:Network changed\" Star Citizen: I cannot get a connection to the authentication servers while login in in the launcher. The reason why I am posting this here is that I tried both games with Arch and they work just fine. So this seems to be a problem with my nixos config. What I already tried:   Different proton versions   Disabling firewall   Did anybody else experience such issues? Thanks for your help.    "], ["Joypad Issues with WINE.", "3", "5", "2024-04-09T17:45:14.506000+0000", "https://www.reddit.com/r/batocera/comments/1bzyamv/joypad_issues_with_wine/", "Hello, Currently I am having issues with WINE and batocera v39. My controllers are stuck moving right, most inputs are bound wrong or multiple times over, and no other inputs are being passed through, and I'm not sure how to reconfigure these binds or set batocera recognizing it as a proper xinput/dinput controller. I'm using EG Starts joysticks/buttons and it has a usb encoder going into the laptop i'm using. All other games work fine with the configured retropad buttons, its just windows i'm having many issues with. My WINE games are installed using the .pc folder method, but I have little/no knowledge on how to use wine or winetricks. What can I install to make these controllers actually recognized?    "], ["Issues with PromptPlus Library and Wine ", "0", "2", "2024-06-11T22:25:51.773000+0000", "https://www.reddit.com/r/wine_gaming/comments/1ddr0r7/issues_with_promptplus_library_and_wine/", "I've been trying to get a mod for Elden Ring working, however the custom launcher exe was compiled using the \"prompt plus\" library which seems to be unable to run through wine on MacOS. It seems to work for people using proton on Linux, which is odd considering how close the two are, but I know there are differences and this is clearly one of them. I've tried just about every dot net winetrick, as the library was developed using dot net in C#. No dice. Anyone have any suggestions or experience getting this to work?    "], ["Issues with WineAudio", "2", "1", "2024-02-24T20:14:56.928000+0000", "https://www.reddit.com/r/linuxaudio/comments/1az44ge/issues_with_wineaudio/", "Every time I try to build wineasio, I keep getting this error. Also, is there any other way to get an interface to work with FL Studio via Wine? Please let me know. I'm using Wine version 9 and wineasio1.2.0 and Ubuntu 22.0.4.4 LTS Error dialogue: make build ARCH=i386 M=32 make[1]: Entering directory '/home/user/Desktop/wineasio' gcc -c -I. -Irtaudio/include -I/usr/include/wine -I/usr/include/wine/windows -I/usr/include/wine-development -I/usr/include/wine-development/wine/windows -I/opt/wine-stable/include -I/opt/wine-stable/include/wine/windows -I/opt/wine-staging/include -I/opt/wine-staging/include/wine/windows  -m32 -D_REENTRANT -fPIC -Wall -pipe -fno-strict-aliasing -Wdeclaration-after-statement -Wwrite-strings -Wpointer-arith -Werror=implicit-function-declaration  -O2 -DNDEBUG -fvisibility=hidden -o build32/asio.c.o asio.c make[1]: gcc: No such file or directory make[1]: *** [ Makefile.mk:102 : build32/asio.c.o] Error 127 make[1]: Leaving directory '/home/user/Desktop/wineasio' make: *** [Makefile:17: 32] Error 2     "], ["Nice Value and Issues with scheduler on wine", "3", "1", "2024-02-07T14:17:06.800000+0000", "https://www.reddit.com/r/linux_gaming/comments/1al3xip/nice_value_and_issues_with_scheduler_on_wine/", "I have a problem with proton on lutris. DOOM (2016) doesn't run well because of scheduler issues. System sets niceness of some of it's processes to 19 and this makes it unplayable, if I change it manually to for e.g. -5 game runs smoothly with high fps, however it is changed automatically to positive value after a while. I tried gamemode renice, changing limits, nothing works. I only see: wine: Using setpriority to control niceness in the [-19,19] range in the logs, but I cannot find any documentation on how can I  change it to cap it automatically to for e.g.  [-10, 0]. Now I try to find this in source code, and if this doesn't help, I might considering changing my scheduler all-together, but maybe someone have better idea? I my config is arch on zen 6.6.7 kernel, with intel raptor-lake CPU with P-cores and E-cores    "], ["Sound issues with \"Mega Pony\" on Wine (GameMaker?)", "1", "3", "2024-01-06T08:56:03.989000+0000", "https://www.reddit.com/r/wine_gaming/comments/18zvtxk/sound_issues_with_mega_pony_on_wine_gamemaker/", "Hi! I'm trying to play \"Mega Pony\" (1.1) on SteamOS (Steam Deck) via Proton/Wine (as it is a Windows .exe file). I come from a Windows background, so forgive me if I seem to miss anything obvious, or misuse terms. For what it's worth, I believe \"Mega Pony\" was created in the original GameMaker (not Studio), but I'm unable to confirm this. The game is a completely free fan-work that released in 2013, and can be downloaded from the description of its Launch Trailer on YouTube. I have tried using Protontricks (WineTricks) to tinker with some settings, unfortunately to no avail. Things I've tried (in order):    Proton Experimental - plays audio sometimes. Some songs are here, some are missing.    Proton 7.0-6 - launches with an error popup: \"No sound device detected. Sounds might not play.\". It then proceeds to play audio for half a second, before crashing.    Protontricks/Winetricks - installed directmusic and dsound , opened winecfg , changed dsound from \"native\" to \"builtin\"; nothing changes. If I change \"sound=pulse\" to \"sound=alsa\", the game hangs on the splashscreen.    Proton-7.1-GE-2 - the \"No sound device detected.\" error mentioned above happens again.    Proton 8.0-4 - both sound and music can be heard, but it is very unstable. The menu music will stop once a sound is played, and switching between selections causes the game to momentarily freeze. Songs don't seem to play properly and sounds are inconsistent. It's unplayable.   Each time a sound is played, it is followed by a brief blip of static.     Using Proton 3.16-9 (or Proton 8.0-4 , I believe), then installing directmusic and dsound with NO other settings changed, makes most (not all) sounds work, but with a noticeable delay, which isn't ideal. I've read online that switching from pulse audio to pipewire can fix latency issues, but I'm not too keen on tinkering with something so essential in fear of ruining all audio playback on my device; especially if it may not even work. If someone more experienced in the specifics of pipewire could vouch for its likeliness to work, alongside what exactly it is, I'd be willing to try it. Judging by my research, it seems that another game called Gang Garrison 2  may have similar problems ; perhaps that helps narrow the scope of the issue a little? I've also spent hours searching for solutions online, but unfortunately, I've hit a dead-end. It seems a few others have tried running this title through Wine , but none of them seem to have overcome these issues. There's also an install script for this game on PlayOnLinux , but I am unfamiliar with it, and ultimately unsure if it will have fully-functioning audio . From my testing, it just crashes after a second sound is played. Any suggestions, general help or solution(s) are greatly appreciated! TL;DR -(Presumed) Original GameMaker game struggling to play audio properly through Wine on Linux. Tried installing directsound, dmusic, using alsa, nothing works.    "], ["Issues with Applying Patch to Wine (wine6-7) for Elder Scrolls Online", "3", "1", "2024-03-03T23:27:30.447000+0000", "https://www.reddit.com/r/winehq/comments/1b5vknz/issues_with_applying_patch_to_wine_wine67_for/", "Hello,  I'm currently facing difficulties while attempting to apply a patch to a  Wine source tree (wine6-7). I'm not familiar with the patching process  and thought this would be a more suitable place to seek help than the  WineHQ forums. I've tried using the command ./patchinstall.py DESTDIR=\"../wine-6.7\" 0002-wined3d-Use-bindless-textures-for-GLSL-shaders.patch and also patch -p1 -i ../0002-wined3d-Use-bindless-textures-for-GLSL-shaders.patch within the wine6.7 source directory. Unfortunately, neither of them  worked. I've read the help output from both commands, but it's still  unclear to me what I need to do. I apologize if this question seems trivial, but could you assist me  or direct me to resources that might be helpful? When I attempt to apply  the patches with the patch command, I encounter some  errors. And with the patchinstall i could not make the program apply the specified path not even using the argument --all . For your information, I'm using the patch mentioned in the WineHQ  bugs, specifically for the issue where â\u0080\u009c Elder Scrolls Online (Dragon  Bones update) requires more than 32 samplers in pixel shaders with D3D11  renderer â\u0080\u009d. Any assistance would be greatly appreciated.    "], ["Trying to run GameJolt games through Wine/Proton, having issues with game displaying (i.e. black screen)", "0", "1", "2024-05-14T21:16:41.679000+0000", "https://www.reddit.com/r/linux_gaming/comments/1cs3g51/trying_to_run_gamejolt_games_through_wineproton/", "Currently having some issues running games through wine on Linux on ChromeOS.  On Wine 8.0 (can't update to 9.0 unsure how to), was able to run 1 out of 4 attempted games but three others displayed a Black screen.  Thought it was just a Wine issue, so I tried Steam for Linux and adding through â\u0080\u009cAdd non steam gameâ\u0080\u009d and got a unique file explorer that doesn't let me access any of my Linux files and i can't figure out how to copy files to this file explorer.  Any advice on how to either fix the Wine display issues or to add non steam games?    "], ["Trouble With Wine", "6", "2", "2024-06-22T03:47:36.862000+0000", "https://www.reddit.com/r/linuxquestions/comments/1dlmp3b/trouble_with_wine/", "I'm trying to install run Opera GX under wine, but i get this error: 0520:fixme:thread:NtSetInformationThread ThreadPowerThrottling stub!\n0530:fixme:actctx:parse_depend_manifests Could not find dependent assembly L\"109.0.5097.142\" (109.0.5097.142)\n\n0530:err:module:import_dll Library opera_elf.dll (which is needed by L\"C:\\\\Program Files\\\\Opera GX\\\\opera.exe\") not found\n\n0530:err:module:loader_init Importing dlls for L\"C:\\\\Program Files\\\\Opera GX\\\\opera.exe\" failed, status c0000135\n\n0520:fixme:thread:NtSetInformationThread ThreadPowerThrottling stub!\n0530:fixme:actctx:parse_depend_manifests Could not find dependent assembly L\"109.0.5097.142\" (109.0.5097.142)\n\n0530:err:module:import_dll Library opera_elf.dll (which is needed by L\"C:\\\\Program Files\\\\Opera GX\\\\opera.exe\") not found\n\n0530:err:module:loader_init Importing dlls for L\"C:\\\\Program Files\\\\Opera GX\\\\opera.exe\" failed, status c0000135\n\n0504:fixme:kernelbase:AppPolicyGetProcessTerminationMethod FFFFFFFFFFFFFFFA, 00007FFFFE1FFE80    "], ["Trouble with wine", "6", "4", "2023-10-31T21:27:36.229000+0000", "https://www.reddit.com/r/Sims4/comments/17kvvvz/trouble_with_wine/", "I need to have some sort of a mixology table in my apartment but it doesn't really fit well. Is there a way to drink wine from dine out without going to another lot and order it? My sims live a very luxurious lifestyle and the wine is just so fitting and I can't install mods because I play on Xbox.    "], ["Figured Out My Favorite White Wine, Still Having Trouble With Red", "16", "4", "2023-08-06T23:26:45.719000+0000", "https://www.reddit.com/r/wine/comments/15k3zq6/figured_out_my_favorite_white_wine_still_having/", "So I like wine, but I'm more of a Scotch/Irish whiskey drinker. I was able to figure out what white wine fit me best, because oaky Chardonnay has some characteristics reminiscent of whiskey. I'm having trouble finding a similar shortcut with red wine, does anyone have any suggestions?    "], ["trouble with installing visual novel with Wine on mac os", "6", "2", "2023-10-04T12:36:46.559000+0000", "https://www.reddit.com/r/visualnovels/comments/16zm3p0/trouble_with_installing_visual_novel_with_wine_on/", "When I try to install the exe file on mac os visual novel, there are just empty square instead of characters and I cannot install it, how can I change wine locale to japanese?    "], ["Need help with Installing VCrun2019 (Having trouble with WineTricks / Lutris)", "9", "1", "2023-10-25T09:36:08.936000+0000", "https://www.reddit.com/r/SteamDeck/comments/17g0xnb/need_help_with_installing_vcrun2019_having/", "Whenever I try installing VCRun2019, I keep getting errors which abort the installation. I'm told something about files not matching, I can't remember what ones though, I think it was a checksum failure. I cannot use Protontricks since the method I am using to do what I want requires Lutris and that is what I have used up to this point. I'm desperate for a step-by-step walkthrough on this from the perspective of a Linux noob. Thank you. Edit: It's a problem with a \"SHA256 mismatch\" if anyone knows what that is    "], ["Having Trouble with Pokemon This Gym Of Mine and The Wine stuff for linux", "8", "0", "2023-07-23T13:28:24.037000+0000", "https://www.reddit.com/r/linux4noobs/comments/157evuz/having_trouble_with_pokemon_this_gym_of_mine_and/", "Whenever I click \"open with Wine windows program loader\" it keeps coming up with errors, big noob here so would rlly appreciate help    "], ["Trouble with Battle.net installation", "1", "3", "2024-04-15T21:52:30.045000+0000", "https://www.reddit.com/r/wine_gaming/comments/1c4yrbr/trouble_with_battlenet_installation/", "System: Pop OS 22.04 LTS, jammy Nvidia GeForce GTX 1660 Ti Driver version 550.67 Wine Versions in Runner Options: (choices) GE-Proton (Latest), System (9.0)(default) Enable DXVK: on, version 2.1 Enable VKD3D: on, version 2.8 Enable D3D extras: on, v2 (default) Enable DXVK-NVAPI/DLSS: on, version 0.7.0 (default) Enable dgvoodoo2: off ~/.local/share/lutris/runners/wine$ ls lutris-ge-7-34-x86_64 wine-ge-8-26-x86_64 wine-ge-7-34-x86_64 wine-ge-lol-8-27-x86_64  Problem Description: Installed battle.net using lutris/wine in 2020. Worked more or less fine until dragonflight release/prepatch time. Then only classic worked. After several months of trying fixes, dragonflight would finally work (I changed runners-don't remember from/to which) but at the cost of having to manually delete a specific battlenet version before trying, and then having it take between 5-200 tries to successfully open battle.net, many of those attempts, but not all, have me entering my password. Most do not have the â\u0080\u009cloginâ\u0080\u009d button visible, but simply the spinning logo as it tries to connect. This had been my normal gaming reality since then. On Friday, after about 2 hours of trying to login unsuccessfully, I finally got frustrated enough to uninstall lutris, wine, and everything blizzard and start fresh. However, when I reinstalled lutris, it remembered everything from the previous installation, but with every blizzard file deleted from my laptop I now cannot install the battle.net at all.   Attempts to Solve: I've tried to install from https://lutris.net/games/battlenet/ , but it tells me I need a specific runner version (lutris-GE-Proton7-34-x86_64). I opened protonup-qt and installed it in ~/.local/share/lutris/runners/wine/ , but lutris will not detect that version. I saw suggestions of using steam for it, so I installed that, then tried to find battle.net there, but its not present, and I could not manually add it because I can't install it from the blizzard download either. Not sure what the next thing to try is, and I'm open to any help offered. I would prefer not to use steam but if that's the only way, so be it.   I posted a few hours ago on linux_gaming, but perhaps that wasn't the right place?    "], ["Having trouble with Steam Games on Secondary Drive", "3", "1", "2024-06-09T23:32:32.491000+0000", "https://www.reddit.com/r/linux4noobs/comments/1dc7ipc/having_trouble_with_steam_games_on_secondary_drive/", "I just did a fresh install of Linux Mint, and unlike Windows, I can't get Steam to launch any of the games not installed on the main drive. I've installed Protontricks  (flatpack and system), winetricks, and wine. I've told Flatseal for accessing to my secondary drive, I even got it to automount. Even in Protontricks it can see the Steam Library I've installed in drive 2. But the main issue is protontricks can't allegedly access the drive (now formatted to ext4. This is so much simpler on SteamOS, but on regular desktop not a chance. B550 with 1tb nvme + 4TB 2.5 SSD. 1650 Super.    "], ["Anyone having trouble with chesscom premove time count?", "1", "0", "2024-05-09T17:17:41.924000+0000", "https://www.reddit.com/r/chess/comments/1co2jup/anyone_having_trouble_with_chesscom_premove_time/", "I have no troubles with my internet connection. I play on iPhone's chesscom app. I know that it counts 0.1 sec for a premove. Tens of times I have over 0.5 sec remaining and I premove a wining move, or a one that will flag my opponent, yet I lose by timeout! Anyone else facing a similar issue?    "], ["Trouble with installing EA App via Lutris", "2", "2", "2023-12-29T17:06:30.745000+0000", "https://www.reddit.com/r/linux_gaming/comments/18trw2p/trouble_with_installing_ea_app_via_lutris/", "Hi, I'm a beginner Linux (Manjaro) user and I'm having trouble setting up the EA App launcher. I installed the latest version of Wine (8.21) and updated winetricks. I updated my system and (with the help of ChatGPT) installed some 32-bit libraries with this command: sudo pacman -S lib32-mesa lib32-vulkan-icd-loader lib32-libldap lib32-libgpg-error lib32-libxml2 However whenever I try to install the EA App launcher, I always get this error:Runtime error('No path can be generated for D3D Extras because no version information is available.'). I have the same problem with downloading Epic Games Launcher or Ubisoft Connect. Thanks in advance! [SOLVED] I managed to solve the issue. I uninstalled Lutris via the terminal, reinstalled Wine and then installed lutris again but via Pamac GUI instead of via the terminal. I guess installing with the terminal command skipped some crucial dependency or something.     "], ["Struggling With Cheat Engine, Wine, and SteamTinkerLaunch...", "4", "1", "2024-03-20T02:49:38.149000+0000", "https://www.reddit.com/r/SteamDeck/comments/1bj39ix/struggling_with_cheat_engine_wine_and/", "I'm trying to get Cheat Engine running on my deck. More specifically I am trying to use it on the game 'Biomutant'. I've followed the steps provided by a post from 2 years ago, linked here:  https://www.reddit.com/r/SteamDeck/comments/wklnqx/a_guide_to_set_up_trainerscheats_through_steam/  The problem is that I'm stuck from moving on from step 15, and it's due to what I believe is the one major issue; When installing, Wine decided to make the file that opens Cheat Engine a link file rather than a .EXE. I'm assuming SteamTinkerLaunch doesn't like that, as Cheat Engine will not open when I press 'save and play'. I don't know how to uninstall Cheat Engine to try to get Wine to do it correctly either. Is there a way I can get Cheat Engine working like this? Another thing that would be appreciated if someone can help with it is how I can get a cheat table inserted into Wine's virtual drive. I don't know how to get access to it so I can put the cheat table in for Cheat Engine to read.    "], ["I'm [40M] struggling with how to get past my wife's [40F] behavior on a trip.", "757", "1001", "2023-10-03T05:02:55.895000+0000", "https://www.reddit.com/r/relationship_advice/comments/16yj3am/im_40m_struggling_with_how_to_get_past_my_wifes/", "My wife and I are on vacation in Italy. We've been in the country for about a week and are here for another week. A couple days ago we did a wine tour in Tuscany which was one of the things my wife was most looking forward to. She over-indulged. 5 tastings at the first vineyard we went to, and 6-8 glasses (I didn't keep an exact count) at lunch. She told me a couple times that she was pretty drunk. My wife also gets a bit carsick. She'd had a little trouble on our earlier trip to Pompeii with the bumpy winding roads. I recommended she take Dramamine but she drank enough that she forgot. She threw up in the tour bus twice on the way back to our hotel. The driver politely told us that we weren't welcome any more and suggested we call a cab. We waited at a rest stop for about an hour and she said she was fine, so I called a cab to take us back. She threw up in the cab too. It ended up costing me about 300 Euros altogether in hefty tips and cleaning fees. Our hotel is in a restricted traffic zone so we had to walk a couple hundred meters. By that point she was covered in vomit and I had a good bit on me as well. I was pretty pissed and disgusted with my wife so I was walking a bit away from her. Frankly I didn't really want to be seen with her. She could tell I was angry and asked what was wrong when we got back to the hotel room. I wasn't kind. I told her that her behavior was disgraceful, that she embarrassed both of us, and reminded her that she was a 40 year old mother of two, not a 19 year old sorority girl and she needed to fucking act like it. She started making excuses, she told me she didn't think she had that much to drink, that she thought she had food poisoning and didn't feel good. I showered and went to the pharmacy to get her some anti-nausea drugs, made sure that she wasn't going to choke on her own vomit or anything, and left. I didn't want to be around her any more. I had dinner and walked around the city some to cool off, and when I got back she was asleep. The next morning when we woke up she laid into me for not supporting her more and for being so mean to her when she had food poisoning. I didn't directly call her a liar, but I didn't apologize either. So now we're a day later and it's seriously affecting our trip. I'm pissed because she got sloppy drunk and humiliated us. She's pissed because I don't buy her \"food poisoning\" story. I'm not sure how we move past this. She seems to want to sweep it under the rug and for me to apologize. I think she's the one who needs to apologize. What do we do here? Edit:  Y'all love reading way too much into things.  My wife isn't an alcoholic, she just got way too excited about Tuscan wine and drank too much of it.  I didn't go into a blind rage or verbally abuse her, I was irritated and made a couple shitty comments in anger.  I didn't abandon her on the streets to die choking on her own vomit in a gutter, I walked 5 steps ahead of her for a couple blocks.  And we're okay now.  She apologized profusely this afternoon.  She admitted she fucked up and drank way too much.  There was no food poisoning involved, though some carsickness probably was.  She apologized for costing us a bunch of money and making a scene.  She told me she didn't want to admit it yesterday morning because she was embarrassed and still hungover and feeling bad.  I apologized for my shitty comments.  She thanked me for taking care of everything.  We moved on and will enjoy the rest of our vacation.    "], ["Struggling with alcohol since perimenopause ", "72", "86", "2024-06-28T05:17:28.392000+0000", "https://www.reddit.com/r/Menopause/comments/1dqby46/struggling_with_alcohol_since_perimenopause/", "It's embarrassing. I'm already on medication for bipolar disorder and ADHD, I'd like to ask my doctor about HRT but I know it isn't going to make any difference unless I quit drinking. I'm up to a bottle of wine every night. I know I should find a meeting, and I will, hopefully sooner than later. This isn't who I am. I feel like menopause has taken my life from me.  Edit: I wasn't expecting this post to have such a positive impact on my confidence. Still reading through everything, but I'm so grateful for your encouragement and advice. Thank you so very much for taking the time to help me out. ð\u009f\u0092\u009eð\u009f\u0092\u009eð\u009f\u0092\u009e    "], ["Struggling with how small of a number â\u0080\u009c1 lbâ\u0080\u009d seems over two weeks", "61", "181", "2024-05-07T18:06:37.155000+0000", "https://www.reddit.com/r/loseit/comments/1cmid90/struggling_with_how_small_of_a_number_1_lb_seems/", "I can't figure out how to do flare so: SW: 155, CW: 154, GW: 120 30F, 5'4 I have about 35 pounds to lose and I'm hoping to be at my goal weight before my wedding next August (2025). I've been trying to lose weight for years but decided to get really honest with myself two weeks ago and really take my health seriously. I've successfully done all of the following for two straight weeks:   stuck to 1200 cals/day   exercise 3x per week (burning 200-300 cals each time)   cut out all alcohol (previously drinking around 1 bottle of wine or 4-5 white claws per night)   Intermittent fasting (22:2)   And with all that, I've only lost 1 lb. I do feel better but clothes are not fitting any differently. I don't know, it just seems like I've made a LOT of changes for just 1 lb. I'm trying really hard not to quit, but that's just a little demoralizing. Does it tend to be slower in the beginning? How do you keep going?    "], ["Struggling with %s etc", "29", "4", "2024-02-13T19:50:39.454000+0000", "https://www.reddit.com/r/learnpython/comments/1aq2okz/struggling_with_s_etc/", "thought cake ruthless scary dazzling wine squeal capable bells sophisticated  This post was mass deleted and anonymized with Redact     "], ["NVIDIA Setup for people struggling with Wayland on Arch Linux and other gaming related issues.", "29", "40", "2024-06-04T13:54:43.600000+0000", "https://www.reddit.com/r/archlinux/comments/1d7xqvm/nvidia_setup_for_people_struggling_with_wayland/", "A cheat sheet for NVIDIA Drivers Setup with Wayland on Arch Linux, using NATIVE Arch Linux repository packages, with grub as a bootloader.   Help sound does not work!:   sudo pacman -S alsa-firmware alsa-utils pipewire pipewire-alsa pipewire-pulse pavucontrol   Enable 32-bit support   sudo nano /etc/pacman.conf   Uncomment these lines:   [multilib] Include = /etc/pacman.d/mirrorlist   Update:   sudo pacman -Syu   Help games and Wayland don't work on my 4090 RTX NVIDIA GPU as they did on Windows!   Install NVIDIA Driver with dependencies including Vulkan properly:   sudo pacman -S nvidia nvidia-settings nvidia-utils lib32-nvidia-utils lib32-opencl-nvidia opencl-nvidia libvdpau lib32-libvdpau libxnvctrl vulkan-icd-loader lib32-vulkan-icd-loader vkd3d lib32-vkd3d opencl-headers opencl-clhpp vulkan-validation-layers lib32-vulkan-validation-layers   sudo mkinitpcio -P   Wayland support will work fine if you have NVIDIA RTX 20/30/40 series cards, Wayland support might work poorly on GTX 10 series cards,so if that happens stick to X11:   Edit /etc/mkinitcpio.conf   sudo nano /etc/mkinitcpio.conf  Change MODULES=() To MODULES=(nvidia nvidia_modeset nvidia_uvm nvidia_drm)  sudo mkinitcpio -P   Edit GRUB /etc/default/grub   For other bootloaders check the Arch Wiki  https://wiki.archlinux.org/title/NVIDIA#Early_loading   sudo nano /etc/default/grub  Change GRUB_CMDLINE_LINUX_DEFAULT=\"loglevel=3 quiet\" To GRUB_CMDLINE_LINUX_DEFAULT=\"loglevel=3 quiet nvidia_drm.modeset=1\"  sudo grub-mkconfig -o /boot/grub/grub.cfg   Reboot, check if everything works:   sudo cat /sys/module/nvidia_drm/parameters/modeset   On every NVIDIA driver update run:   sudo mkinitcpio -P   Extra Steps with GNOME/GDM   Removing the gdm udev that disables Wayland   If you want to force-enable Wayland, run this command **.**  sudo ln -s /dev/null /etc/udev/rules.d/61-gdm.rules  Reboot  Help my games keep crashing with 128GB RAM   Set  vm.max_map_count to Steam OS values:   sudo nano /usr/lib/sysctl.d/10-arch.conf  Change vm.max_map_count=2147483642  reboot and check if the count increased:  cat /proc/sys/vm/max_map_count  Here are a bunch of codecs/dependencies that can help you run different types of media audio and video formats that applies to games as well. NB! If you want a non-bloated Arch Linux install then avoid:   sudo pacman -S fluidsynth lib32-fluidsynth openal lib32-openal gvfs gvfs-nfs libkate gst-plugins-base gst-plugins-bad-libs gst-libav lib32-gst-plugins-good gst-plugin-gtk lib32-gstreamer lib32-gst-plugins-base lib32-gst-plugins-base-libs xvidcore lib32-libxvmc libxvmc ffmpeg gst-libav gst-plugins-good gst-plugins-bad smpeg faac sndio libnma openresolv x264 x265 opus sane lame libao wavpack libmad a52dec libvorbis faad2 libmpeg2 libtheora libvpx libde265 libdv schroedinger dav1d rav1e gst-libav gst-plugins-base gst-plugins-good gst-plugins-bad gst-plugins-ugly gst-plugin-pipewire lib32-pipewire pipewire-zeroconf flac lib32-flac smpeg lib32-smpeg mac opus lib32-opus opus-tools opusfile libmpeg2   gamemode, gamescope install you can use these for improving gaming under steam/lutris/wine:   sudo pacman -S gamemode lib32-gamemode gamescope   Proper Wine\\Steam\\Lutris\\dosbox\\scummvm Install:   sudo pacman -S wine wine-gecko wine-mono steam lutris dosbox scummvm   yay installation for heroic games launcher and other stuff from AUR:   yay needs git:  sudo pacman -S git  No sudo!  git clone \n\ncd yay\n\nmakepkg -sihttps://aur.archlinux.org/yay.git  Heroic games launcher   yay -S heroic-games-launcher-bin   Custom GE Proton usage:   Download the GE Proton needed releases here:   https://github.com/GloriousEggroll/proton-ge-custom/releases  Extract, enable hidden files and folders in your file manager Create a folder compatibilitytools.d in your /home/user/steam/root/  Copy/paste the extracted GE folder into:  /home/user/config/.steam/root/compatibilitytools.d  Restart Steam, now you can use any GE Proton version.  Some games work better on Wayland in some cases for native Linux games like Metro Exodus and older Win 32bit games work better on X11, so you need to switch between Wayland and X11.  EDIT: Added this tutorial to Arch Wiki under, suggestions/edits are welcome there:  https://wiki.archlinux.org/title/User:SilentGamePLS#NVIDIA_Gaming_and_Wayland_Cheat_Sheet:  Have fun!    "], ["I'm struggling with GCN", "103", "11", "2024-03-13T20:59:22.957000+0000", "https://www.reddit.com/r/TheGlassCannonPodcast/comments/1be2my6/im_struggling_with_gcn/", "I started listening to GCP and A&A back when they first started and really loved the dynamic and content. The live shows were some of my favorite memories. I've hung on for a long time, but I'm struggling now. And I hope I'm not doing the \"it's changed so I don't like it\" thing, but there are some aspects of current GCN that deter me from committing as hard to them as I used to. I loved the addition of Sydney and the detour shows during COVID. But the new GCP seems disorganized and...cluttered? Like too many cooks in the kitchen. I'm struggling to get into and engaged with the show and characters. And I can't connect to the cast as much as I used to. Also, GCN as a whole seems pretty cluttered. There is a lot being released and too many new people to keep track of. It feels like I just don't want to try anymore. I am so happy for them that they are doing well and gaining new members of the Naish, but I just feel so sad. I'm mourning what GCN used to be. I'm also struggling to understand why people like Kate so much. My only real exposure to her is from New Game Who Dis and the new GCP. She doesn't role play much, is pretty flat affect, and doesn't add much to the shows. Am I crazy? Is there something I should listen to in order to appreciate her more? (Please don't come for me, I just really don't understand).    "], ["Anybody else struggling with this?", "15", "6", "2024-04-30T18:59:36.083000+0000", "https://www.reddit.com/r/ACL/comments/1ch0q2b/anybody_else_struggling_with_this/", "Since I've been stuck at home I've been so bored and have definitely been drinking more. I never considered myself an alcoholic but now I've been at least taking a shot or some wine on a daily basis even if I don't get super drunk. I think it's the boredom of being home and in one spot all day. Advice? Anybody felt this way?    "], ["Struggling with NYE", "36", "11", "2023-12-31T11:10:54.202000+0000", "https://www.reddit.com/r/polyamory/comments/18v5ode/struggling_with_nye/", "Anyone else who's not spending NYE with their partner and struggling? My partner is alternating who he's spending holidays with, which means I'm not seeing him tonight. For me, there's just something really special about starting the new year with the person I love the most. He's my only relationship (I do occasionally date, but mostly casual so far) and I really want to spend the night with him. I'm trying to break my negative coping mechanisms. My usual way of dealing with this would be sulking by myself with a lot of wine. I'm going to meet some friends tonight and will try to have a good time, but I'm struggling with trying to put on my \"happy\" face. People who are dealing with the same issue: how are you coping with it?    "], ["Born-Again Christian here struggling with alcohol", "18", "12", "2024-05-28T01:14:03.930000+0000", "https://www.reddit.com/r/Christian/comments/1d27ix0/bornagain_christian_here_struggling_with_alcohol/", "So, I should preface this by explaining... About 3 years ago I started taking red wine to help mitigate menstrual cramps (I had tried so many other things before this). It DOES help. In fact, I have little to no cramps at all with it. The problem is: I slowly started abusing it. I am ashamed to admit this, but it's just the solid truth. I didn't want to admit this to anyone at first because I didn't want to have to stop using it for my time of the month. To make a long story short, it has gotten out of control; to the point that I can't go one day without 8-16oz (sometimes 20oz) of 80proof Vodka. My question is: does anyone here know of any Christian-style AA groups? I have heard of Celebrate Recovery (Which I am willing to try); I'm just wondering if there are any others as well. Thanks, in advance.    "], ["Spontaneously Fermented Strawberry Country Wine - Help Needed", "12", "0", "2024-06-02T16:44:00.024000+0000", "https://www.reddit.com/r/winemaking/comments/1d6hgid/spontaneously_fermented_strawberry_country_wine/", "Hi everyone! I want to preface by saying I know most of you do things a lot more elaborately than this but I am hoping someone might have some knowledge they can impart. This is my first wine besides a small amount of apricot/peach wine I made a week ago (using champagne yeast) for the purpose of fermenting it further into vinegar. The Problem: Funky smell 1 week in. Not like anything I have smelled before; not like rotten fruit, but almost chemical? Research points towards stressed yeast. Recipe   1 gal vessel   3lbs strawberries, frozen from fresh   2 cups sugar   Water   On day one I added 3lbs frozen strawberries to 1gal mason jar along with 2 cups sugar, and left it to thaw overnight. The next day, I topped with water, took the SP.GR, secured it with an airlock, and stored it in the pantry. I've been stirring it 3-4 times daily. Notes: May 25 - Strawberries left to thaw with sugar overnight. May 26 - Water added. SP.GR read taken @ 1.06. Topped with airlock and left to ferment in pantry. May 30 - SP.GR. read taken @ 1.045 May 31 - Flavor less sweet. Very strong strawberry, though it does not taste like wine. June 1st - Smells strange. Maybe sulfury - supposedly the cause of stressed yeast. Youtuber suggested it requires more oxygen; replaced airlock with filter. June 2nd - Sulfur smell still there. SP.GR read taken @ 1.03. I watched a youtube video that suggested stressed yeast could be due to not enough oxygen so I replaced the airlock with a coffee filter yesterday, and began stirring more frequently. Today it still smells so I wanted to look more into it. Some people say the smell will clear up on its own. Others say add copper. Others say add nutrients. I've also read that banana/raisins/more fruit/nutritional yeast/boiled bakers yeast all work as nutrients, and that there's about a 10 day window to add them. As I am approaching the end of this window, I am leaning towards adding 1tsp of bakers yeast boiled in 1/2 cup of water and cooled. Do you think this will help? I am aware that spontaneously/wild fermented wine is suboptimal because of all the variables involved in using wild yeast. I am looking at this as a bit of an experiment. I am A-OK not having a high ABV, I went into this hoping for maybe 5%. Honestly, I just really love fermenting things - from vegetables to kombucha to sourdough, and now, alcohol. Ultimately, I am just hoping for something drinkable. Also, the plan was to bottle and store in the fridge, so shelf stability is not important. In the future I do hope to dabble in a more by-the-book approach. Any insight would be greatly appreciated :)                    "], ["Help Needed: Italian Road Trip for Wine, History, and Food! ", "6", "1", "2024-06-10T17:32:31.874000+0000", "https://www.reddit.com/r/ItalyTravel/comments/1dcrax7/help_needed_italian_road_trip_for_wine_history/", "Hello fellow Redditors! My fiancÃ© and I are planning a two-week road trip to Italy in July. We'll be flying in and out of Bologna and aim to explore the central and northern regions of Italy. We're looking for recommendations on places with great wine country, charming towns, rich history, delicious food, and vibrant cultural scenes. Your advice and opinions would be greatly appreciated!    "], ["Help Needed:Wine Pairing with dinner", "2", "2", "2023-09-26T10:19:57.263000+0000", "https://www.reddit.com/r/winepairings/comments/16sjv3o/help_neededwine_pairing_with_dinner/", "Hi there,I am trying to figure out a wine for a date night that will include oven roasted pork belly. The main dish is pork belly with a mandarin orange salsa served on homemade bao buns with a baked Brie with homemade strawberry jalapeÃ±o jam with homemade bread with some sliced pork belly as well  . My price range is between $25-50 since I have never been an avid wine drinker but I feel like something might pair very well with this meal. Thanks in advance for your suggestions!    "], ["Help needed with Cool WineBar in Miami Beach", "8", "3", "2023-07-18T13:08:03.818000+0000", "https://www.reddit.com/r/smallbusiness/comments/152y1bg/help_needed_with_cool_winebar_in_miami_beach/", "Hi all!! I have opened a WineBar in Miami Beach in Sep/Oct last year, and even if worked the first month well with mouth to mouth and walkings (is 50 ft away from collins in Mid Beach) right now that is low season I'm struggling. I do have a IG and FB account, (Facebook is new after reading a lot of subs here) and 900+ followers on IG. All current customers love the place, but is very difficult to make a good Marketing strategy because in this moment we are struggling and every cent is going out from my pocket, I have invested a lot on the place. And I can't survive this low season with so low attendance. The place is very beautiful, we have self-serving machines for wine an more than 150 different wines, very good food and excellent service, and for this city the prices are way cheap! I was doing events, but I can effectively communicate and get attendance to the events. What are your suggestions to make this place work? IG? FB? Targeted? Events, what kind? Live music (The space is small, 35 Seats)? Any suggestion to my social media or website? https://www.instagram.com/gotwineclub/ http://www.gotwineclub.com  Any suggestion or advise will we greatly appreciated!!! Since I'm thinking on sell or close, and since the place is so nice and got good feedback from customers that make me feel so bad, it's a nice project!     "], ["Longshot but help needed", "6", "5", "2024-05-16T15:05:33.605000+0000", "https://www.reddit.com/r/ParisTravelGuide/comments/1ctf3db/longshot_but_help_needed/", "My wife, then girlfriend, and I had an incredible meal in 2008 at a restaurant in Paris, and I would love to take her back for our anniversary. Small problem - I have no idea what the name of the restaurant was, where it was located, or whether it's even still open. It was small with a divided layout, and it seemed to be an old home. There was a wine cellar which was accessible from the \"living room\" section of the restaurant. There was limited seating - maybe 3 tables, all 2 tops - outside on the street. I remember walking by the Pantheon that night, but I don't recall where it was in relation to the restaurant. So a small place in an old home with a wine cellar and street seating possibly near the Pantheon. That narrows it down to what? Half the restaurants in the city?    "], ["Vino Nobile di Montepulciano - help needed!", "17", "2", "2023-09-09T22:33:16.721000+0000", "https://www.reddit.com/r/wine/comments/16eizec/vino_nobile_di_montepulciano_help_needed/", "So, I live far away from any store that sells good wine.  Everyone around here loves really sweet wine.Plenty of winemakers in the region but almost all very sweet wines.  Terrible stuff.  The odd time I get to get good wine, I have come to know what I like - Vino Nobile di Montepulciano, and I've always gotten the same brand.  Over the last several years I've had trouble finding my brand. The trouble is, I don't know what my brand is called.  It had a dark label, displaying a man with a very frilly white old-style collar.  I'm thinking maybe they changed the label. I took a stab at a rando Vino Nobile di Montepulciano, La Braccesca 2017.  Man, it's decent but it tastes watered down.  Not the big bold and rich flavors I'm used to.  This is a very watery wine.   Nice berry, a little bit of light tannins, but nothing as exciting as the original one.  I can't believe I never noted the brand.  Hoping someone here can help me, or at least suggest a better Vino Nobile di Montepulciano (or really, any other similar wines that are gonna blow me away).  Hoping to keep it around 50 or less.  Nevermind - I found it!  Hooray (took me a long time)!  It's Fattoria Del Cerro.  Does look like they changed the label.    Best wine I ever had! That said, still open to similar wine suggestions or other Montepulciano brands.    "], ["Help Needed: Restoring Deleted Repository Configuration Files (\"sources.list.d\" deleted accidentally)", "6", "2", "2023-11-29T00:28:05.326000+0000", "https://www.reddit.com/r/debian/comments/186bp9k/help_needed_restoring_deleted_repository/", "Unfortunately, I managed to delete some crucial repository configuration files in my /etc/apt/sources.list.d directory while trying to fix this issue. youssefadly237@youssefadly:~$ sudo apt update\nHit:1 http://packages.microsoft.com/repos/code stable InRelease\nIgn:2 http://dl.winehq.org/wine-builds/ubuntu victoria InRelease                                                                                                                    \nHit:3 http://archive.ubuntu.com/ubuntu jammy InRelease                                                                                                                              \nHit:4 https://dl.google.com/linux/chrome/deb stable InRelease                                                                                                                       \nIgn:5 http://download.opensuse.org/repositories/Emulators:/Wine:/Debian/Debian_10 ./ InRelease                                                                \nHit:6 http://security.ubuntu.com/ubuntu jammy-security InRelease                                                                                              \nErr:7 http://dl.winehq.org/wine-builds/ubuntu victoria Release                                                                          \n  404  Not Found [IP: 199.232.58.217 80]\nIgn:8 https://dl.winehq.org/wine-builds/debian jammy InRelease                                                  \nIgn:9 http://packages.linuxmint.com victoria InRelease                                    \nErr:10 http://download.opensuse.org/repositories/Emulators:/Wine:/Debian/Debian_10 ./ Release\n  404  Not Found [IP: 195.135.223.226 80]\nHit:11 https://dl.winehq.org/wine-builds/ubuntu jammy InRelease                           \nHit:12 http://packages.linuxmint.com victoria Release               \nErr:13 https://dl.winehq.org/wine-builds/debian jammy Release\n  404  Not Found [IP: 199.232.58.217 443]\nHit:14 http://archive.ubuntu.com/ubuntu jammy-updates InRelease\nHit:16 http://archive.ubuntu.com/ubuntu jammy-backports InRelease\nReading package lists... Done\nE: The repository 'http://dl.winehq.org/wine-builds/ubuntu victoria Release' does not have a Release file.\nN: Updating from such a repository can't be done securely, and is therefore disabled by default.\nN: See apt-secure(8) manpage for repository creation and user configuration details.\nE: The repository 'http://download.opensuse.org/repositories/Emulators:/Wine:/Debian/Debian_10 ./ Release' does not have a Release file.\nN: Updating from such a repository can't be done securely, and is therefore disabled by default.\nN: See apt-secure(8) manpage for repository creation and user configuration details.\nE: The repository 'https://dl.winehq.org/wine-builds/debian jammy Release' does not have a Release file.\nN: Updating from such a repository can't be done securely, and is therefore disabled by default.\nN: See apt-secure(8) manpage for repository creation and user configuration details. the deleted files map â\u0094\u009câ\u0094\u0080â\u0094\u0080 sources.list.d\nâ\u0094\u0082   â\u0094\u009câ\u0094\u0080â\u0094\u0080 additional-repositories.list\nâ\u0094\u0082   â\u0094\u009câ\u0094\u0080â\u0094\u0080 google-chrome.list\nâ\u0094\u0082   â\u0094\u009câ\u0094\u0080â\u0094\u0080 official-package-repositories.list\nâ\u0094\u0082   â\u0094\u009câ\u0094\u0080â\u0094\u0080 vscode.list\nâ\u0094\u0082   â\u0094\u009câ\u0094\u0080â\u0094\u0080 winehq-jammy.sources\nâ\u0094\u0082   â\u0094\u0094â\u0094\u0080â\u0094\u0080 wine-obs.list My system youssefadly237@youssefadly:~$ inxi -Sr\nSystem:\n  Host: youssefadly Kernel: 5.15.0-89-generic x86_64 bits: 64\n    Desktop: Cinnamon 5.8.4 Distro: Linux Mint 21.2 Victoria\nRepos:\n  No active apt repos in: /etc/apt/sources.list Any guidance on recreating or restoring these files correctly would be immensely appreciated. Thank you so much for your assistance!    "], ["Sawdust Spawn Bag to Bag Transfers Help Needed", "0", "1", "2024-03-31T23:57:33.351000+0000", "https://www.reddit.com/r/mycology/comments/1bsp1ar/sawdust_spawn_bag_to_bag_transfers_help_needed/", "I got a bunch of sawdust spawn in the mail and was wondering if anyone had experience doing bag to bag transfers and could share a recipe? I have a BUNCH of bags of supplemented sawdust spawn using my recipe at the end. I wasn't sure if they would work or if for some reason they need to be less 'nutritious'? I made a huge wine cap bed last year in early summer, watered it reliousky, and had a bumper crop in the fall. I plan on inoculating logs of shiitake and nameko in my yard and doing the whole pressure cook, inoculate and bag technique for the chicken of the woods before partially planting in the ground. I plan on doing gardens of wine caps (more at home and for customers), almond agaricus, and blewits (different substrate makeup of course for the last two than for the wine caps). I out the bags that arrived in my fridge except for them Agaricus since it says not to refrigerate. Hopefully it doesn't start fruiting before we are past the freezing mark here? Or, for the sawdust spawn, do I need to just use hydrated wood chips with no calcium or wheat or bran? Also, what percentage of your sawdust spawn needs to be colonized sawdust spawn? With my gourmets, I have noticed that they are pretty vigorous colonizers. I am not 100% sure but what'a stopping those blocks from fruiting? Is it the lack of nutrition add ons like wheat bran and gypsum? I'm pretty solid at agar work and growing Mass supplemented mushrooms from grain spawn. The whole wood spawn thing is new to me except for wine caps. I have 30 bags of fresh supplemented wood chip spawn that l'll use for my gourmets if I have to but if I can use them for bag to bag transfers, it will save me a lot of work making unsupplemented bags. If someone has experience with this and can advice (along with how much to add to my four pound blocks, I would be grateful. My recipe that worked well for my gourmets blocks I out my colonized grain in for farmer's market: 20 lb Recipe 6.6 lbs Vermiculite 3 Ibs wheat bran 10.4 lbs oak pellets 2/3 cup Calcium Hydroxide 1/3 cup Gypsum 1/4 cup Calcium Phosphate 1 squirt Dr Myc's MGP+ *water 1.5 to 1.7 times dry weight or until field capacity is reached.    "], ["Personal chef biz - help needed ", "19", "1", "2024-06-11T11:31:16.251000+0000", "https://www.reddit.com/r/Chefit/comments/1ddbv5f/personal_chef_biz_help_needed/", "Hi everyone: I find myself retired from the restaurant industry after ~15 years but needing to find income possibilities that are flexible with my full-time schooling. I had the idea to open a personal chef service but I need some advice. My first concern is initial investment. Will I need to plan to bring plates and dishes and so on? Marketing materials, photos, website etc â\u0080\u0094 did you start before having these things or did you develop your concept/brand before â\u0080\u009claunchingâ\u0080\u009d? I'm planning to offer something along these lines: 4-12pax, between 3-8 courses (designed by me), possibility to do wine or cocktail service down the road, in the client's home. I will hire a helper to help me out on the day of the dinner but will use the 1-2 days prior to the event to shop and prep items for the event so I can focus on plating while my helper serves f&b and cleans. My second concern is how to get the message out. I was thinking of just going to fancy places and networking with potential clients (plus I will be able to make friends this way so bonus). Marketing is not my strong-suit but I'm also not looking for a ton of volume in bookings. What other aspects should I consider that you think I haven't yet considered? Thanks for all your advice chefs ð\u009f«¡    "], ["Need Help Installing Wine", "30", "2", "2024-06-01T15:19:28.200000+0000", "https://www.reddit.com/r/voidlinux/comments/1d5pb6d/need_help_installing_wine/", "So basically I've wanted to move from windows for a very long time and finally decided to move to Linux and while looking for a good distro. I found out about Void and really liked that it had rolling releases that were stable. I saw that a lot of people were saying that it wasn't good for complete beginners but I thought I'd try it out first and turns out they were right. While I do love the look and feel of the default Xfce installation, I've had a lot of problems like not being able connect to wifi. I also somehow messed up my windows dual boot so now when I open it, it just asks for my keyboard layout and then shows troubleshooting and booting from another drive. I still have all my files though. I was gonna switch to Debian Testing but something happened and the usb stick isn't working anymore. This happened in windows sometimes too and when this happens i used HDDGuru's low level format something program and it usually fixed the issue. I was gonna do this but found out that that program doesn't work on Linux. So,  I decided to run it with Wine but when I tried installing wine using xbps it just opened the mono thingy once and never worked. Winetricks doesn't work as well. Tried installing it through Flatpaks as well but it just says package not found for it and bottles even though I am connected to Flathub. Also heard that compiling Wine was easy but have no idea on how to do it and there aren't any vidos on YouTube that match what I heard on Reddit. Sooo, what did I mess up or forget to do? Also, is there any way to fix my windows install? UPDATE: Turns not Wine is working but the app that I was trying to open just doesn't work.    "], ["I need help with wine", "49", "0", "2024-01-08T11:23:41.177000+0000", "https://www.reddit.com/r/archlinux/comments/191j2q0/i_need_help_with_wine/", "So here is my dilemma, I installed arch about a thousand times at this point along with all my programs, in my previous install, I could install a particular game and play it along with another... however, now after a new clean install, neither game works, I checked the dll files and saw 1 of them at least is a 32-bit game file, I tried using a 32-bit and 64-bit version of wine, that game won't work and neither would my install, when I open the install, it keeps saying \"bad exe format for\" I have never had this problem on my linux, only on my roommate's, now I have no idea what to do anymore... for any suggestions, I tried everything on the entire first page of Google... so those solutions don't work... does anyone have any advice? Ps. Don't refer to Lutris, Heroic or playonlinux, tried all 3 for these 2 games already... need unconventional fixes hereð\u009f¤£ also using latest Arch... hence why here UPDATE: here are the error codes, starting with the 64-bit wine error Unhandled exception: page fault on read access to 0x90909090 in wow64 32-bit code (0x7beeaf9f). Register dump: CS:0023 SS:002b DS:002b ES:002b FS:0063 GS:006b EIP:7beeaf9f ESP:0281e1c0 EBP:04a0006e EFLAGS:00010206(  R- --  I   - -P- ) EAX:04a0004c EBX:00000000 ECX:0281e1d4 EDX:0281e1e0 ESI:04a0008a EDI:04a00086 Stack dump: 0x0281e1c0:  0086fa5d 0281e1d4 00000001 00000001 0x0281e1d0:  04a0004c 0000000c 0281e1e0 00000000 0x0281e1e0:  00040001 00000000 00000000 00000000 0x0281e1f0:  00000000 7bf08e10 00000000 008b91d2 0x0281e200:  04a00008 00000400 008b93ff 04a0004c 0x0281e210:  000000bc 7beee4dc 00000000 0281e690 Backtrace: =>0 0x7beeaf9f in kernel32 (+0xaf9f) (0x04a0006e) 1 0x45545f4d (0x41455453) 0x7beeaf9f kernel32+0xaf9f: jmp *0x90909090 Modules: Module  Address                 Debug info      Name (104 modules) PE        3b0000-  3d2000       Deferred        nxcharacter PE        3e0000-  3f1000       Deferred        physxloader PE        400000- 2713000       Deferred        hma PE       28e0000- 28fe000       Deferred        buddha PE      10000000-10049000       Deferred        binkw32 PE      3b400000-3b41f000       Deferred        steam_api PE-Wine 79a40000-79a77000       Deferred        uxtheme PE-Wine 79a80000-79ad7000       Deferred        winex11 PE      79ae0000-79ce7000       Deferred        d3dcompiler_43 PE      79cf0000-79d2f000       Deferred        d3dx11_43 PE-Wine 79d30000-79d46000       Deferred        bcrypt PE-Wine 79d50000-79e24000       Deferred        crypt32 PE-Wine 79e30000-79e3a000       Deferred        msimg32 PE-Wine 79e40000-79f09000       Deferred        msvcr100 PE-Wine 79f10000-79fe6000       Deferred        msvcp100 PE-Wine 79ff0000-7a0ff000       Deferred        oleaut32 PE-Wine 7a100000-7a10a000       Deferred        psapi PE-Wine 7a110000-7a11c000       Deferred        version PE-Wine 7a120000-7a13f000       Deferred        mpr PE-Wine 7a140000-7a1c5000       Deferred        wininet PE      7a1d0000-7a22d000       Deferred        steamclient PE-Wine 7a230000-7a246000       Deferred        shcore PE-Wine 7a250000-7a29a000       Deferred        shlwapi PE-Wine 7a2a0000-7a2b0000       Deferred        aclui PE-Wine 7a2b0000-7abf9000       Deferred        shell32 PE-Wine 7ac00000-7ac11000       Deferred        xinput9_1_0 PE-Wine 7ac20000-7ac8c000       Deferred        setupapi PE-Wine 7ac90000-7aca0000       Deferred        hid PE-Wine 7aca0000-7acbc000       Deferred        imm32 PE-Wine 7acc0000-7ae12000       Deferred        comctl32 PE-Wine 7ae20000-7ae62000       Deferred        dinput8 PE-Wine 7ae70000-7afa1000       Deferred        opengl32 PE-Wine 7afb0000-7b262000       Deferred        wined3d PE-Wine 7b270000-7b2a7000       Deferred        dxgi PE-Wine 7b2b0000-7b336000       Deferred        rpcrt4 PE-Wine 7b340000-7b38c000       Deferred        combase PE-Wine 7b390000-7b4a7000       Deferred        ole32 PE-Wine 7b4b0000-7b4e1000       Deferred        win32u PE-Wine 7b4f0000-7b577000       Deferred        gdi32 PE-Wine 7b580000-7b738000       Deferred        user32 PE-Wine 7b740000-7b761000       Deferred        msacm32 PE-Wine 7b770000-7b833000       Deferred        winmm PE-Wine 7b840000-7b868000       Deferred        ws2_32 PE-Wine 7b870000-7b87c000       Deferred        nsi PE-Wine 7b880000-7b895000       Deferred        dnsapi PE-Wine 7b8a0000-7b97c000       Deferred        ucrtbase PE-Wine 7b980000-7b9a7000       Deferred        sechost PE-Wine 7b9b0000-7ba5e000       Deferred        msvcrt PE-Wine 7ba60000-7baa2000       Deferred        advapi32 PE-Wine 7bab0000-7bad4000       Deferred        iphlpapi PE-Wine 7bae0000-7baef000       Deferred        wsock32 PE      7baf0000-7bc37000       Deferred        fmodex PE-Wine 7bc40000-7bedb000       Deferred        kernelbase PE-Wine 7bee0000-7bf44000       Export          kernel32 PE-Wine 7bf50000-7bfff000       Deferred        ntdll ELF     f667c000-f6833000       Deferred        libunistring.so.5 ELF     f6833000-f68c5000       Deferred        libgmp.so.10 ELF     f68c5000-f690f000       Deferred        libhogweed.so.6 ELF     f690f000-f6963000       Deferred        libnettle.so.8 ELF     f6963000-f6984000       Deferred        libidn2.so.0 ELF     f6984000-f6a51000       Deferred        libzstd.so.1 ELF     f6a51000-f6c00000       Deferred        libp11-kit.so.0 ELF     f6c00000-f6e3a000       Deferred        libgnutls.so.30 ELF     f6e4a000-f6e54000       Deferred        libffi.so.8 ELF     f6e54000-f6f02000       Deferred        libbrotlienc.so.1 ELF     f6f22000-f6f28000       Deferred        crypt32.so ELF     f6fa1000-f6fa9000       Deferred        libxfixes.so.3 ELF     f6fa9000-f6fb6000       Deferred        libxcursor.so.1 ELF     f70b6000-f70cb000       Deferred        libxi.so.6 ELF     f70cb000-f70d0000       Deferred        libxcomposite.so.1 ELF     f70d0000-f70e0000       Deferred        libxrandr.so.2 ELF     f70e0000-f70ee000       Deferred        libxrender.so.1 ELF     f70ee000-f70f6000       Deferred        libxxf86vm.so.1 ELF     f70f6000-f70fb000       Deferred        libxinerama.so.1 ELF     f70fb000-f7102000       Deferred        libxdmcp.so.6 ELF     f7102000-f712f000       Deferred        libxcb.so.1 ELF     f712f000-f7281000       Deferred        libx11.so.6 ELF     f7281000-f7297000       Deferred        libxext.so.6 ELF     f7299000-f72b1000       Deferred        libtasn1.so.6 ELF     f72b1000-f72bd000       Deferred        bcrypt.so ELF     f72bd000-f734b000       Deferred        winex11.so ELF     f734b000-f73ef000       Deferred        opengl32.so ELF     f74b3000-f74de000       Deferred        libexpat.so.1 ELF     f74de000-f7531000       Deferred        libfontconfig.so.1 ELF     f7531000-f75d2000       Deferred        libpcre2-8.so.0 ELF     f75d2000-f75f5000       Deferred        libbrotlicommon.so.1 ELF     f75f5000-f775b000       Deferred        libglib-2.0.so.0 ELF     f775b000-f776a000       Deferred        libbrotlidec.so.1 ELF     f776a000-f788b000       Deferred        libharfbuzz.so.0 ELF     f788b000-f78c8000       Deferred        libpng16.so.16 ELF     f78c8000-f78da000       Deferred        libbz2.so.1.0 ELF     f78da000-f79a8000       Deferred        libfreetype.so.6 ELF     f79a8000-f7b2c000       Deferred        win32u.so ELF     f7b2c000-f7c00000       Deferred        libm.so.6 ELF     f7c00000-f7e27000       Deferred        libc.so.6 ELF     f7e28000-f7e41000       Deferred        libz.so.1 ELF     f7e43000-f7e48000       Deferred        libxau.so.6 ELF     f7e67000-f7e90000       Deferred        libgcc_s.so.1 ELF     f7e98000-f7e9f000       Deferred        ws2_32.so ELF     f7e9f000-f7eb1000       Deferred        libresolv.so.2 ELF     f7eb1000-f7eb6000       Deferred        dnsapi.so ELF     f7eb6000-f7f89000       Export          ntdll.so ELF     f7f8b000-f7fc0000       Deferred        ld-linux.so.2 ELF     f7fc0000-f7fc5000       Deferred        <wine-loader> Threads: process  tid      prio    name (all IDs are in hex) 00000038 services.exe 0000003c    0 00000040    0     wine_rpcrt4_server 0000004c    0     wine_rpcrt4_io 00000074    0     wine_rpcrt4_io 0000009c    0     wine_rpcrt4_io 000000cc    0     wine_rpcrt4_io 000000e0    0 000000f8    0     wine_rpcrt4_io 00000044 winedevice.exe 00000048    0 00000054    0 00000058    0     wine_sechost_service 0000005c    0 00000060    0 00000064    0 00000068    0 000000d8    0 000000dc    0 0000006c winedevice.exe 00000070    0 00000078    0 0000007c    0     wine_sechost_service 00000080    0 00000084    0 00000088    0 000000a0    0 000000b0    0 000000c4    0 000000c8    0 0000008c plugplay.exe 00000090    0 000000a4    0 000000a8    0     wine_sechost_service 000000ac    0     wine_rpcrt4_server 000000b4    0     wine_rpcrt4_io 000000bc svchost.exe 000000c0    0 000000d0    0 000000d4    0     wine_sechost_service 000000f0 rpcss.exe 000000f4    0 00000100    0 00000104    0     wine_sechost_service 00000108    0     wine_rpcrt4_server 0000010c    0     wine_rpcrt4_server 00000114    0     wine_threadpool_worker 00000128    0     wine_rpcrt4_io 00000160    0     wine_rpcrt4_io 00000118 explorer.exe 0000011c    0 00000120    0 00000124    0     wine_rpcrt4_server 00000134 (D) Z:\\mnt\\games\\Games\\PCGames\\Hitman Absolution\\HMA.exe [\"Z:\\mnt\\games\\Games\\PCGames\\Hitman Absolution\\HMA.exe\" ] 00000138    0 <== 0000014c    0 00000144 conhost.exe 00000148    0 00000150 explorer.exe 00000154    0 00000158    0 0000015c    0     wine_rpcrt4_server System information: Wine build: wine-8.21 (Staging) Platform: x86_64 (guest: i386) Version: Windows 10 Host system: Linux Host version: 6.6.9-arch1-1 it REFUSES to run under 32-bit now, says it requires vista sp2 pack, so cant give that code, this is just for the game, all i get for the setup.exe is \"bad exe format for\" it stops at \"for\" it doesnt say \"for\" what UPDATE II: the setup.exe now says \"Invalid Handle\" when double clicked and keeps saying file not found when trying to use terminal and even used cd so I have no error codes; 002c:fixme:winediag:loader_init wine-staging 8.21 is a testing version containing experimental patches. 002c:fixme:winediag:loader_init Please mention your exact version when filing bug reports on winehq.org. 008c:fixme:wineusb:query_id Unhandled ID query type 0x5. 008c:fixme:wineusb:query_id Unhandled ID query type 0x5. 008c:fixme:wineusb:query_id Unhandled ID query type 0x5. 008c:fixme:wineusb:query_id Unhandled ID query type 0x5. 008c:fixme:wineusb:query_id Unhandled ID query type 0x5. 008c:fixme:wineusb:query_id Unhandled ID query type 0x5. 008c:fixme:wineusb:query_id Unhandled ID query type 0x5. 008c:fixme:wineusb:query_id Unhandled ID query type 0x5. 008c:fixme:wineusb:query_id Unhandled ID query type 0x5. 008c:fixme:wineusb:query_id Unhandled ID query type 0x5. 008c:fixme:wineusb:query_id Unhandled ID query type 0x5. 008c:fixme:wineusb:query_id Unhandled ID query type 0x5. 008c:fixme:hid:handle_IRP_MN_QUERY_ID Unhandled type 00000005 008c:fixme:hid:handle_IRP_MN_QUERY_ID Unhandled type 00000005 008c:fixme:hid:handle_IRP_MN_QUERY_ID Unhandled type 00000005 008c:fixme:hid:handle_IRP_MN_QUERY_ID Unhandled type 00000005 008c:fixme:hid:handle_IRP_MN_QUERY_ID Unhandled type 00000005 008c:fixme:xinput:pdo_pnp IRP_MN_QUERY_ID type 5, not implemented! 008c:fixme:xinput:pdo_pnp IRP_MN_QUERY_ID type 5, not implemented! 008c:fixme:xinput:pdo_pnp IRP_MN_QUERY_ID type 5, not implemented! 008c:fixme:xinput:pdo_pnp IRP_MN_QUERY_ID type 5, not implemented! Application could not be started, or no application associated with the specified file. ShellExecuteEx failed: File not found. UPDATE III: The installer itself is incompatible with arch as a whole, used a different installer and it worked, but my game still does not work and the error code applies still to that, that being the first error code    "], ["Trying to impress with a sweet wine. Need help desperately", "67", "17", "2024-03-16T02:49:27.062000+0000", "https://www.reddit.com/r/wine/comments/1bfvz8b/trying_to_impress_with_a_sweet_wine_need_help/", "So my gf has been on work leave for almost five weeks now and we talk everyday but I haven't gotten to see her. I'd like to pick her up from the airport and come home and sleep (I know she'll be tired) but wait until she wakes up with a really nice bottle of delicious sweet wine and a bubble bath and maybe some flowers hidden away the night prior...any suggestions. Price is anything under $200 so whatever the experts say I'll get. She currently drinks blueberry barefoot because she doesn't like spending money on herself but that's kinda bleh to me    "], ["need help finding the wine racks for the wine cellar", "3", "2", "2024-05-10T10:10:01.580000+0000", "https://www.reddit.com/r/simsfreeplay/comments/1com0vw/need_help_finding_the_wine_racks_for_the_wine/", "where can i find the wine racks/shelves for the wine cellar? i forgot which category it belongs to    "], ["Alsace wine tour- need help", "11", "2", "2024-06-21T02:23:04.160000+0000", "https://www.reddit.com/r/Strasbourg/comments/1dkt5oz/alsace_wine_tour_need_help/", "We will be staying in Strasbourg in August. I am about to buy a tour-guide led group wine tour but wondering if this is the best way to go about it or not. Is it advisable to go to wineries on our own? If we do that, would we have to call ahead to book or can we walk in? Any and all advice is appreciated!    "], ["Need help making wine", "13", "2", "2024-05-05T10:16:30.210000+0000", "https://www.reddit.com/r/wine/comments/1cko2ow/need_help_making_wine/", "In my country i dont have acceses to wine yeast well by that I mean there is no store or anywhere selling it just not a thing Ive tried making wine with wild yeast its been a week I guess it fermenting what can I do in order to ferment it like how can I make the wild yeast more powerful or are there any alternative yeast like convince store yeast does it work one that we use making bread I need help thank you    "], ["Need help with cheap homemade wine", "21", "0", "2024-05-09T05:44:26.688000+0000", "https://www.reddit.com/r/Homebrewing/comments/1cnpv7e/need_help_with_cheap_homemade_wine/", "Hey y'all, I'm making some homemade cheap wine using grape juice, bread yeast, sugar, and a balloon. First batch I left out fermenting for 2 weeks, put in fridge cause of odor like the taste of a bitter strawberry. Now it has a dark layer on top, and a cloudy red layer on bottom, anything I can do? I've made a new batch, 2 days old now, and today it had the same problems as the old one, it started spewing it's grape juice and bubbling through the balloon seal. It has the same odor from the stuff it spews, but the gas in the balloon smells just like it should. Am I doing anything wrong? If so, How could I fix it? Edit: Poked all the holes in the balloon prior to fitting, Just poked the bloated balloon and it released most the gases    "], ["wine drinkers, I need help with writing a song lyric", "118", "5", "2023-07-15T18:08:52.900000+0000", "https://www.reddit.com/r/wine/comments/150irvi/wine_drinkers_i_need_help_with_writing_a_song/", "\"Late night [insert favorite wine] and dreams of someone to hold.\"  Hopefully 3 syllables, no brands because copyright I'm sorry I don't drink that's why I don't have any idea    "], ["Need help finding a wine!", "4", "0", "2024-06-15T20:03:07.056000+0000", "https://www.reddit.com/r/wine/comments/1dgqazk/need_help_finding_a_wine/", "Me and my boyfriend cannot remember the name of this wine. It's a red wine, possible cab or blend. The bottle has an image of a grey sword or shield on it with possibly a grey brick  background, but not sure. I've tried Google searching it but to no avail. It must not be popular but it is really, really good. Publix carries it and I believe it's under $15. Anyone have any idea?    "], ["Need help with getting into expensive wine", "39", "0", "2023-11-23T18:05:57.676000+0000", "https://www.reddit.com/r/wine/comments/18275q3/need_help_with_getting_into_expensive_wine/", "I've been drinking wine for years and I finally just had it with drinking cheap wines. I typically shop at Total Wine and Costco, and I see lots of posts that advertise those places to purchase wine. I'm into all wines and I prefer red. My budget max is $85 bucks, I finally understand that better wine overall has a cost associated. I wanted to gather some suggestions of wine that anyone has experienced from either Total Wine or Costco for me to dive in and try. I appreciate you all in advance, and Happy Thanksgiving!    "], ["Coffee Help For Wine Bar", "78", "11", "2024-03-18T16:36:41.191000+0000", "https://www.reddit.com/r/wine/comments/1bhv5ia/coffee_help_for_wine_bar/", "I own a wine bar in a small but growing downtown. I want to offer coffee but I don't have a lot of spaceâ\u0080¦any suggestions? Should I just K-cup it?    "], ["help for clarifying wine", "5", "1", "2024-02-17T13:14:04.539000+0000", "https://www.reddit.com/r/Homebrewing/comments/1at1p7m/help_for_clarifying_wine/", "I've been trying to make my own wine for a few months now. I tried mead first, and it was a total failure, so I thought gaining experience in fruit wines before attempting to make mead would be more sensible. I have no idea what went wrong in my first attempt, but it seems I am doing something wrong in the process of clarifying the wine. I ended up with a cloudy and sweet wine when the fermentation was finished. Then, I added suspended silicon dioxide and an hour later, gelatin to clarify my mead. I waited more than a week, but there seemed to be no settlements. I tried cold-crushing, but still, no results. Since I ruined the batch, I started experimenting with the batch. I added dissolved gelatine in boiling hot water, warm water, cold water with undissolved gelatin in it, and I even poured the gelatine powder directly into the fermenter. After all this, there were absolutely no settlements still. I waited a few weeks, but nothing changed, so I dumped them into the sink and started all over with hard cider. The fermentation process is finished and I racked it twice until now. Although it seems relatively clear, I still taste yeast flavor, so I want a crystal-clear wine. I don't want to ruin this time. Do you guys have any advice for me or an explanation of why my first try was a complete failure? photo of cider: https://imgur.com/yqRDGx1     "], ["Help for storing wine", "7", "0", "2023-06-29T21:23:17.205000+0000", "https://www.reddit.com/r/wine/comments/14mgypt/help_for_storing_wine/", "Hi so recently I bought this Bordeaux red wine from France and I'm bringing it home to the Philippines. Since the climate's pretty warm, I was wondering where should I put it. I am planning to drink it 6-7 years after I pass the medical board exams. Currently I am thinking of placing it in a closet in the for a few weeks until my dry ager (which I got for my steaks) arrives. Long term storage might be in my dry ager. However, I do not know where to put it if I were to decide to dry age a steak. Because of air conditioning from the adjacent room, the closet can get around 20-24 degrees Celsius. How do you think I should store my wine?    "], ["Help for Blood and Wine", "0", "2", "2023-07-26T09:26:22.106000+0000", "https://www.reddit.com/r/witcher/comments/15a0ret/help_for_blood_and_wine/", "I really want to replay BnW but the giant scolopenders makes me feel disgust for how much they are terrible. Also I have a phobia in worms creature. So in Skyrim there is a mod for trasform the spiders into bears.Is there something similar for scolopenders?    "], ["Gifting help for someone who really hates gifting", "120", "181", "2024-03-24T20:51:13.069000+0000", "https://www.reddit.com/r/Gifts/comments/1bmv40p/gifting_help_for_someone_who_really_hates_gifting/", "Updated to add:  Wow, did not expect so many thoughtful responses! Too many for me to reply to individually, but many thanks to everyone.  Regarding plants:  I've never seen them keep any plants indoors (although one person is an avid outdoor gardener) and regarding wine: I've never seen them drink or serve wine.   I'm now leaning towards taking them out to dinner in their new neighborhood, and baking them something later once they're ready for visitors.  Also, I just impulsively (before I could second guess it!) ordered my favorite candy to be delivered, which I remember one of them enjoying when I brought it to an event; geez, maybe there's hope for me learning to give actual (consumable) gifts!  I really, really hate figuring out what to give people; I know this is weird, but the whole gifting practice feels annoyingly inefficient to me, especially where you're exchanging gifts - feels like two people spend energy figuring out what to give each other, and the result is that each person ends up with something less useful than if they'd just hugged each other and kept the money.   I'd be completely fine if I never received another gift (and for the most part, I don't get any).  My husband and I never gift each other anything, and my grown kids seem fine with my transferring money to them every birthday and Christmas.  When I receive a graduation announcement or wedding/shower invitation, I transfer funds or send a Visa gift card; and when I realize someone needs help, I really make an effort to give them time or money or food.  When we're invited to a party, I always bring something home baked (after checking first with the host).  I don't begrudge giving; I just can't stand the effort at picking stuff out. Now, my problem:  Some very old friends just moved from their house of 30+ years to a new place; these are the nicest folks you can imagine and so I'd like to give them a little something; I thought of my standard Visa gift card but my husband's reaction was \"It's fine but they'll probably think it's kind of silly as they're more affluent than we are\"; does that matter?  Heck, we aren't poor, just careful, retired folks, and $100 isn't a strain.  But is it silly to give more affluent people something which is essentially cash?   Does a gift only make sense in this situation if it's thoughtfully chosen?  Uggh, the idea of choosing a gift just makes my head hurt.    "], ["Job Help for Unemployed & Desperate? 60 Year Old", "143", "194", "2023-12-09T15:28:08.033000+0000", "https://www.reddit.com/r/remotework/comments/18efwgo/job_help_for_unemployed_desperate_60_year_old/", "I'm 60 and unemployed for a year after being let go from company downsizing. Struggling hard to find work and not due to a lack of effort. I'm out of money and with no prospects I'm trying every avenue I can to get a job. The time away allowed me to help a family member get into and go through rehab, but I desperately need to get back on my feet. I know I'm being looked over because of my age. I've done everything I can to hide it from my profile/resume (e.g. removing grad year) and have had more hits since then, but still can't get past the first video interview. Given my situation I'll be working for the next several years so there's no concern that I'll jump ship immediately to retire. I'm open to any and all work at this point. There are physical jobs I can't do though due to a few health issues. These issues only hinder me from jobs that are physical. If I didn't have this, I would be open to these jobs as well. I have several years' experience in each of:   Sales/Client Relationships   Customer Support/Service   Hospitality   Management/Training   Worked in different industries such as: Sales Recruiting/Consulting for Manufacturing Networks, Wine, Insurance, and Painting. I had to sell my car already to pay bills, otherwise I'd be driving for Uber which I've done before.  I'm in desperation mode so any help I can get to find work would be appreciated. Not reaching out for sympathy, but looking for any connections, resources, or direction for finding a job that fits me in the Denver Metro Area or Remote.  Short-term, I'll take anything I can that isn't physical. Long-term, I'm aiming for 40k+ to pay all my bills/rent. Below/Attached is my resume for reference. Thanks          "], ["hello, In need of some more experienced help for my trouble", "6", "6", "2024-02-27T10:18:46.659000+0000", "https://www.reddit.com/r/linux4noobs/comments/1b18jlm/hello_in_need_of_some_more_experienced_help_for/", "I recently migrated to Opensuse tumbleweed a few days ago and it's been a blast learning all that stuff so far. It's been a bit rough on the edges at the start but I think I'm getting there. I've been trying to make sure that my system was up to date by running the 'sudo zypper dup' command and I'm getting the following error message (if this can be even considered as an error message, bare with me here) :      My current hardware : Ryzen 7 7800x3d XFX RX 7900 XTX MSI B650 Gaming plus wifi WD Black SN850X 4 TB M.2 NVME G.Skill Flare X5 32 GB (2 x 16 GB) DDR5-6000 CL32 Memory I'm not touching anything  cause I pretty much have no idea of what I'm doing right now  Thank you in advance for your help    "], ["Need some help for a recommendation.", "13", "3", "2024-02-05T20:49:30.149000+0000", "https://www.reddit.com/r/wine/comments/1ajr5su/need_some_help_for_a_recommendation/", "So I'm in a bit of a pickle I'm based in the UK and am making a trip out to visit my French friends parents with him, however I feel a little bit under pressure when it comes to wines as I'm no way an expert so I thought who better to ask than the people on here. For reference it has to be available in England as they are collecting us from the airport. If anyone can provide me a recommendation or a wine that would be perfect this would be a big help, unfortunately my budget can't be more than Â£40 as I'm only 18 ATM    "], ["Help for a newbie, with a fresh install.", "8", "1", "2024-01-23T19:05:18.789000+0000", "https://www.reddit.com/r/linuxmint/comments/19dw2tj/help_for_a_newbie_with_a_fresh_install/", "Hi. I just installed Linux Mint on my PC (cinnamon EDGE, latest version). I have a 12400F and an RX 5700XT. Steam games arenÂ´t launching, despite me setting compatability mode to run on all games. I click the launch button, it tries, then it gives up. Also, I wanna set up WINE, so I can run Roblox, but I canÂ´t seem to get any GUI to launch from WINE. Any help's appreciated.    "], ["Help with \"wine\"", "4", "1", "2024-06-19T02:47:49.797000+0000", "https://www.reddit.com/r/prisonhooch/comments/1dj8r51/help_with_wine/", "So i just mashed up some grapes and skinned some (1:1 ratio of whole grape to grape skin), and ate the skinned leftover grapes and put it in a container with a little slit to let air escape. I fermented it for a week at room temp using the yeast from grape skins, without taking anything out and let it sit for 2 days in the fridge after It did become \"wine\" and it does taste good (i spit it out because im worried about safety), so im wondering about how to distil this \"wine\" without specialized equipment, and only regular kitchen equipment    "], ["Help with wine", "3", "1", "2024-05-21T01:58:50.939000+0000", "https://www.reddit.com/r/Cooking/comments/1cwwqgc/help_with_wine/", "I have leftover white wine. How long can I keep it in the fridge. Ppl say I can use it for cooking but how long will it keep b4 it truly goes bad. Thx    "], ["Help with wine-oâ\u0080\u0099clock", "11", "17", "2024-05-01T14:25:01.237000+0000", "https://www.reddit.com/r/stopdrinking/comments/1chnhbz/help_with_wineoclock/", "I've wanted to get back to sobrietyâ\u0080¦ I've done it before for some different periods of time But I'm really struggling to â\u0080\u0098get on a roll' so to speak. I'm sure I'm not going to drink until likeâ\u0080¦ 430 when I'm driving home and I swear sometimes it feels like my car drives itself to the store. Any tips, tricks, etc to get through that hard hour of the day? It's a new month and I'd like to make this my day 1 for the long haul.    "], ["Help with Bottles / Wine", "9", "1", "2024-04-23T13:00:04.619000+0000", "https://www.reddit.com/r/linuxquestions/comments/1cb4091/help_with_bottles_wine/", "I just installed Bottles (Flatpak) from Gnome software and went on to to setup the \"Application environment\". Everything's fine. But when I went to \"Run Executable\" button and browsed to the file path where I downloaded a SETUP.EXE file , it just doesn't show up. I can't find this file. On the bottom right corner it says \"Supported Executables\", I changed it to \"All Files\" and then find that SETUP.EXE file. But even after selecting it, I got an error that says  Setup is unable to find installation languages in Z:\\run\\user\\1000\\doc\\aa186c9f\\SETUP.LID file.  What can I do?    "], ["Help with Tuscan wine visitsâ\u0080¦", "1", "3", "2024-06-15T19:28:01.819000+0000", "https://www.reddit.com/r/wine/comments/1dgpkan/help_with_tuscan_wine_visits/", "My wife and I (only) have a free day in Tuscany next week and are thinking of hiring a car and driver and doing some winery tours. We asked our travel agency and they offered a pretty steep price for car and driver for the 3 wineries below. Our anxiety is that none of them seem very highly rated or cost more than $20 per bottle, so we'd be spending a lot of money to taste inexpensive wine. That said, we could be greatly mistaken. Maybe they are local gems, very authentic and wonderful experiences. Not knowing, we reached out to all the friends we know who might have an opinion. We really could use some counsel from people who might have direct experience. We don't want to spend the whole day in the car but are willing to travel an hour or so from Florence. Apologies for long list. I pasted in verbatim. Suggested by travel agentâ\u0080¦ Casa Emma (tour & tasting) - https://casaemma.it/en/  Colle Bereto (tour, tasting, and lunch) - https://www.collebereto.it/mob/en/  Badia al Coltibuono (tour and tasting) - https://www.coltibuono.com/en/  Suggested by a sommelier friend (verbatim)â\u0080¦ Antinori Chianti Classico has a stunning winery to visit with a restaurant.  I think that would be worth seeing/tasting. Others areâ\u0080¦ Tenuta di Capezzana Castella di Ama Fontodi Villa di Geggiano â\u0080¦all within (or just over) an hour from Florence. Suggested by a restaurateur in Florence (verbatim)â\u0080¦ Montepulciano: -Contucci is the end all. One of the most historic, right in the middle of the town a crazy palazzo. Andrea of the family is one of the nicest guys alive. I've sent so many friends and family there and they always rave it's a great visit.  www.contucci.it  -Il Conventino- I haven't been in years and years but lovely property  www.ilconventino.it  Montalcino: Wineries: Le Ragnaie... an ever favorite of ours for the wines and them as people as they are very dear friends! So great!  https://leragnaie.com/en/  Baricci- So classic and so wonderful. Much smaller winery so for a more so authentic feel, his sons both speak great English.  http://www.baricci.it/  Conti Costanti -a historic and stunning property. They are super used to doing visits and have a person how handles tours of the property. They also happen to share a wall to the cantina with Il Colle! Who we adore but isn't big on visits and I don't believe have an English speaker usually available.  http://www.costanti.it/  Tiezzi- Amazing wines and also lovely to see. They have had some of our guests visit before and they raved about it.  http://www.tiezzivini.it/index.php?lg=en  Montalcino Restaurants: Il Leccio, best ravioli ever!! Its in the middle of nowhere but I can never resist truly the food is sublime. Traditional and simple but on point.  http://www.trattoriailleccio.com/  Drogheria and Locanda Franci â\u0080\u0093 they are a all BIO wine place that has an enoteca in centro too and the restaurant has a lovely terrace  http://www.locandafranci.com/  Le Potazzine: great food of this little place in centro and they also have a winery you can visit. (not in the same location)  https://lepotazzine.com/vineria-le-potazzine/  Chianti: So chianti is rather large, I'll try to list a few of my favorite areas. Lamole: Always a fun visit to this area and if you wanted to do more than one visit they are very close and the best spot for lunch is also all kind of in the same little area. -I Fabbri, Susanna is the female owner and winemaker super kind and welcoming with our clients. Great wines that we have been proud to feature in the wine club.  www.ifabbrichianticlassico.it  -Fattoria di Lamole, Paolo Socci is the man for history in Lamole, lovely wines.  www.fattoriadilamole.it  -Ristoro di Lamole great restaurant with nice local wine list, great view. We always bump into other industry people when we are there.  www.ristorodilamole.it  Panzano: Or a visit to Panzano area of course all of the Dario Cecchini restaurants make for a fun visit with friends or family visiting. Although I have to say we recently visited the Enoteca Baldi and their wine list is really special! I highly recommend a lunch there!  www.enotecabaldi.it  -Montebernardi is a lovely visit. Michael is American and makes some awesome wines. Been here for a lifetime and is super respected.  www.montebernardi.com  -Fontodi super close also and always a pretty visit  www.fontodi.com  Radda: Lunch at Osteria Le Panzanelle is usually where we still go even if we are in Radda unless we have lunch at a producers home with them.  www.lepanzanelle.it  -Tenuta di Carleone is hot right now wine club featured wine and he just built his new winery and now takes visits.  www.tenutadicarleone.com  -Monteraponi also a very pretty visit it's cute with rooms and built in an old little borgo.  www.monteraponi.it  -Istine Angela Fronti great winemaker and lovely visit  www.istine.it  Barberino Val d'Elsa: Monsanto is a very impressive visit and great for people in transit as it's not far from the highway. Their cellars are some of the most impressive out there.  www.castellodimonsanto.it  Ristorante Arnolfo just closed their historic location and opened an amazing new one, high end dining and always a home run for us for special occasions. On the pricy side but wine list is bananas.  www.arnolfo.com  Any advice is most welcome!    "]]